{
  "w0xws9m3ts": {
    "address": "Bagan Datuk, Perak, Malaysia 36100",
    "contact": "05 6467208",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.962227,
      "longitude": 100.752079
    },
    "name": "MASJID AL - KHAIRIAH WATANIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "6276c4d9-9d6e-4cc8-aeb2-949fde849896",
    "geohash": "w0xws9m3ts",
    "remarks": "Sebelum masjid dibina, hanya sebuah surau didirikan untuk kegunaan penduduk kampung. \r\nPenduduk membuat permohonan untuk mendirikan sembahyang jumaat dan mendapat kelulusan dari MAIPk. \r\nTahun 1962, sebuah masjid yang dibina berasskan 70% kayu dan 30% batu boleh menampung 100 hingga 120 jemaah untuk solat jumaat dalam satu-satu masa. \r\nTahun 1964, masjid telah dirasmikan oleh Yang Mulia Raja Muda Perak, Raja Idris Ibni Raja Iskandar.\r\nTahun 1983, ia telah dibesarkan lagi kerana jumlah jemaah yang semakin bertambah.",
    "source_musolla_id": "MY-08-HP-00212"
  },
  "w0xwsc3msu": {
    "address": "Bagan Datuk, Perak, Malaysia 36100",
    "contact": "0194706720",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.962912,
      "longitude": 100.75754
    },
    "name": "MASJID AL -QURO PEKAN BAGAN DATOH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "25ea58bc-ac2a-4d8b-b351-f34bcd121700",
    "geohash": "w0xwsc3msu",
    "remarks": "masjid al quro bagan datoh, mula dibangunkan pada tahun masihi 1917 (bulan mei) di atas tanah yang diwakafkan oleh tuan hj nurdin( gelarannya haji debab) seluas kira-kira 3/4 ekar (sebelum itu ahli jemaah bersolat di surau dan solat jumaat di kg teluk penikam dan pasang api.\r\n\r\nbangunan masjid asal diatas tanah tersebut didirkan dengan daya usaha allahyarham dato penghulu embi bersama beberapa orang tua termasuk juga tuan guru agama ketika itu allahyarham tuan haji abdul rahman,allahyarham encik yahya, kerani penghulu allahyarham tok batu, dato penghulu awang, encik warid, tuan haji arshad, en tohid tok aki janah, pak lebai abdullah, encik tot serta beberapa orang lagi yang tidak dapat dikesan namanya.\r\n\r\nperbelanjaan mendirikan masjid ini, dipungut daripada orang ramai dari kampung yang berhampiran yang dianggarkan sebanyak rm5000 (separuh batu dan diatasnya papan)\r\n\r\nbangunan tersebut diguna pakai berterusan sehingga tahun 1962, dengan beberapa bahagiannya diubahsuai mengikut keperluan jemaah, terutama jemaah hari jumaat yang bertambah ramai bilangannya serta juga jemaah musim hari raya puasa dan hari raya haji. masjid tersebut diberi nama oleh allahyarham tuan guru haji abdul rahman, dengan nama masjid al quro' bagan datoh.\r\n\r\npada awal tahun 1963,allahyarham tuan guru haji abdul rahman telah berusaha memohon kepada yb encik sulaiman b dato' bulon ketika itu beliau sebagai ahli parlimen bagan datoh dan menjawat sebagai menteri muda pembangunan luar bandar telah meluluskan sebuah masjid baru di atas tapak masjid lama dengan anggaran sebanyak rm50,000 dan itulah permulaannya bangunan yang ada sekarang dengan sedikit sebanyak telah diubahsuai mengikut keadaan semasa.\r\n\r\njawatankuasa binaan masjid tersebut telah dipilih juga sebagai jawatankuasa pentadbir masjid baru itu selama 2 tahun dan bertukarganti jawatankuasanya didalam mesyuarat agung tahunan masjid itu sehingga sekarang.",
    "source_musolla_id": "MY-08-HP-00213"
  },
  "w0xwshujwm": {
    "address": "Bagan Datuk, Perak, Malaysia 36100",
    "contact": "014-3077462",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.982145,
      "longitude": 100.728425
    },
    "name": "MASJID ISMAILLIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "1a4c0278-f175-418d-ac90-7edd2b15cde8",
    "geohash": "w0xwshujwm",
    "remarks": "pada tahun 1904 masjid ini telah dibina diatas tanah di kg sungai ular.pembinaan ini dilakukan diatas usaha gotong-royong penduduk kampung dan usaha wakaf diatas kesedaran seluruh penduduk kampung dalam mengembangkan syiar islam.\r\n\r\npada tahun 1926 dalam tempoh 22 tahun masjid ini dipindahkan di sebuah tanah di kg sungai betul. tanah ini adalah diwakafkan oleh seorang yang bernama tuan hj ismail b rani. keluasan tanah ini adalah 1 setengah ekar. diatas pemberian ikhlas untuk mendirikan sebuah masjid maka masjid ini dinamakan masjid ismailiah bersempena dengan sumbangan pemberian tanah tersebut.\r\n\r\nmasjid ini telah banyak dibaik pulih dan diubahsuai dengan bantuan wakaf orang ramai. disamping itu bantuan disalurkan dari agensi kerajaan dan daripada ahli yang berhormat parlimen.",
    "source_musolla_id": "MY-08-HP-00234",
    "provision": "-tempat wudhu\r\n-telekung\r\n-sejadah\r\n-ruang masak\r\n-parkir\r\n-tandas awam\r\n-kerusi orang kurang upaya",
    "directions": "terletak di tepi jalan besar dan berhampiran di beting beras basah"
  }
}