{
  "w0xwpnjymm": {
    "address": "Bagan Datuk, Perak, Malaysia 36100",
    "contact": "05 6414172",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.901248,
      "longitude": 100.862617
    },
    "name": "MASJID AS - SAADAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "3d38720a-4d5b-490e-8552-297fa54cfff1",
    "geohash": "w0xwpnjymm",
    "remarks": "Masjid Kampung Sungai Dulang Dalam mula dibina di awal tahun 50an bertempat di Sungai Baru, keluasan masjid ialah 25 x 30 kaki di bina bangunan batu konkrit pada tahun 1958.\r\nDengan persetujuan penduduk memohon bantuan daripada kerajaan dan separuhnya di biayai oleh pihak penduduk. Maka terbinalah sebuah masjid baru dengan keluasan 30 x 30 kaki persegi diatas tapak tanah keluasan 100 kaki persegi yang diwakafkan oleh Tuan Haji Jabar. Jarak daripada masjid lama ialah 600 meter dan masjid lama masih kekal dan dijadikan surau dikawasan tersebut.\r\nMasjid baru telah didaftarkan dan diberi nama Masjid As-Saadah Kampung Sungai Dulang Dalam.",
    "source_musolla_id": "MY-08-HP-00223",
    "provision": "- tempat wudhu\r\n- telekung\r\n- sejadah\r\n- bilik mesyuarat\r\n- bilik pegawai masjid\r\n- ruang makan\r\n- ruang memasak\r\n- tandas awam\r\n- kerusi orang kurang upaya\r\n- perpustakaan"
  },
  "w0xwkmvcds": {
    "address": "Jalan Simpang Tiga-Simpang Empat, Kampung Sungai Nipah, 36200 Rungkup, Perak, Malaysia 36200",
    "contact": "05 6468103",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.942998,
      "longitude": 100.741652
    },
    "name": "MASJID AL - FALAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "21cb29a1-0316-4a95-a916-9aad4653425f",
    "geohash": "w0xwkmvcds",
    "remarks": "Pada tahun 1937 secara bergotong-royong dan wakaf daripada orang ramai telah membina sebuah masjid. Pada tahun 1984, bangunan masjid telah dibaiki dengan kos pembinaan hasil kutipan derma daripada orang ramai.Pada bulan April 2007, hampir keseluruhan bangunan masjid telah dinaik taraf dengan menggantikan bahagian atap zink biasa dengan zink metal deck warna biru. Dinding kayu diganti dengan dinding batu dan cermin sliding. Lantai luar dan dalam ditinggikan lagi seperti yang ada sekarang.",
    "source_musolla_id": "MY-08-HP-00202"
  },
  "w0xws9m3ts": {
    "address": "Bagan Datuk, Perak, Malaysia 36100",
    "contact": "05 6467208",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.962227,
      "longitude": 100.752079
    },
    "name": "MASJID AL - KHAIRIAH WATANIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "6276c4d9-9d6e-4cc8-aeb2-949fde849896",
    "geohash": "w0xws9m3ts",
    "remarks": "Sebelum masjid dibina, hanya sebuah surau didirikan untuk kegunaan penduduk kampung. \r\nPenduduk membuat permohonan untuk mendirikan sembahyang jumaat dan mendapat kelulusan dari MAIPk. \r\nTahun 1962, sebuah masjid yang dibina berasskan 70% kayu dan 30% batu boleh menampung 100 hingga 120 jemaah untuk solat jumaat dalam satu-satu masa. \r\nTahun 1964, masjid telah dirasmikan oleh Yang Mulia Raja Muda Perak, Raja Idris Ibni Raja Iskandar.\r\nTahun 1983, ia telah dibesarkan lagi kerana jumlah jemaah yang semakin bertambah.",
    "source_musolla_id": "MY-08-HP-00212"
  },
  "w0xwsc3msu": {
    "address": "Bagan Datuk, Perak, Malaysia 36100",
    "contact": "0194706720",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.962912,
      "longitude": 100.75754
    },
    "name": "MASJID AL -QURO PEKAN BAGAN DATOH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "25ea58bc-ac2a-4d8b-b351-f34bcd121700",
    "geohash": "w0xwsc3msu",
    "remarks": "masjid al quro bagan datoh, mula dibangunkan pada tahun masihi 1917 (bulan mei) di atas tanah yang diwakafkan oleh tuan hj nurdin( gelarannya haji debab) seluas kira-kira 3/4 ekar (sebelum itu ahli jemaah bersolat di surau dan solat jumaat di kg teluk penikam dan pasang api.\r\n\r\nbangunan masjid asal diatas tanah tersebut didirkan dengan daya usaha allahyarham dato penghulu embi bersama beberapa orang tua termasuk juga tuan guru agama ketika itu allahyarham tuan haji abdul rahman,allahyarham encik yahya, kerani penghulu allahyarham tok batu, dato penghulu awang, encik warid, tuan haji arshad, en tohid tok aki janah, pak lebai abdullah, encik tot serta beberapa orang lagi yang tidak dapat dikesan namanya.\r\n\r\nperbelanjaan mendirikan masjid ini, dipungut daripada orang ramai dari kampung yang berhampiran yang dianggarkan sebanyak rm5000 (separuh batu dan diatasnya papan)\r\n\r\nbangunan tersebut diguna pakai berterusan sehingga tahun 1962, dengan beberapa bahagiannya diubahsuai mengikut keperluan jemaah, terutama jemaah hari jumaat yang bertambah ramai bilangannya serta juga jemaah musim hari raya puasa dan hari raya haji. masjid tersebut diberi nama oleh allahyarham tuan guru haji abdul rahman, dengan nama masjid al quro' bagan datoh.\r\n\r\npada awal tahun 1963,allahyarham tuan guru haji abdul rahman telah berusaha memohon kepada yb encik sulaiman b dato' bulon ketika itu beliau sebagai ahli parlimen bagan datoh dan menjawat sebagai menteri muda pembangunan luar bandar telah meluluskan sebuah masjid baru di atas tapak masjid lama dengan anggaran sebanyak rm50,000 dan itulah permulaannya bangunan yang ada sekarang dengan sedikit sebanyak telah diubahsuai mengikut keadaan semasa.\r\n\r\njawatankuasa binaan masjid tersebut telah dipilih juga sebagai jawatankuasa pentadbir masjid baru itu selama 2 tahun dan bertukarganti jawatankuasanya didalam mesyuarat agung tahunan masjid itu sehingga sekarang.",
    "source_musolla_id": "MY-08-HP-00213"
  },
  "w0xwjpwft4": {
    "address": "Bagan Datuk, Perak, Malaysia 36100",
    "contact": "019 5292867",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.908827,
      "longitude": 100.776089
    },
    "name": "MASJID AL -WASTIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "fe2134fa-fc41-4574-a7c4-934afb5e728e",
    "geohash": "w0xwjpwft4",
    "remarks": "Masjid asal didirikan menggunakan batang nibung untuk dijadikan tiang, manakala dinding dan atap diperbuat daripada kayu nipah dan lantai masjid diperbuat daripada kayu bakar.\r\n Pada tahun 1956, masjid ini telah berpindah di kawasan tengah kampung. \r\nTanah telah diwakafkan oleh Encik Mohamed. \r\nTahun 2001, pihak masjid telah memohon peruntukan dan mendapat sebanyak RM50,000.00 bagi membaik pulih masjid tersebut.\r\nSehingga kini masjid selamat digunakan oleh orang ramai.",
    "source_musolla_id": "MY-08-HP-00215"
  },
  "w0xwkc9fq9": {
    "address": "Rungkup, Perak, Malaysia 36200",
    "contact": "019 4057000",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.919766,
      "longitude": 100.758305
    },
    "name": "MASJID IDRIS SHAH 11",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "64bb8dbc-7cbd-47e0-bb32-1cf71b5b671b",
    "geohash": "w0xwkc9fq9",
    "remarks": "Diadakan satun perjumpaan antara penduduk kampung untuk membina sebuah masjid. \r\nPermohonan dibuat oleh wakil rakyat ketika itu iaitu Allahyarham Dato' Lope Hashim bin Ketong (ADUN Rungkup).\r\nTanah telah diwakafkan oleh Allahyarham Tuan Haji Wan Husain bin Wan Sulaiman seluas 1/2 ekar.\r\nNama masjid adalah berasal dari perasmian yang dibuat oleh Almarhum Duli Yang Maha Mulia Sultan Perak,Sultan Idris Shah II.",
    "source_musolla_id": "MY-08-HP-00232",
    "provision": "-tempat wudhu'\r\n-telekung\r\n-sejadah\r\n-ruang makan\r\n-ruang memasak\r\n-tandas awam\r\n-van jenazah",
    "directions": "lokasi masjid terletak di tengah-tengah pekan kecik kg sungai tiang baruh.disebelahnya terdapat sek keb sungai tiang baroh.disebelhanya terdiri sek keb sungai tiang baroh. jalan utama rungkup ke hutan melintang. 1 kilometer dari pantai laut selat melaka."
  },
  "w0xwshujwm": {
    "address": "Bagan Datuk, Perak, Malaysia 36100",
    "contact": "014-3077462",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.982145,
      "longitude": 100.728425
    },
    "name": "MASJID ISMAILLIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "1a4c0278-f175-418d-ac90-7edd2b15cde8",
    "geohash": "w0xwshujwm",
    "remarks": "pada tahun 1904 masjid ini telah dibina diatas tanah di kg sungai ular.pembinaan ini dilakukan diatas usaha gotong-royong penduduk kampung dan usaha wakaf diatas kesedaran seluruh penduduk kampung dalam mengembangkan syiar islam.\r\n\r\npada tahun 1926 dalam tempoh 22 tahun masjid ini dipindahkan di sebuah tanah di kg sungai betul. tanah ini adalah diwakafkan oleh seorang yang bernama tuan hj ismail b rani. keluasan tanah ini adalah 1 setengah ekar. diatas pemberian ikhlas untuk mendirikan sebuah masjid maka masjid ini dinamakan masjid ismailiah bersempena dengan sumbangan pemberian tanah tersebut.\r\n\r\nmasjid ini telah banyak dibaik pulih dan diubahsuai dengan bantuan wakaf orang ramai. disamping itu bantuan disalurkan dari agensi kerajaan dan daripada ahli yang berhormat parlimen.",
    "source_musolla_id": "MY-08-HP-00234",
    "provision": "-tempat wudhu\r\n-telekung\r\n-sejadah\r\n-ruang masak\r\n-parkir\r\n-tandas awam\r\n-kerusi orang kurang upaya",
    "directions": "terletak di tepi jalan besar dan berhampiran di beting beras basah"
  },
  "w0xwt3kvsu": {
    "address": "Jalan Hutan Melintang-Bagan Datoh, 36100 Bagan Datuk, Perak, Malaysia 36100",
    "contact": "011 14698297",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.962912,
      "longitude": 100.784319
    },
    "name": "MASJID AT -TAHIRIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "02a611ab-1cea-46f5-aae6-b3e04f8cb013",
    "geohash": "w0xwt3kvsu",
    "source_musolla_id": "MY-08-HP-00226"
  },
  "w0xwk9wy6m": {
    "address": "Rungkup, Perak, Malaysia 36200",
    "contact": "013 4537028",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.920473,
      "longitude": 100.754002
    },
    "name": "MASJID AL - FALAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "5bf16612-9346-4b74-b3db-db8604b69819",
    "geohash": "w0xwk9wy6m",
    "remarks": "-pewakaf tanah masjid ini ialah bilal semaun.\r\n-bermula dari surau  yang dinaiktaraf kepada masjid   \r\n-yang berhormat sulaiman b bulon (ahli parlimen bagan datoh) ketika itu memberikan peruntukan untuk membina masjid di sini.\r\n-ketika itu adun hutan melintang adalah y.bhg. dato' hj ohd abas ahmad.\r\n-sidang ketika itu ialah sidng hasan .\r\n-us nordin sebagai kadi hilir perak ketika itu yang meluluskan untuk solat jumaat di masjid ini",
    "source_musolla_id": "MY-08-HP-00203",
    "provision": "-tempat wuduk\r\n-telekung\r\n-sejadah\r\n-bilik pegawai masjid\r\n-ruang memasak\r\n-tandas awam\r\n-kerusi orabf kurang upaya",
    "directions": "-lokasi betul-betul di persimpangan ke sungai dulang.\r\n-parit 11, batu 16, 35400 hutan melintang, perak"
  },
  "w0xwv369je": {
    "address": "Lekir, Perak, Malaysia 32020",
    "contact": "05 6480540",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.006083,
      "longitude": 100.781266
    },
    "name": "MASJID AL - AZIZIAH BATU 20",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "7cca7d82-33a0-40fe-bbde-bc632cd0514c",
    "geohash": "w0xwv369je",
    "source_musolla_id": "MY-08-HP-00201",
    "provision": "-tempat wuduk\r\n-telekung\r\n-sejadah\r\n-bilik mesyuarat\r\n-pejabat masjid\r\n-ruang makan\r\n-ruang memasak\r\n-parkir\r\n-tandas awam\r\n-kerusi orang kurang upaya\r\n-rumah musafir\r\n-pondok rehat",
    "directions": "berhampiran sek men agama al-ulum al-syariyah"
  },
  "w0xwjpjyzp": {
    "address": "Jalan Hutan Melintang-Bagan Datoh, Kampung Selekoh, 36200 Rungkup, Perak, Malaysia 36200",
    "contact": "019 2268645/P",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.906836,
      "longitude": 100.774806
    },
    "name": "MASJID AL - KHAIRIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "5b7d5b87-52d5-4b66-82b0-2f85002375d4",
    "geohash": "w0xwjpjyzp",
    "remarks": "Pada tahun 1929 pembinaan masjid pertama dibena secara gotong royong setelah penduduk tempatan termasuk Tuan Hj Yusof bin Shahbudin ( Bekas Mufti Negeri Selangor yang pertama ) menjadi penggerak utama bagi pembinaan masjid tersebut.\r\n\r\n    Pada 22 Ogos 1981,bangunan lama berasaskan kayu telah diwakafkan kepada Masjid Ubudiah Kampung Baru Batu 14.\r\n\r\n   Pembinaan masjid baru telah dicadangkan oleh Jawatankuasa Masjid Khairiah pada tahun 1970 dengan cara kutipan derma daripada orang ramai,bantuan daripada Majlis Agama Islam Dan Adat Melayu Perak,Kerajaan Negeri Perak dan Kerajaan Pusat dengan jumlah kos keseluruhan RM640,000.00.\r\n\r\n   Solat Jumaat pertama kali didirikan di masjid baru ( Masjid Khairiah ) pada 14 Nov.1983 hinggalah sekarang.",
    "source_musolla_id": "MY-08-HP-00211",
    "provision": "Kemudahan yang terdapat di masjid Khairiah,Selekoh seperti ruang solat untuk lelaki dan wanita,bilik mesyuarat,dewan makan dan masak makanan,laluan berbumbung dari tempat wuduk ke bangunan dewan solat,kereta jenazah,pagar keliling masjid dan landskap sekeliling bangunan masjid.",
    "directions": "Terletak 23 batu (34.5) dari bandar Teluk Intan dan 7 batu (10.5 km) dari pekan Bagan Datoh. Dinamakan Selekoh keranan kedudukan betul-betul di selekoh \"kona\", 100 meter ditepi jalan raya besar dan 100 meter dari pekan Selekoh, di pertengahan jalan yang menghubungkan pekan Selekoh dengan bandar Teluk Intan dan pekan Bagan Datoh."
  },
  "w0xw7wsvf5": {
    "address": "Rungkup, Perak, Malaysia 36200",
    "contact": "019 5797905",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.947842,
      "longitude": 100.7073
    },
    "name": "MASJID AR - RAHMANIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "73917226-bbaa-44ee-9473-e53d1a776466",
    "geohash": "w0xw7wsvf5",
    "remarks": "masjid ini telah didirikan pada tahun 1912 dengan arahan tuan hj muhamad b hj abdul rahman beserta di sokong oleh orang ramai. pada tahun 1961 masjid ini telah dibina semula serta dibesrakan dengan arahan tn haji abdul wahab b hj abdul aziz dan dibantu oleh tn hj muahamd saman dengan mendapat bantuan daripada kerajaan persekutuan tanah melayu dan pejabat agama negeri perak dan sokongan orang ramai. masjid ini diberi nama masjid al rahmaniah sungai lanchang.",
    "source_musolla_id": "MY-08-HP-00221",
    "provision": "-tempat wudhu\r\n-telekung\r\n-sejadah\r\n-ruang makan\r\n-ruang memasak\r\n-parkir\r\n-tandas awam\r\n-kerusi orang kurang upaya",
    "directions": "masjid ini terletak di tepi jalan besar antara sg tiang ke bagan datoh"
  }
}