{
  "w0xxfsjqxv": {
    "address": "Pusat Bandar Seri Manjung, Sitiawan, Perak, Malaysia 32000",
    "contact": "05-6884372",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.19792,
      "longitude": 100.664289
    },
    "name": "MASJID NURUL HIDAYAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "12e4ff07-8908-4953-a3b6-ff1dfb219e0d",
    "geohash": "w0xxfsjqxv",
    "remarks": "tapak masjid ini adalah tanah seluas 3 ekar  yang telah digazetkan menjadi tapak masjid daerah manjung. pembinaan dimulakan pada pertengahan bulan jun 1997. kontraktor yang mengendalikan tapak projek ini bermasalah. maka projek kerja-kerja infrastruktur terlalu perlahan. tarikh masa yang dilanjutkan sehingga siap projek ini pada awal tahun 1991.\r\n\r\nperistiwa penting semasa pembinaan masjid ini ada sebuah kuil hindu berada di dalam tapak pembinaan, maka beberapa orang hindu di komuniti tidak mahu memindahkan kuil tersebut. maka dengan kebijaksanaan kerajaan negeri telah memberi sebidah tanah di kg dato seri kamaruddin, dengan itu barulah orang-orang india dan komunitinya dapat memindahkan kuil tersebut.maka tempoh persiapan yang memakan jangka masa hampir 4 tahun.pada bulan januari 1991 masjid nurul hidayah ini telah di buka dengan menyediakan ruang solat 1500 orang.",
    "source_musolla_id": "MY-08-MJG-00046",
    "provision": "-tempat wudhu\r\n-telekung\r\n-sejadah\r\n-ruang memasak\r\n-parkir\r\n-kedai perniagaan\r\n-tandas awam\r\n-tandas orang kurang upaya\r\n-ruang bilik kuliah\r\n-gazibo (pondok rehat",
    "directions": "masjid nurul hidayah ini terletak di daerah pusat bandar seri manjung dan bersebelahan dengan jalan dari ipoh ke lumut dan bersebelahan juga pejabat ipd ibu pejabat polis daerah manjung, bangunan masjid ini merupakan mercu tanda kebanggaan umat islam di daerah manjung yang memayungi segala kegiatan masjid-masjid di dalam daerah ini."
  },
  "w0xxfr2tpb": {
    "address": "Lumut, Perak, Malaysia 32200",
    "contact": "0125213323",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.215489,
      "longitude": 100.646774
    },
    "name": "MASJID JAMEK AL-IKHWAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "93275a9a-911d-497c-98f2-d764b49242a9",
    "geohash": "w0xxfr2tpb",
    "remarks": "1. 2003- mula menyewa  seunit rumah berkembar di no. 209 jalan sutera desa manjung raya sebagai surau sementara.  \r\n              2. Mac 2007- pembinaan surau baru dengan peruntukan dari Pejabat daerah Manjung sebanayak RM115,000.00.\r\n              3. Julai 2007 - Surau mula digunakan.\r\n              4. Oktober 2010- Mendapat kelulusan naik taraf dari Surau kepada Masjid Jamek Al-Ikhwan.",
    "source_musolla_id": "MY-08-MJG-00590",
    "provision": "-tempat wuduk\r\n-telekung\r\n-sejadah\r\n-bilik mesyuarat\r\n-bilik pegawai masjid\r\n-ruang makan\r\n-parkir\r\n-tandas awam\r\n-ruang bilik kuliah\r\n-ruang musafir\r\n-kawasan riadah",
    "directions": "1. Terletak dalam lot 16514.\r\n             2. Jarak 4 Km dari pusat bandar seri manjung .\r\n             3.  Bersebelahan dengan lebuh raya Ipoh -Lumut serta berhadapan dengan Taman Rekreasi Paya bakau.\r\n             4. Lokasi Kawasan kedudukan Masjid Al-Ikhwan dikenali sebagai Venice of Perak"
  },
  "w0xxftwfn3": {
    "address": "2013 Lorong Gelama 3, 32200 Lumut, Perak, Malaysia 32200",
    "contact": "017-5575309",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.205366,
      "longitude": 100.666281
    },
    "name": "MASJID JAMEK AL-IHSAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "15cd13e2-9a95-4bc9-a88b-92d046c6c661",
    "geohash": "w0xxftwfn3",
    "remarks": "1. Pada asal nya  masjid jamek al ihsan  ada lah sebuah surau yang dibina pada tahun 1994 dengan kos perbelanjaan RM60,000 hasil dana sumbangan orang ramai. sebahagian daripada bangunan di sebelah kanan digunakan sebagai sekolah agama rakyat. Oleh kerana pertambahan penduduk disebabkan pembangunan di kawasan persekitaran pihak pengurusan dengan kerjasama ahli kariah telah membuat penambahan di sebelah kiri bangunan asal.\r\n     2. Oleh kerana pertambahan penduduk dan bagi memudahkan penghuni setempat mengerjkan solat jumaat, pihak pengurusan telah memajukan permohonan kepada Majlis Agama Islam Negeri Perak untuk dinaikan taraf sebagai Surau Diri Jumaat mulai 25 Julai 2008.\r\n     3.  Peredaran masa terus berlaku, kesan dari pembangunandengan pertambahan taman-taman perumahan dan pejabat swasta berhampiran pihak jawatankuasa telah memajukan permohonan kepada Majlis Agama Islam Perak untuk menikkan taraf Surau Diri Jumaat dijadikan Masjid Jamek. Permohonan telah diperkenankan dan mulai 05 Mac 2010 ia nya mula beroperasi sebagai masjid dengan pendaftaran JAPK/BPM/M/MJG/43",
    "source_musolla_id": "MY-08-MJG-00589",
    "provision": "- tempat wuduk\r\n- telekung\r\n- sejadah\r\n- pejabat masjid\r\n- ruang memasak\r\n- parkir\r\n- kedai perniagaan\r\n- tandas awam\r\n- kerusi orang kurang upaya\r\n- ruang bilik kuliah"
  }
}