{
  "w0xygq1gx2": {
    "address": "Durian Sebatang, Perak, Malaysia 36000",
    "contact": "0134548096",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.032587,
      "longitude": 101.04398
    },
    "name": "MASJID AS - SAADAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "3d5e15a5-a8df-4a25-8ab7-57f63b65e4ae",
    "geohash": "w0xygq1gx2",
    "remarks": "sebuah kampung tanpa masjid samalah seperti sebuah bandar tanpa taman dan sebuah taman tanpa bunga. begitulah keadaan kampung bahagia yang telah mula dihuni semakin ramai penduduknya yang berhijrah ke tempat baru dengan membawa resam hidup masing-masing. maka resam hidup melayu tidaklah pernah renggang dengan masjid walaupun dimana mereka berada. setahun selepas merdeka dalam tahun 1958, penduduk kampung ini yang namanya singai nibong hanya sembahyang berjemaah di sebuah surau kecil, imammya haji darmawi b hj jafri.mereka tidak mendirikan sembahyang jumaat.\r\n\r\napabila penduduk bertambah ramai maka surau kecil itu dipindahkan ke sekeping tanah yang diwakafkan oleh haji omar bertempat di hadapan masjid sekarang. untuk mendirikan sembahyang jumaat jabatan hal ehwal agama islam diperlukan dengan syarat jawatankuasa masjid mestilah diasaskan. jawatankuasa ini dipengerusikan oleh yb tok hahi mohd abas b ahmad.setiausahanya hj omar dan bendaharinya hj abd manaf b hj abd hamid dengan 9 jawatankuasanya. sembahyang jumaat dimulakan setelah semuanya dapat diselesaikan. surau yang telah dijadikan masjid ini terpaksa dibesarkan kerana penduduknya bertambah ramai. sebuah surau dari kg bandar telah dipindahkan ke kg bahagia bagi menampung membesarkan masjid. semuanya atas daya usaha s.f. tuan guru hj hamdan b hj idris.\r\n\r\njawatankuasa masjid pada masa itu memulakan usaha mendapatkan tanah tapak masjid dan akan mendirikan masjid.dengan berkat usaha yang gigih mereka dapat membeli tapak masjid yang ada sekarang. oleh sebab usaha mereka mendapatkan bantuan kerajaan terlalu lambat, maka dengan tekanan penduduk dan tuan guru hj hamdan, maka 1 mesyuarat agung telah diadakan dan sebuah jawatankuasa baru dibentuk di pengerusikan oleh haji tahir b tedoh, setiausaha-abdullah b abd hamid, bendahari-hj mohd arshad b hj ismial dan 9 orang jawatankuasa baru.\r\n\r\nsetahun setelah jawatankuasa baru dilantik iaitu setahun selpesa tragedi 13 mei 1969 maka wang rm50,000 telah dapat dikumpulkan. dengan bantuan kerajaan rm50,000 maka kerja membina masjid dimulakan. dengan beberapa gangguan pada tahun 1974 masjid itu siap dibina dan mula digunakan sebagai tempat ibadah yang selesa. malangnya masjid selalu tirih (bocor) ketika hujan dan penduduk pula bertambah ramai, akhirnya jawatankuasa mengambil keputusan membesarkan masjid ini disebelah hadapan, dengan tambahan 40 kaki*60 kaki. tidak lama kemudian masjid tambahan siap pada tahun 1984 dan tambahan siap pada tahun 1984 dan atap masjid yang tirih ditukar pula dengan atap baru yang ada pada hari ini.\r\n\r\nakhirnya pada 1990 sekali lagi atas desakan s.f tuan guru haji hamdan b haji idris, sekali lagi masjid ini dibesarkan dengan belanja rm300,000 dengan perbelanjaan sendiri.kerja ini selesai pada tahun 1994.\r\n\r\nsegala pujian bagi allah yang mengurniakan segala kemudahan dapat diusakan dengan berkat pengorbanan dan kerjasama yang erat dari seluruh penduduk kg bahagia, serta panduan dan galakan yang tidak berhenri dari tuan guru kita s.f tuan hj hamdan b haji idris.marilah kita meneruskan kerjasama ini untuk memeulakan pembinaan rumah wakaf yang akan membantu memudahkan pengurusan masjid bagi masa yang lebih cemerlang, gemilang dan terbilang dan berpanjangan jauh lebih lanjut dari umur kita.in sha allah.",
    "source_musolla_id": "MY-08-HP-00224"
  },
  "w0xyeksx3r": {
    "address": "Kampung Selabak, Durian Sebatang, Perak, Malaysia 36000",
    "contact": "05 6215827",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.981082,
      "longitude": 101.047498
    },
    "name": "MASJID AS - SAADAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "2504f812-f21a-4b84-9553-ca290c3d02b8",
    "geohash": "w0xyeksx3r",
    "remarks": "Didirikan di atas sebidang tanah hasil wakaf dari ketua kampung iaitu Allahyarham Kasbullah.\r\nPengasas masjid ialah Allahyarham Kiyai Hj. Asiff, pengerusi pertama pula ialah Hj. Ahmad Sidek Bin Hj. Asiff.\r\nPada mulanya ia hanya dapat menampung hanya 70/80 jemaah, namun pada masa kini ia sudah boleh menampung seramai 800 jemaah dalam satu-satu masa. \r\nTahun 2007, AJK Kariah akan melakukan naik taraf dan baik pulaih masjid. \r\nKini, kerja-kerja tersebut sedang dalam proses pembaik pulihan.",
    "source_musolla_id": "MY-08-HP-00222",
    "provision": "1.   PA Sistem.\r\n2.   Bilik Imam dan Bilal.\r\n3.   Stor.\r\n4.   Bilik mesyuarat.\r\n5.   Bilik Pejabat Pentadbiran.\r\n6.   Sebuah tandas dan tempat wuduk lelaki.\r\n7.   Sebuah tandas dan tempat wuduk wanita.\r\n8.   Sebuah tandas awam.\r\n9.   Sebuah balai lintang.\r\n10. Sebuah garaj.\r\n11. Sebuah setor barang dan dapur."
  },
  "w0xy0zxuz7": {
    "address": "Taman Desa Bernam Baru, 36400 Teluk Baru, Perak, Malaysia 36400",
    "contact": "019 5477066",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.909223,
      "longitude": 100.942356
    },
    "name": "MASJID AZIZIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "8c1bc23a-3456-4784-b634-bc2cd5d2483b",
    "geohash": "w0xy0zxuz7",
    "remarks": "Tapak asal terletak di belakang deretan kedai batu 10,berpindah ke tapak masjid seluas 1 ekar yang diwakaf oleh seorang berbangsa India ( nan muslim )  \r\nTahun 2004, masjid ini telah dirobohkan untuk dibina sebuah masjid baru. \r\nPenghujung tahun 2007, masjid baru telah digunakan sehingga sekarang.",
    "source_musolla_id": "MY-08-HP-00228",
    "provision": "-tempat wudhu\r\n-telekung\r\n-sejadah\r\n-bilik mesyuarat\r\n-bilik pegawai masjid\r\n-pejabat masjid\r\n-ruang makan\r\n-ruang memasak\r\n-parkir\r\n-kedai perniagaan\r\n-tandas awam\r\n-tandas orang kurang upaya\r\n-perpustakaan\r\n-ruang it\r\n-ruang bilik kuliah\r\n-gazibo\r\n-pondok rehat"
  },
  "w0xy0c93tr": {
    "address": "Kampung Tersusun Sungai Ipel, Hutan Melintang, Perak, Malaysia 36400",
    "contact": "018-9880771",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.875724,
      "longitude": 100.933345
    },
    "name": "MASJID JAMEK PEKAN HUTAN MELINTANG",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "aad111e9-4795-4afb-ad88-19b002b2e3b0",
    "geohash": "w0xy0c93tr",
    "remarks": "pada awalnya masjid hutan melintang ini terletak di dalam kawasan perkampungan kampung teluk, iaitu perkampungan asal penduduk yang terletak di persisiran sungai bernam. pada waktu itu, kawasan tersebut belum dimajukan lagi dengan jeti-jeti nelayan seperti yang ada sekarang ini. oleh kerana masjid ini berada berhampiran dengan sungai, ianya terdedah kepada hakisan dan juga banjir air pasang.\r\n\r\npada masa yang sama, ramai penduduk dari kampung ini telah berpindah ke kawasan baru bagi mengelakkan banjir, maka terbentuklah kg tersusun bumi hijau. bagi memudahkan penduduk beribadat, masjid yang terletak di kampung teluk diruntuhkan dan dipindahkan ke tapak yang ada sekarang ini dan dibuat pembesaran.",
    "source_musolla_id": "MY-08-HP-00243"
  },
  "w0xy0vg4qh": {
    "address": "Hutan Melintang, Perak, Malaysia 36400",
    "contact": "019 6489576",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.899183,
      "longitude": 100.935781
    },
    "name": "MASJID AN - NUR",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "ed141da3-8c36-4142-876e-664e3fc2fcf9",
    "geohash": "w0xy0vg4qh",
    "remarks": "tapak masjid an-nur kg sg samak adalah hasil drma daripada orang ramai.pembelian tanah hj nor adalah seluas 1 ekar 0 rod.04.000 pol. sebelum didirikan masjid asalnya ialah sebuah surau. pengasas masjid an nur ialah sidang oertama kg sg samak ialah md isa di bantu antaranya oleh pak yai nawawi, pak yai toha, pak yai sarkowi, pak yai masduki, imam mustain, hj abdul hamid, pak zakaria dan pak abdullah.\r\n\r\nbangunan depan (ibu) adalah hasil wakaf daripada orang ramai sepenuhnya dengan kos rm1700.00. bahan binaannya di beli teluk intan dan dibawa menaiki tongkang. bahan-bahan binaan dipikul beramai-ramai ketika menaiki darat, kemudia di bawa ke tapak pembinaan dan didirikan secara bergotong royong.\r\n\r\nbangunan tambahan (serambi ) adalah bantuan dari kerajaan negeri sebanyak rm50,000\r\n\r\nserambi tambahan lagi ( wakaf) sebnayak rm30,000\r\ndewan rm40,000\r\nsoyok rm30,000\r\ntempat wuduk rm10,000\r\n\r\ndinamakan masjid an nur ialah kerana tapak asalnya tanah embah hj nor",
    "source_musolla_id": "MY-08-HP-00220",
    "provision": "-KEMUDAHAN TEMPAT WUDHU\r\n-TELEKUNG\r\n-SEJADAH\r\n-RUANG MAKAN\r\n-RUANG MEMASAK\r\n-PARKIR\r\n-TANDAS AWAM\r\n-RUANG BILIK KULIAH"
  },
  "w0xydupmsd": {
    "address": "Kampung Banjar, Durian Sebatang, Perak, Malaysia 36000",
    "contact": "0195755148",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.978007,
      "longitude": 101.029446
    },
    "name": "MASJID AL - KHAIRIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "e437463e-570c-435f-a8de-50bd1cd0a4ea",
    "geohash": "w0xydupmsd",
    "remarks": "Bangunan masj9id ini mula d8ibina secara bergotong-royong oleh penduduk kampung sekitar tahun 1927. Masjid ini dirasmikan pada 20hb. Nov 1964 oleh Duli Yang Mulia Raja Muda Perak, Raja Musa Ibni Almarhom Sultan Abdul Aziz.\r\n\r\nBangunan masjid sentiasa diperbaiki dan diperbesarkan mengikut keperluan penduduk setempat. Mengikut tarikh yang bertulis pada mimbar yang diwakafkan oleh seprang Hamba Allah ialah pada 29hb. disember 1941. Pada hari ini dengan ruang solat utama dipasang alat penghawa dingin bagi keselesaan para jemaah menunaikan ibadat. Dalam kawasan masjid juga terdiri satu blok bangunan untuk kegunaan Sekolah Rendah Agama Rakyat (SRAR).",
    "source_musolla_id": "MY-08-HP-00210"
  },
  "w0xyf8nmdx": {
    "address": "Taman Seri Setia, Durian Sebatang, Perak, Malaysia 36000",
    "contact": "019 5780705",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.000006,
      "longitude": 101.016997
    },
    "name": "MASJIDUN  NAIM",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "53435b6e-919d-4ffb-aef5-101620b61503",
    "geohash": "w0xyf8nmdx",
    "remarks": "Tanah yang diwakafkan oleh Syarikat Perumahan Orang-Orang Melayu Teluk Intan.\r\nKos pembinaan adalah daripada kutipan orang awam di sekitar Taman Seri Setia dan Padang Tembak.",
    "source_musolla_id": "MY-08-HP-00219",
    "provision": "-ruang tama=bahan solat dibina di kedua-dua bahagian sisi masjid bagi menampung bilangan jemaah\r\n-sebuah balai lintang turut dibina sebagai dwi-fungsi iaitu sebagai ruang tambahan solat terutama hari jumaat, juga sebagai pusat aktiviti masjid.\r\n-bangunan tambahan tandas berasingan untuk muslimah dan oku turut disediakan bagi memenuhi keperluan.\r\n-tempat wudhu tambahan juga ditambah teruatama pada pintu masuk masjid bagi keperluan jemaah ( terdapat 5 kawasan mengambil wudhu')\r\n-sebuah perpustakaan dengan kemudahan bilik kuliah dibina untuk menampung keperluan kelas pengajian.\r\n-bilik imam dan bilik siaraya dibina khas untuk kemudahan solat berjemaah.\r\n-ruang solat juga dilengkapi dengan sistem penghawa dingin\r\n-sebuah pejabat masjid dan bilik gerakan disediakan di bahagian belakang masjid.\r\n-bagi menampung keperluan mengadakan aktiviti biro wanita dan urusan rumah tangga, sebuah dewan an nisa' disediakan bagi tujuan tersebut.dewan ini juga digunakan sebagai kelas pengajian. turut disediakan adalah dewan khas untuk aktiviti belia. \r\n-sebuah rumah tetamu dan dijadikan juga sebagai homestay, turut menjadi kemudahan dimasjid ini.\r\n-selain dari binaan kemudahan asas , masjid turut menyediakan kemudahan/ alatan lain yang dapat dimanfaatkan oleh pengunjung, ini termasuk kemudahan alatan kecemasan seperti strecher, kerusi roda, alat memeriksa tekanan darah dan sebagainya.\r\n-kemudahan sukan juga turut disediakan dan akan ditambah dari masa ke semasa."
  },
  "w0xyg3n4vr": {
    "address": "Durian Sebatang, Perak, Malaysia 36000",
    "contact": "0135310970",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.005027,
      "longitude": 101.049727
    },
    "name": "MASJID ABDUL SALAM AL - MAS UD",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "83bfc227-81de-4785-b5b2-78181f5b1b53",
    "geohash": "w0xyg3n4vr",
    "remarks": "Dibina oleh orang-orang Jawa yang berhijrah ke Malaysia dari Indonesia. \r\nSekitar tahun 1962, pembinaan masjid dibiayai oleh sumbangan oarang ramai dan peruntukan oleh kerajaan. \r\nTahun 2007, pembinaan semula yang dibiayai oleh Kerajaan Persekutuan di bawah Menteri di Jabatan Perdana Menteri.\r\nNama masjid telah diberikan pada tahun 1998.",
    "source_musolla_id": "MY-08-HP-00196"
  },
  "w0xyftx2ph": {
    "address": "Teluk Intan, 36000 Durian Sebatang, Perak, Malaysia 36000",
    "contact": "05 6412325",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.029258,
      "longitude": 101.018564
    },
    "name": "MASJID AL - GHAZALI",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "1bf2a1c9-35ea-4ac6-b195-c17e3fa38a28",
    "geohash": "w0xyftx2ph",
    "remarks": "pada tahun 1962 masyarakat kg batu 8 dan kg sungai buluh serta penghulu mukim telah mengambil kata sepakat menubuhkan jawatankuasa untuk memohon kepada pihak jabatan agama islam perak agar dapat membenarkan didirikan sebuah masjid di kg batu 8 ini.\r\n\r\npengasas/penasihat masjid ialah allahyarham tuan hj shaarani b mat akib bekas ketua kg teluk bharu pada tahun lima puluhan telah bersetuju mewakafkan 60'x80' dari tanah beliau untuk menjadi tapak masjid ini.\r\n\r\nhasil sumbangan dari orang ramai dan yang berbahgia dato' laksamana raja mahkota dato' mohd ghazali, penaung masjid ini telah berjaya mendirikan sebuah masjid kayu yang boleh menampung jemaah lebih kurang 100 orang. dalam tahun 1965,masjid ini mula digunakan untuk mendirikan sembahyang jumaat dan lain-lain aktiviti agama.pengerusi masjid ketika itu ialah encik mohamad b jalal dan jawatankuasa atas persetujuan tuan hj shaarani b mat akib bersetuju menamakan masjid ini masjid al-ghazali sempena mengenang jasa yang berbagia dato' laksamana raja mahkota dato' mohd ghazali kepada masjid ini.\r\n\r\npada tahun 1974 masjid ini telah dirasmikan oleh kebawah duli yang maha mulia raja muda perak.\r\n\r\npada tahun 1982 kerajaan persekutuan telah membina sebuah sek. men. sains teluk intan diseberang kg batu 8.dengan kerjasama penghulu tuan haji ayob dan penghulu hj shaarani b mohamad menjadi penghulu mukim teluk bharu dan dari belaulah tercetusnya untuk membina masjid baru yang lebih besar bagi menampung murid-murid dan guru-guru sekolah tersebut.\r\n\r\najk bertindak telah berjumpa dengan tuan hj shaarani b mat akib untuk mendapatkan kebenaran tanah untuk tapak. dengan persetujuan beliau melebarkan wakaf tanah beliau kepada 100'x120' bagi mendirikan masjid baru. pada tahun 1985 kerajaan negeri telah memberi peruntukan sebanyak rm230,000 bagi membina masjid baru yang boleh menampung jemaah seramai 400-450 orang, termasuk pelajar sek men sains teluk intan.\r\n\r\npengerusi masjid ketika itu Y.b dato haji shaarani b mohamad dari masa ke semasa masjid ini diubahsuai dengan membina kolah, tandas, serambi kiri dan kanan serta pagar batu melebihi rm100,000 seperti yang ada sekarang dari sumbangan y.b dan orang ramai untuk keselesaan jemaah.",
    "source_musolla_id": "MY-08-HP-00205",
    "provision": "-kolah untuk lelaki\r\n-paip air ( untuk lelaki /wanita)\r\n-bilik mandi lelaki / wanita\r\n-tandas lelaki/ wanita\r\n-satu bilik urusetia (pejabat) ada penyaman udara\r\n-satu bilik stor sejadah\r\n-satu bilik mesyuarat\r\n-satu bilik stor kelengkapan memasak\r\n-ruang jamuan untuk wanita\r\n-ruang tempat sembahyang\r\n -dewan solat lelaki/wanita disebelah dalam\r\n -dewan solat kanan, kiri dan hadapan masjid\r\n -kipas angin sebelah kanan\r\n  -kipas syiling\r\n  -kipas lekap\r\n  -kipas berdiri\r\n-jadual waktu solat ada 4 buah\r\n-meja untuk mesyuarat 2 bangku 15\r\n-meja urusetia 1 buah bangku 1 buah\r\n-p.a sistem/mic"
  },
  "w0xyfu1yd8": {
    "address": "Durian Sebatang, Perak, Malaysia 36000",
    "contact": "05-6225895",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.022116,
      "longitude": 101.0218
    },
    "name": "MASJID DAERAH SULTAN IDRIS SHAH II",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "8f8fb5ce-39f6-4510-9c4a-a40577f8ab4a",
    "geohash": "w0xyfu1yd8",
    "remarks": "keluasan tanah tapak masjid ini lebih kurang 3 ekar. tapak masjid ini pada asalnya ialah tapak rumah rehat teluk intan yang lama. cetusan idea membina masjid daerah ini bermula pada 26 mei 1973 dalam satu perbincangan di antara ahli jawatankuasa masjid melayu dengan allahyarham yb dato seri hj kamruddin b md isa ( pada masa itu beliau adalah sebagai timbalan menteri penerangan malaysia).satu memorandum mengenainya telah dihantar kepada allahyarham yab tun hj abdul razak b hussain, perdana menteri malaysiapada 28 julai 1974. pada 16 ogos 1974, allahyarham yab tun hj abdul razak b hussain telah menguumkan pembinaan masjid daerah sultan idris ii, teluk intan dalam 1 perhimpunan di dewan skomk, teluk intan.\r\n\r\npembinaan masjid ini dimulakan pada 7 julai 1981 dengan harga rm1.5 juta hasil sumbangan derma orang ramai, peruntukan kerajaan persekutuan dan juga kerajaan negeri perak darul ridzuan.penentuan arah kiblatnya dilakukan pada 19 ogos 1981 oleh al-fadhil tn hj nurudin b haji sidek, sebagai kadi teluk intan bersama-sama al-fadhil tn hj hamdan b hj idris, salah seorang guru agama yang terkemuka di teluk intan dan pihak jabatan kerja raya teluk intan.\r\n\r\nperletakan batu asas masjid ini dilakukan oleh yab dato' seri wan muhammad b hj wan teh, menteri besar perak pada 10 september 1981. masjid ini siap sepenuhnya dibina (dalam tempoh 707 hari) iaiutu pada 10 jun 1983 dan solat jumaat pertama diadakan pada 30 september 1983 dengan mengambil nama sempena majlis perasmian masjid ini. perasmiannya dilakukan oleh dymm paduka seri sultan perak, sultan azlan shah.\r\n\r\ndiantara orang tertentu yang terlibat secara langsung menjayakan pembinaan masjid ini ialah yab tun abdul razak husaain ( perdana menteri malaysia), yab dato' seri hj wan muhamad b hj wan teh (menteri besar perak), yb dato' kamaruddin b mat isa (timbalan menteri di jabatan perdana menteri), yam raja dato' sri ahmad hisham b raja abd. malek (orang besar jajahan hilir perak), dato] haji osman b hj mohd baki ( pegawai daerah hilir perak),ym raja haji yusof b raja yaacob (pegawai daerah), yb encik abdul samat b hj sabri (pegawai daerah ), yb encik darus b said ( adun changkat jong), dan semua ahli jawatankuasa masjid yang terlibat dalam tempoh tersebut,terutamanya tn hj sulaiman b mohd nawi( setiausaha masjid melayu )",
    "source_musolla_id": "MY-08-HP-00264",
    "provision": "-tempat wudhu\r\n-telekung\r\n-sejadah\r\n-bilik mesyuarat\r\n-bilik pegawai masjid\r\n-pejabat masjid\r\n-ruang makan\r\n-parking\r\n-kedai perniagaan\r\n-laluan orang kurang upaya\r\n-tandas awam\r\n-perpustakaan\r\n-ruang bilik kuliah\r\n-bagizo ( pondok rehat )"
  },
  "w0xyftjzfy": {
    "address": "Jalan Ah Cheong, Teluk Intan, 36000 Durian Sebatang, Perak, Malaysia 36000",
    "contact": "019 5575117",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.027855,
      "longitude": 101.016322
    },
    "name": "MASJID INDIA MUSLIM",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "4de79cb6-a69b-431b-b43d-9d2aab450136",
    "geohash": "w0xyftjzfy",
    "source_musolla_id": "MY-08-HP-00233"
  },
  "w0xyfg1cn7": {
    "address": "Jalan Mustafa al-Bakri, 36000 Durian Sebatang, Perak, Malaysia 36000",
    "contact": "019 4642747",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.015696,
      "longitude": 101.021962
    },
    "name": "MASJID KG. BATAK RABIT",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "eea5cc8e-2552-46c1-ad61-c1eb6b7ec851",
    "geohash": "w0xyfg1cn7",
    "source_musolla_id": "MY-08-HP-00246"
  },
  "w0xy36ky4t": {
    "address": "Hutan Melintang, Perak, Malaysia 36400",
    "contact": "016 2866120",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.924551,
      "longitude": 100.960007
    },
    "name": "MASJID KAMPUNG TELUK BULUH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "cb0ec124-6fd8-4829-af5a-4996fad03556",
    "geohash": "w0xy36ky4t",
    "remarks": "atas usahasama hj malkan, hj mohd abd rahim, hj ehsan berjumpa d.o teluk intan dan diperkenan raja muda perak..",
    "source_musolla_id": "MY-08-HP-00253",
    "provision": "-tempat wuduk\r\n-telekung \r\n-sejadah\r\n-bilik pegawai masjid\r\n-pejabat masjid\r\n-parkir\r\n-tandas awam"
  },
  "w0xy0vgbqq": {
    "address": "Hutan Melintang, Perak, Malaysia 36400",
    "contact": "013 6611036",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.898851,
      "longitude": 100.936821
    },
    "name": "MASJID SERI PERKASA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "3f1ad04d-d902-46c0-885f-35fcde1dd555",
    "geohash": "w0xy0vgbqq",
    "remarks": "Bermula daripada sebuah surau yang didirikan oleh Imam Mustain Bin Hj Dollah bersama-sama penduduk-penduduk awal yang menjadi peneroka Kampung Seri Perkasa sekitar tahun 1972.\r\n\r\nTahun 1978 telah memperolah kebenaran Majlis Agama Islam untuk dijadikan Surau Diri Jumaat untuk menampung jemaah dari kampung-kampung Kebun Baru, Kampung Teluk Kerdu dan Kampung Seri Perkasa.\r\n\r\nDisember 2003, bangunan lama diroboh untuk diganti dengan bangunan baharu. Solat Jumaat telah diberi kebenaran mendirikannya di surau kampung Kebun Baru sehingga bangunan masjid baharu siap dibina.\r\n\r\n1.1.2005 bangunan baharu masjid (Masjid Seri Perkasa) telah siap dibina hasil dana yang terkumpul oleh Ahli Jawatankuasa Masjid berjumlah RM 100,000.00. Sejumlah RM550,000.00 adalah usaha yang telah dijalankan oleh YB Dato Seri Ahmad Zahid Bin Hamidi, Parlimen Bagan Datoh. Kos keseluruhan untuk bangunan adalah berjumlah RM650,000.00.",
    "source_musolla_id": "MY-08-HP-00249",
    "provision": "-tempat wudhu\r\n-telekung\r\n-sejadah\r\n-ruang memasak\r\n-parkir\r\n-tandas awam\r\n-kerusi orang kurang upaya"
  },
  "w0xyyg86yg": {
    "address": "Changkat Jong, Perak, Malaysia 36700",
    "contact": "019 4657616",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.018738,
      "longitude": 101.195703
    },
    "name": "MASJID JAMEK KG. AYER HITAM",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "900382ba-1b65-46a2-9c27-6fa89ec3532b",
    "geohash": "w0xyyg86yg",
    "remarks": "pada tahun 1913 sebuah masjid didirikan di batu 15, jalan bidor, teluk intan, dengan menggunakan bahan-bahan daripada masjid lama yang terdapat di kg batak rabit. usaha membawa bahan-bahan lama tersebut dilakukan oleh allahyarham tuan hj idris iaitu bapa kepada tuan hj hamdan (tuan guru agama dari kg bahagia), beliau telah berusaha mengangkut papan-papan dan kayu-kayu serta pelbagai bahan dengan menggunakan kereta lembu kerana pada masa itu jalan raya tar belum wujud lagi, cuma jalan tanah merah sahaja.    \r\n\r\ntanah tapak masjid kg ayer hitam ini telah diwakafkan kepada masjid oleh tuan imam abdul rahim, bekas ketua kg ayer hitam.\r\n\r\napabila berlaku perpindahan iaitu apabila wujudnya kg baru ayer hitam (dalam tahun 1956) kerajaan british pada masa itu telah mendirikan sebuah masjid di atas tapak baru pula iaitu terletak di jalan chui chak ( tapak yang ada sekarang) dengan harga lebih kurang rm14,000 ketika itu. bangunan masjid lama di batu 15 itu masih kekal. memandangkan masjid baru yang didirikan itu terlalu kecil, maka penduduk kampung telah menagmbil keputusan bergotong royong membuka bangunan masjid lama itu dan menyambung untuk membesarkan bangunan masjid di jalan chui chak, iaitu pada tahun 1969. masjid ini boleh memuatkan kira-kira 100 orang jemaah. walaubagaimanapon kian hari penduduk kian bertambah, maka keluasan masjid ini menimbulkan masalah kepada penduduk di sini.\r\n\r\npada tahun 1978, jawatankuasa pembinaan masjid baru telah ditubuhkan untuk mengkaji dan mencari jalan untuk mengatasi masalah tersebut. akhirnya, jawatankuasa berpendapat sebuah masjid baru akan didirikan di atas tapak tanah masjid yang ada di jalan chui chak dengan merobohkan bangunan masjid lama. bangunan masjid baru ini menelan belanja sebanyak rm180,000 (termasuk peruntukan daripada kerajaan dan orang ramai). masjid ini boleh memuatkan jemaah sehingga lebih 500 orang.\r\n\r\njawatankuasa pembinaan masjid baru telah diketuai oleh allahyarham encik hassan b hj mohd said(mantan ketua kg ayer hitam dari 1978-1982) dan Allahyarham tuan hj abu bakar b hj yeop majelih,pp.ppt (mantan ketua kampung dari tahun 1982-1990)",
    "source_musolla_id": "MY-08-HP-00240"
  },
  "w0xytj7641": {
    "address": "Kampung Baru Changkat Jong, 36000 Changkat Jong, Perak, Malaysia 36000",
    "contact": "012-5555836",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.984269,
      "longitude": 101.122718
    },
    "name": "MASJID JAMEK KG.BARU CHANGKAT JONG",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "c9e41f6b-579a-44e5-a2f7-db9d9377900d",
    "geohash": "w0xytj7641",
    "remarks": "Masjid ini telah siap dibina dalam tahun 1972. Masjid ini dibina bagi menggantikan masjid yang lama yang terletak di hujung kampung. Kebetulan tanah tapak masjid lama itu bersebelahan dengan tanah perkuburan cina.\r\nJawatankuasa tadbir masjid ketika itu telah memohon peruntukan kepada kerajaan untuk membina sebuah masjid yang baru bagi menggantikan masjid yang lama. Ini kerana berlaku ketidak selesaan jemaah masjid yang bersembahyang jumaat dan bersembahyang waktu bertembung dengan upacara menanam mayat orang cina.    \r\n\r\nkebetulan dalam tahun 1969 berlaku tragedi rusuhan kaum. dikhuatiri ini boleh menjadi punca rusuhan yang sukar dikawal.\r\n\r\norang cina yang menhantar mayat untuk ditanam biasanya akan singgah dikawasan masjid untuk mengambil air kolah untuk keperluan mereka. ini juga punca yang boleh mnyebabkan pertikaian kaum. atas alsan yang kukuh ini maka masid yang ada sekarang didirikan. sejumlah rm25,000 diperuntukkan bagi membina masjid. masjid yang dibina separuh batu dan separuh kayu.\r\n\r\ntapak yang dipilih asalnya merupakan tapak surau. tapak ini hanya berkeluasan 60x90 kaki sahaja.sungguh pun begitu sebuah masjid telah didirikan. masjid ini disebelah kiri, kanan dan belakang bersebelahan dengan rumah penduduk kampung.\r\n\r\npentadbiran masjid silih berganti dan beberapa projek baik pulih dan naik taraf masjid telah dilaksanakan. pembangunan luar bandar telah meluluskan peruntukan rm30,000 untuk ubahsuai dan mengganti atap masjid kerana banyak bahagian atap yang bocor. bahagian kubah juga dibuat pembaikan kerana bocor.\r\n\r\ndinding masjid telah juga dinaiktaraf daripada papan kepada batu. ini menjadikan masjid kelihatan lebih kemas. sumbangan dan wakaf orang kampung dan masyarakat setempat telah menjayakan projek ini. ubahsuai tingkap juga telah dijalankan menggantikan tingkap nato kepada tingkap kelepak cermin.pihak pengurusan masjid telah menerima sumbangan daripada syarikat samarat holding kuala lumpur. untuk kerja-kerja ubahsuai dan naik taraf rm10,000 telah menjayakan projek ini.\r\n\r\nladang moccis telah menyumbang untuk membina mikraf masjid. kerja-kerja ini pihak ladang yang menguruskan sepenuhnya. masjid hanya tahu siap sahaja.perhubungan jawatankuasa dengan penghulu mukim amat erat sehingga peruntukan membina balai lintang sejumlah rm40,000 berjaya diperolehi. ini sedikit sebanyak mendatangkan keselesaan kepada jemaah masjid.\r\n\r\nprojek ubahsuai dan naik taraf berterusan dari masa ke masa mengikut keperluan dan dilaksanakan oleh pengurusan masjid untuk keselesaan dan dapat menampung jemaah yang semakin bertambah.",
    "source_musolla_id": "MY-08-HP-00237",
    "provision": "kemudahan asas seperti dewan solat, tandas dan stor sahaja. bilik imam dewan mesyuarat tidak disediakan . keluasan kawasan yang terhad antara punca kemudahan tersebut tidak dapat dibuat."
  },
  "w0xyfer2v7": {
    "address": "Durian Sebatang, Perak, Malaysia 36000",
    "contact": "012 5665804",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.017026,
      "longitude": 101.018486
    },
    "name": "MASJID HAIRIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "45e0a31d-85f0-4361-ba3f-51ce5a4d6700",
    "geohash": "w0xyfer2v7",
    "source_musolla_id": "MY-08-HP-00252"
  }
}