{
  "w0xyf8nmdx": {
    "address": "Taman Seri Setia, Durian Sebatang, Perak, Malaysia 36000",
    "contact": "019 5780705",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.000006,
      "longitude": 101.016997
    },
    "name": "MASJIDUN  NAIM",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "53435b6e-919d-4ffb-aef5-101620b61503",
    "geohash": "w0xyf8nmdx",
    "remarks": "Tanah yang diwakafkan oleh Syarikat Perumahan Orang-Orang Melayu Teluk Intan.\r\nKos pembinaan adalah daripada kutipan orang awam di sekitar Taman Seri Setia dan Padang Tembak.",
    "source_musolla_id": "MY-08-HP-00219",
    "provision": "-ruang tama=bahan solat dibina di kedua-dua bahagian sisi masjid bagi menampung bilangan jemaah\r\n-sebuah balai lintang turut dibina sebagai dwi-fungsi iaitu sebagai ruang tambahan solat terutama hari jumaat, juga sebagai pusat aktiviti masjid.\r\n-bangunan tambahan tandas berasingan untuk muslimah dan oku turut disediakan bagi memenuhi keperluan.\r\n-tempat wudhu tambahan juga ditambah teruatama pada pintu masuk masjid bagi keperluan jemaah ( terdapat 5 kawasan mengambil wudhu')\r\n-sebuah perpustakaan dengan kemudahan bilik kuliah dibina untuk menampung keperluan kelas pengajian.\r\n-bilik imam dan bilik siaraya dibina khas untuk kemudahan solat berjemaah.\r\n-ruang solat juga dilengkapi dengan sistem penghawa dingin\r\n-sebuah pejabat masjid dan bilik gerakan disediakan di bahagian belakang masjid.\r\n-bagi menampung keperluan mengadakan aktiviti biro wanita dan urusan rumah tangga, sebuah dewan an nisa' disediakan bagi tujuan tersebut.dewan ini juga digunakan sebagai kelas pengajian. turut disediakan adalah dewan khas untuk aktiviti belia. \r\n-sebuah rumah tetamu dan dijadikan juga sebagai homestay, turut menjadi kemudahan dimasjid ini.\r\n-selain dari binaan kemudahan asas , masjid turut menyediakan kemudahan/ alatan lain yang dapat dimanfaatkan oleh pengunjung, ini termasuk kemudahan alatan kecemasan seperti strecher, kerusi roda, alat memeriksa tekanan darah dan sebagainya.\r\n-kemudahan sukan juga turut disediakan dan akan ditambah dari masa ke semasa."
  },
  "w0xyftx2ph": {
    "address": "Teluk Intan, 36000 Durian Sebatang, Perak, Malaysia 36000",
    "contact": "05 6412325",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.029258,
      "longitude": 101.018564
    },
    "name": "MASJID AL - GHAZALI",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "1bf2a1c9-35ea-4ac6-b195-c17e3fa38a28",
    "geohash": "w0xyftx2ph",
    "remarks": "pada tahun 1962 masyarakat kg batu 8 dan kg sungai buluh serta penghulu mukim telah mengambil kata sepakat menubuhkan jawatankuasa untuk memohon kepada pihak jabatan agama islam perak agar dapat membenarkan didirikan sebuah masjid di kg batu 8 ini.\r\n\r\npengasas/penasihat masjid ialah allahyarham tuan hj shaarani b mat akib bekas ketua kg teluk bharu pada tahun lima puluhan telah bersetuju mewakafkan 60'x80' dari tanah beliau untuk menjadi tapak masjid ini.\r\n\r\nhasil sumbangan dari orang ramai dan yang berbahgia dato' laksamana raja mahkota dato' mohd ghazali, penaung masjid ini telah berjaya mendirikan sebuah masjid kayu yang boleh menampung jemaah lebih kurang 100 orang. dalam tahun 1965,masjid ini mula digunakan untuk mendirikan sembahyang jumaat dan lain-lain aktiviti agama.pengerusi masjid ketika itu ialah encik mohamad b jalal dan jawatankuasa atas persetujuan tuan hj shaarani b mat akib bersetuju menamakan masjid ini masjid al-ghazali sempena mengenang jasa yang berbagia dato' laksamana raja mahkota dato' mohd ghazali kepada masjid ini.\r\n\r\npada tahun 1974 masjid ini telah dirasmikan oleh kebawah duli yang maha mulia raja muda perak.\r\n\r\npada tahun 1982 kerajaan persekutuan telah membina sebuah sek. men. sains teluk intan diseberang kg batu 8.dengan kerjasama penghulu tuan haji ayob dan penghulu hj shaarani b mohamad menjadi penghulu mukim teluk bharu dan dari belaulah tercetusnya untuk membina masjid baru yang lebih besar bagi menampung murid-murid dan guru-guru sekolah tersebut.\r\n\r\najk bertindak telah berjumpa dengan tuan hj shaarani b mat akib untuk mendapatkan kebenaran tanah untuk tapak. dengan persetujuan beliau melebarkan wakaf tanah beliau kepada 100'x120' bagi mendirikan masjid baru. pada tahun 1985 kerajaan negeri telah memberi peruntukan sebanyak rm230,000 bagi membina masjid baru yang boleh menampung jemaah seramai 400-450 orang, termasuk pelajar sek men sains teluk intan.\r\n\r\npengerusi masjid ketika itu Y.b dato haji shaarani b mohamad dari masa ke semasa masjid ini diubahsuai dengan membina kolah, tandas, serambi kiri dan kanan serta pagar batu melebihi rm100,000 seperti yang ada sekarang dari sumbangan y.b dan orang ramai untuk keselesaan jemaah.",
    "source_musolla_id": "MY-08-HP-00205",
    "provision": "-kolah untuk lelaki\r\n-paip air ( untuk lelaki /wanita)\r\n-bilik mandi lelaki / wanita\r\n-tandas lelaki/ wanita\r\n-satu bilik urusetia (pejabat) ada penyaman udara\r\n-satu bilik stor sejadah\r\n-satu bilik mesyuarat\r\n-satu bilik stor kelengkapan memasak\r\n-ruang jamuan untuk wanita\r\n-ruang tempat sembahyang\r\n -dewan solat lelaki/wanita disebelah dalam\r\n -dewan solat kanan, kiri dan hadapan masjid\r\n -kipas angin sebelah kanan\r\n  -kipas syiling\r\n  -kipas lekap\r\n  -kipas berdiri\r\n-jadual waktu solat ada 4 buah\r\n-meja untuk mesyuarat 2 bangku 15\r\n-meja urusetia 1 buah bangku 1 buah\r\n-p.a sistem/mic"
  },
  "w0xyfu1yd8": {
    "address": "Durian Sebatang, Perak, Malaysia 36000",
    "contact": "05-6225895",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.022116,
      "longitude": 101.0218
    },
    "name": "MASJID DAERAH SULTAN IDRIS SHAH II",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "8f8fb5ce-39f6-4510-9c4a-a40577f8ab4a",
    "geohash": "w0xyfu1yd8",
    "remarks": "keluasan tanah tapak masjid ini lebih kurang 3 ekar. tapak masjid ini pada asalnya ialah tapak rumah rehat teluk intan yang lama. cetusan idea membina masjid daerah ini bermula pada 26 mei 1973 dalam satu perbincangan di antara ahli jawatankuasa masjid melayu dengan allahyarham yb dato seri hj kamruddin b md isa ( pada masa itu beliau adalah sebagai timbalan menteri penerangan malaysia).satu memorandum mengenainya telah dihantar kepada allahyarham yab tun hj abdul razak b hussain, perdana menteri malaysiapada 28 julai 1974. pada 16 ogos 1974, allahyarham yab tun hj abdul razak b hussain telah menguumkan pembinaan masjid daerah sultan idris ii, teluk intan dalam 1 perhimpunan di dewan skomk, teluk intan.\r\n\r\npembinaan masjid ini dimulakan pada 7 julai 1981 dengan harga rm1.5 juta hasil sumbangan derma orang ramai, peruntukan kerajaan persekutuan dan juga kerajaan negeri perak darul ridzuan.penentuan arah kiblatnya dilakukan pada 19 ogos 1981 oleh al-fadhil tn hj nurudin b haji sidek, sebagai kadi teluk intan bersama-sama al-fadhil tn hj hamdan b hj idris, salah seorang guru agama yang terkemuka di teluk intan dan pihak jabatan kerja raya teluk intan.\r\n\r\nperletakan batu asas masjid ini dilakukan oleh yab dato' seri wan muhammad b hj wan teh, menteri besar perak pada 10 september 1981. masjid ini siap sepenuhnya dibina (dalam tempoh 707 hari) iaiutu pada 10 jun 1983 dan solat jumaat pertama diadakan pada 30 september 1983 dengan mengambil nama sempena majlis perasmian masjid ini. perasmiannya dilakukan oleh dymm paduka seri sultan perak, sultan azlan shah.\r\n\r\ndiantara orang tertentu yang terlibat secara langsung menjayakan pembinaan masjid ini ialah yab tun abdul razak husaain ( perdana menteri malaysia), yab dato' seri hj wan muhamad b hj wan teh (menteri besar perak), yb dato' kamaruddin b mat isa (timbalan menteri di jabatan perdana menteri), yam raja dato' sri ahmad hisham b raja abd. malek (orang besar jajahan hilir perak), dato] haji osman b hj mohd baki ( pegawai daerah hilir perak),ym raja haji yusof b raja yaacob (pegawai daerah), yb encik abdul samat b hj sabri (pegawai daerah ), yb encik darus b said ( adun changkat jong), dan semua ahli jawatankuasa masjid yang terlibat dalam tempoh tersebut,terutamanya tn hj sulaiman b mohd nawi( setiausaha masjid melayu )",
    "source_musolla_id": "MY-08-HP-00264",
    "provision": "-tempat wudhu\r\n-telekung\r\n-sejadah\r\n-bilik mesyuarat\r\n-bilik pegawai masjid\r\n-pejabat masjid\r\n-ruang makan\r\n-parking\r\n-kedai perniagaan\r\n-laluan orang kurang upaya\r\n-tandas awam\r\n-perpustakaan\r\n-ruang bilik kuliah\r\n-bagizo ( pondok rehat )"
  },
  "w0xyftjzfy": {
    "address": "Jalan Ah Cheong, Teluk Intan, 36000 Durian Sebatang, Perak, Malaysia 36000",
    "contact": "019 5575117",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.027855,
      "longitude": 101.016322
    },
    "name": "MASJID INDIA MUSLIM",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "4de79cb6-a69b-431b-b43d-9d2aab450136",
    "geohash": "w0xyftjzfy",
    "source_musolla_id": "MY-08-HP-00233"
  },
  "w0xyfg1cn7": {
    "address": "Jalan Mustafa al-Bakri, 36000 Durian Sebatang, Perak, Malaysia 36000",
    "contact": "019 4642747",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.015696,
      "longitude": 101.021962
    },
    "name": "MASJID KG. BATAK RABIT",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "eea5cc8e-2552-46c1-ad61-c1eb6b7ec851",
    "geohash": "w0xyfg1cn7",
    "source_musolla_id": "MY-08-HP-00246"
  },
  "w0xyfer2v7": {
    "address": "Durian Sebatang, Perak, Malaysia 36000",
    "contact": "012 5665804",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.017026,
      "longitude": 101.018486
    },
    "name": "MASJID HAIRIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "45e0a31d-85f0-4361-ba3f-51ce5a4d6700",
    "geohash": "w0xyfer2v7",
    "source_musolla_id": "MY-08-HP-00252"
  }
}