{
  "w0xytj7641": {
    "address": "Kampung Baru Changkat Jong, 36000 Changkat Jong, Perak, Malaysia 36000",
    "contact": "012-5555836",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.984269,
      "longitude": 101.122718
    },
    "name": "MASJID JAMEK KG.BARU CHANGKAT JONG",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "c9e41f6b-579a-44e5-a2f7-db9d9377900d",
    "geohash": "w0xytj7641",
    "remarks": "Masjid ini telah siap dibina dalam tahun 1972. Masjid ini dibina bagi menggantikan masjid yang lama yang terletak di hujung kampung. Kebetulan tanah tapak masjid lama itu bersebelahan dengan tanah perkuburan cina.\r\nJawatankuasa tadbir masjid ketika itu telah memohon peruntukan kepada kerajaan untuk membina sebuah masjid yang baru bagi menggantikan masjid yang lama. Ini kerana berlaku ketidak selesaan jemaah masjid yang bersembahyang jumaat dan bersembahyang waktu bertembung dengan upacara menanam mayat orang cina.    \r\n\r\nkebetulan dalam tahun 1969 berlaku tragedi rusuhan kaum. dikhuatiri ini boleh menjadi punca rusuhan yang sukar dikawal.\r\n\r\norang cina yang menhantar mayat untuk ditanam biasanya akan singgah dikawasan masjid untuk mengambil air kolah untuk keperluan mereka. ini juga punca yang boleh mnyebabkan pertikaian kaum. atas alsan yang kukuh ini maka masid yang ada sekarang didirikan. sejumlah rm25,000 diperuntukkan bagi membina masjid. masjid yang dibina separuh batu dan separuh kayu.\r\n\r\ntapak yang dipilih asalnya merupakan tapak surau. tapak ini hanya berkeluasan 60x90 kaki sahaja.sungguh pun begitu sebuah masjid telah didirikan. masjid ini disebelah kiri, kanan dan belakang bersebelahan dengan rumah penduduk kampung.\r\n\r\npentadbiran masjid silih berganti dan beberapa projek baik pulih dan naik taraf masjid telah dilaksanakan. pembangunan luar bandar telah meluluskan peruntukan rm30,000 untuk ubahsuai dan mengganti atap masjid kerana banyak bahagian atap yang bocor. bahagian kubah juga dibuat pembaikan kerana bocor.\r\n\r\ndinding masjid telah juga dinaiktaraf daripada papan kepada batu. ini menjadikan masjid kelihatan lebih kemas. sumbangan dan wakaf orang kampung dan masyarakat setempat telah menjayakan projek ini. ubahsuai tingkap juga telah dijalankan menggantikan tingkap nato kepada tingkap kelepak cermin.pihak pengurusan masjid telah menerima sumbangan daripada syarikat samarat holding kuala lumpur. untuk kerja-kerja ubahsuai dan naik taraf rm10,000 telah menjayakan projek ini.\r\n\r\nladang moccis telah menyumbang untuk membina mikraf masjid. kerja-kerja ini pihak ladang yang menguruskan sepenuhnya. masjid hanya tahu siap sahaja.perhubungan jawatankuasa dengan penghulu mukim amat erat sehingga peruntukan membina balai lintang sejumlah rm40,000 berjaya diperolehi. ini sedikit sebanyak mendatangkan keselesaan kepada jemaah masjid.\r\n\r\nprojek ubahsuai dan naik taraf berterusan dari masa ke masa mengikut keperluan dan dilaksanakan oleh pengurusan masjid untuk keselesaan dan dapat menampung jemaah yang semakin bertambah.",
    "source_musolla_id": "MY-08-HP-00237",
    "provision": "kemudahan asas seperti dewan solat, tandas dan stor sahaja. bilik imam dewan mesyuarat tidak disediakan . keluasan kawasan yang terhad antara punca kemudahan tersebut tidak dapat dibuat."
  }
}