{
  "w0xy0vg4qh": {
    "address": "Hutan Melintang, Perak, Malaysia 36400",
    "contact": "019 6489576",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.899183,
      "longitude": 100.935781
    },
    "name": "MASJID AN - NUR",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "ed141da3-8c36-4142-876e-664e3fc2fcf9",
    "geohash": "w0xy0vg4qh",
    "remarks": "tapak masjid an-nur kg sg samak adalah hasil drma daripada orang ramai.pembelian tanah hj nor adalah seluas 1 ekar 0 rod.04.000 pol. sebelum didirikan masjid asalnya ialah sebuah surau. pengasas masjid an nur ialah sidang oertama kg sg samak ialah md isa di bantu antaranya oleh pak yai nawawi, pak yai toha, pak yai sarkowi, pak yai masduki, imam mustain, hj abdul hamid, pak zakaria dan pak abdullah.\r\n\r\nbangunan depan (ibu) adalah hasil wakaf daripada orang ramai sepenuhnya dengan kos rm1700.00. bahan binaannya di beli teluk intan dan dibawa menaiki tongkang. bahan-bahan binaan dipikul beramai-ramai ketika menaiki darat, kemudia di bawa ke tapak pembinaan dan didirikan secara bergotong royong.\r\n\r\nbangunan tambahan (serambi ) adalah bantuan dari kerajaan negeri sebanyak rm50,000\r\n\r\nserambi tambahan lagi ( wakaf) sebnayak rm30,000\r\ndewan rm40,000\r\nsoyok rm30,000\r\ntempat wuduk rm10,000\r\n\r\ndinamakan masjid an nur ialah kerana tapak asalnya tanah embah hj nor",
    "source_musolla_id": "MY-08-HP-00220",
    "provision": "-KEMUDAHAN TEMPAT WUDHU\r\n-TELEKUNG\r\n-SEJADAH\r\n-RUANG MAKAN\r\n-RUANG MEMASAK\r\n-PARKIR\r\n-TANDAS AWAM\r\n-RUANG BILIK KULIAH",
    "directions": "lokasi masjid adalah berdekatan dengan jalan utama kampung"
  },
  "w0xy0vgbqq": {
    "address": "Hutan Melintang, Perak, Malaysia 36400",
    "contact": "013 6611036",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.898851,
      "longitude": 100.936821
    },
    "name": "MASJID SERI PERKASA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "3f1ad04d-d902-46c0-885f-35fcde1dd555",
    "geohash": "w0xy0vgbqq",
    "remarks": "Bermula daripada sebuah surau yang didirikan oleh Imam Mustain Bin Hj Dollah bersama-sama penduduk-penduduk awal yang menjadi peneroka Kampung Seri Perkasa sekitar tahun 1972.\r\n\r\nTahun 1978 telah memperolah kebenaran Majlis Agama Islam untuk dijadikan Surau Diri Jumaat untuk menampung jemaah dari kampung-kampung Kebun Baru, Kampung Teluk Kerdu dan Kampung Seri Perkasa.\r\n\r\nDisember 2003, bangunan lama diroboh untuk diganti dengan bangunan baharu. Solat Jumaat telah diberi kebenaran mendirikannya di surau kampung Kebun Baru sehingga bangunan masjid baharu siap dibina.\r\n\r\n1.1.2005 bangunan baharu masjid (Masjid Seri Perkasa) telah siap dibina hasil dana yang terkumpul oleh Ahli Jawatankuasa Masjid berjumlah RM 100,000.00. Sejumlah RM550,000.00 adalah usaha yang telah dijalankan oleh YB Dato Seri Ahmad Zahid Bin Hamidi, Parlimen Bagan Datoh. Kos keseluruhan untuk bangunan adalah berjumlah RM650,000.00.",
    "source_musolla_id": "MY-08-HP-00249",
    "provision": "-tempat wudhu\r\n-telekung\r\n-sejadah\r\n-ruang memasak\r\n-parkir\r\n-tandas awam\r\n-kerusi orang kurang upaya",
    "directions": "lokasi masjid terletak berhampiran persimpangan jalan persekutuan teluk intan kuala lumpur dan jalan sungai samak"
  }
}