{
  "w0xyf8nmdx": {
    "address": "Taman Seri Setia, Durian Sebatang, Perak, Malaysia 36000",
    "contact": "019 5780705",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.000006,
      "longitude": 101.016997
    },
    "name": "MASJIDUN  NAIM",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "53435b6e-919d-4ffb-aef5-101620b61503",
    "geohash": "w0xyf8nmdx",
    "remarks": "Tanah yang diwakafkan oleh Syarikat Perumahan Orang-Orang Melayu Teluk Intan.\r\nKos pembinaan adalah daripada kutipan orang awam di sekitar Taman Seri Setia dan Padang Tembak.",
    "source_musolla_id": "MY-08-HP-00219",
    "provision": "-ruang tama=bahan solat dibina di kedua-dua bahagian sisi masjid bagi menampung bilangan jemaah\r\n-sebuah balai lintang turut dibina sebagai dwi-fungsi iaitu sebagai ruang tambahan solat terutama hari jumaat, juga sebagai pusat aktiviti masjid.\r\n-bangunan tambahan tandas berasingan untuk muslimah dan oku turut disediakan bagi memenuhi keperluan.\r\n-tempat wudhu tambahan juga ditambah teruatama pada pintu masuk masjid bagi keperluan jemaah ( terdapat 5 kawasan mengambil wudhu')\r\n-sebuah perpustakaan dengan kemudahan bilik kuliah dibina untuk menampung keperluan kelas pengajian.\r\n-bilik imam dan bilik siaraya dibina khas untuk kemudahan solat berjemaah.\r\n-ruang solat juga dilengkapi dengan sistem penghawa dingin\r\n-sebuah pejabat masjid dan bilik gerakan disediakan di bahagian belakang masjid.\r\n-bagi menampung keperluan mengadakan aktiviti biro wanita dan urusan rumah tangga, sebuah dewan an nisa' disediakan bagi tujuan tersebut.dewan ini juga digunakan sebagai kelas pengajian. turut disediakan adalah dewan khas untuk aktiviti belia. \r\n-sebuah rumah tetamu dan dijadikan juga sebagai homestay, turut menjadi kemudahan dimasjid ini.\r\n-selain dari binaan kemudahan asas , masjid turut menyediakan kemudahan/ alatan lain yang dapat dimanfaatkan oleh pengunjung, ini termasuk kemudahan alatan kecemasan seperti strecher, kerusi roda, alat memeriksa tekanan darah dan sebagainya.\r\n-kemudahan sukan juga turut disediakan dan akan ditambah dari masa ke semasa."
  }
}