{
  "w0zg15mc5d": {
    "address": "33000 Sayong, Perak, Malaysia 33000",
    "contact": "0175782944",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.764134,
      "longitude": 100.95044
    },
    "name": "MASJID DIRAJA UBUDIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "a6904107-a08d-43e0-aa36-e291d0fdd021",
    "geohash": "w0zg15mc5d",
    "remarks": "Masjid Diraja Ubudiah terletak di sebelah kawasan Makam Diraja Bukit Chandan, Kuala Kangsar. Masjid ini dibina atas titah Sultan Idris Murshidul Azam Shah, Sultan Perak ke -28 (1887-1816) kerana menunaikan nazar ketika baginda gering.\r\n\r\nKerajaan Negeri Perak kemudiannya telah mengarahkan Coloney Huxley dari Pejabat Kerja Raya di Kuala Lumpur sepaya merangka sebuah pelan masjid yang hendak didirikan itu. Tugas membuat pelan reka bentuknya telah diserahkan kepada Hubbeck, seorang arkitek kerajaan dan tugas melaksanakan pembinaan bangunan itu pula diserahkan kepada Caufield, iaitu ketua jurutera di Negeri Perak ketika itu.\r\n\r\nPada hari Jumaat, 25 Syawal 1331 Hijri bersamaan 26 September 1913 Masihi, Sultan Idris telah meletakkan batu asas masjid tersebut. Pembinaan masjid tergendala beberapa tahun kerana kerosakan ketul-ketul marmar di tempat simpanannya yang telah dipijak oleh dua ekor gajah kepunyaan Sultan Idris dan Raja Chulan.\r\n\r\nPenghantaran batu marmar yang dipesan dari Itali pula tergendala akibat meletusnya Perang Dunia Pertama. Setelah beberapa halangan berlaku, pada tahun 1917 Masihi barulah masjid yang terindah di Negeri Perak ini dengan rasminya dibuka oleh Sultan Abdul Jalil Nasaruddin Shah, iaitu pengganti Sultan Idris yang mangkat pada tahun 1916 Masihi.",
    "source_musolla_id": "MY-08-KK-00006",
    "provision": "-tempat wuduk\r\n-telekung\r\n-sejadah\r\n-bilik mesyuarat\r\n-bilik pegawai masjid\r\n-pejabat masjid\r\n-ruang makan\r\n-ruang memasak\r\n-parkir\r\n-laluan orang kurang upaya\r\n-tandas awam\r\n-perpustakaan\r\n-rumah musafir\r\n-kawasan riadah",
    "directions": "terletak diatas bukit chandan berhampiran istana iskandariah."
  },
  "w0zujnuu69": {
    "address": "Jalan Bagan Serai, Kampung Baru Lasah, 31100 Pulau Kamiri, Perak, Malaysia 31100",
    "contact": "055911241",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.95969,
      "longitude": 101.124803
    },
    "name": "MASJID al - RAMLIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "a0a9d247-f304-461b-9f1a-fd16a6066e5b",
    "geohash": "w0zujnuu69",
    "source_musolla_id": "MY-08-KK-00417",
    "provision": "-tempat wuduk\r\n-telekung\r\n-sejadah\r\n-ruang makan\r\n-ruang memasak\r\n-parking\r\n-tandas awam\r\n-bazigo",
    "directions": "-lokasi masjid kira-kira 26km dari sungai siput (u). 1km dari jalan utama lintang-lasah, sungai siput (u)"
  },
  "w0zq2s5ewe": {
    "address": "Balik Pulau, Pulau Pinang, Malaysia 11000",
    "contact": "04-8691420",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.339973,
      "longitude": 100.22238
    },
    "name": "MASJID DAERAH BARAT DAYA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "9941009d-3100-4165-96d6-568dccc8c722",
    "geohash": "w0zq2s5ewe",
    "remarks": "Masjid ini telah dirasmikan oleh TYT Tun Dato’ Seri Utama, Dr. Haji Abdul Rahman bin Haji Abbas, iaitu Yang di-Pertua Negeri Pulau Pinang pada 27 Muharam 1425 Hijri bersamaan 19 Mac 2004 Masihi. Ia berkonsepkan reka bentuk Timur Tengah dan digabungkan dengan penggunaan bahan binaan moden. Ia turut dilengkapi dengan kemudahan asas terkini.",
    "source_musolla_id": "MY-07-BD-00002",
    "provision": "KEMUDAHAN WIFI\nKEMUDAHAN PARKIK KERETA\nPENGHAWA DINGIN"
  },
  "w0zqxg303t": {
    "address": "Taman Selasih, Keladi, Kedah, Malaysia 09000",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.379254,
      "longitude": 100.537332
    },
    "name": "AL-MUTTAQIN taman selasih",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "2539986a-f140-422f-abb2-66886a7f1136",
    "geohash": "w0zqxg303t",
    "source_musolla_id": "MY-02-KLM-00380"
  },
  "w0zqxvgek1": {
    "address": "Keladi, Kedah, Malaysia 09000",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.39348,
      "longitude": 100.54087
    },
    "name": "ABDUL RAHMAN PUTRA keladi",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "718f5633-624b-4590-92d8-c9e28ac4461d",
    "geohash": "w0zqxvgek1",
    "remarks": "Dirasmikan oleh D.Y.M.M Sultan Abdul Halim pada 11 September 1968 bersamaan 18 Jamadil Akhir 1388H.",
    "source_musolla_id": "MY-02-KLM-00352",
    "provision": "1. Bilik Kuliah\r\n2. Papan Tanda Nama Masjid\r\n3. Papan Kenyataan/ Iklan\r\n4. Tempat Letak Kenderaan\r\n5. Stor/Dapur\r\n6. Tempat Letak Kasut\r\n7. Tandas\r\n8. Bilik Mandi\r\n9. Komputer\r\n10.Tempat Wuduk\r\n11. Khat\r\n12. Permaidani\r\n13. Papan Tanda Waktu Solat\r\n14. Wakaf\r\n15. Pakaian Solat"
  },
  "w0zqrv2p59": {
    "address": "Taman Anggerik, Kulim, Kedah, Malaysia 09000",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.347433,
      "longitude": 100.536047
    },
    "name": "AN NUR JUNJUNG",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "847b83bd-b03d-46a8-8017-123753914035",
    "geohash": "w0zqrv2p59",
    "source_musolla_id": "MY-02-KLM-00353",
    "provision": "1. Dewan Syarahan\r\n2. Bilik Jenazah\r\n3. Telefon Masjid\r\n4. Telefon Awam\r\n5. Tempat Letak Kenderaan\r\n6. Taman Rekreasi\r\n7. Perpustakaan \r\n8. Rumah Imam\r\n9. Rumah Bilal\r\n10. Rumah Siak\r\n11. Pintu Gerbang  \r\n12. Lampu Antik\r\n13. Wakaf\r\n14. Bilik Musafir"
  },
  "w0zrhm9sbm": {
    "address": "Mukim 7, Butterworth, Pulau Pinang, Malaysia 13050",
    "contact": "04-3519621",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.480276,
      "longitude": 100.384158
    },
    "name": "MASJID DAERAH SEBERANG PERAI UTARA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "c2e1239d-c89d-42e5-a84f-0d54b7b48be6",
    "geohash": "w0zrhm9sbm",
    "source_musolla_id": "MY-07-BTW-00004",
    "provision": "KEMUDAHAN WIFI\r\nRUANGAN PARKIR"
  },
  "w0zfhh9n3s": {
    "address": "Hulu Kinta, Kinta, Perak, Malaysia 30010",
    "contact": "013-5237989/05-",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.59613,
      "longitude": 101.075662
    },
    "name": "MASJID SULTAN IDRIS SHAH II (MASJID NEGERI PERAK)",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "33cac357-145e-42d5-a38f-d0895ae2e4ac",
    "geohash": "w0zfhh9n3s",
    "remarks": "Masjid Sultan Idris Shah II telah dirasmikan pada 15 September 1978 oleh Sultan Idris Iskandar Shah II (1963-1984), Sultan yang ke-33, sempena dengan perayaan ulangtahun hari keputeraan baginda yang ke-33. Ianya terletak di atas sebidang tanah seluas kira-kira 2.6 hektar di tengah- tengah bandaraya Ipoh. Kerja-kerja pembinaan masjid tersebut telah dimulakan pada 16 Mei 1966, dan batu asas telah diletakkan pada 27 Oktober 1967 oleh (Allahyarham) Tun Haji Abdul Razak, pada ketika itu menjadi Timbalan Perdana Menteri. Masjid ini telah siap dibina pada 26 Ogos 1968.\r\n\r\nPada mulanya, masjid ini dinamakan sebagai 'Masjid Negeri (Perak)' dan telah digelarkan 'Masjid Sultan Idris Shah II' sempena nama Sultan Idris Iskandar Shah II yang telah kembali ke Rahmatullah pada tahun 1984.\r\n\r\nIdea pembinaan masjid ini berasal daripada (Allahyarham) Orang Kaya-Kaya Panglima Bukit Gantang Seri Amar Diraja Abdul Wahab pada tahun 1951. Beliau yang pada ketika itu adalah Menteri Besar telah sedar bahawa masjid-masjid yang sedia ada di lpoh tidak mencukupi untuk memuatkan semua jemaah yang menunaikan ibadah pada satu-satu masa seperti hari kebesaran Islam dan ibadah sembahyang Jumaat. Jumlah kos perbelanjaan pembinaannya ialah RM1,840,000.00",
    "source_musolla_id": "MY-08-IPH-00001",
    "provision": "Di tingkat bawah mengandungi kemudahan-kemudahan seperti ruang berwudhuk, bilik persidangan dan kutub khanah, bilik pejabat dan bilik setor. Terdapat pula sebuah dewan jemaah yang sebesar dengan dewan jemaah besaf di tingkat atas. Dewan jemaah bawah juga boleh memuatkan 1,500 orang. Di depan bangunan masjid terletaknya tempat letak kenderaan, manakala di belakang terletaknya kuarters untuk imam, bilal dan lain-lain pegawai masjid. Sehingga hari ini, masjid ini masih dirujuk orang ramai sebagai 'Masjid Negeri Perak'.",
    "directions": "Masjid ini terletak di atas sebidang tanah seluas 2.6 hektar. Kerja-kerja pembinaannya telah dimulakan pada 16 Mei 1966 Masihi dan peletakan batu asas dilakukan pada 27 Oktober 1967 Masihi oleh Allahyarham Tun Haji Abdul Razak yang ketika itu menjadi Timbalan Perdana Menteri Malaysia. Masjid ini disiapkan pada 26 Ogos 1968 Masihi dan dirasmikan oleh Almarhum Sultan Iskandar Shah II (1963-1984), Sultan Perak ke-33 sempena ulang tahun keputeraan baginda."
  },
  "w0zg0vq29p": {
    "address": "Kota Lama Kiri, Perak, Malaysia 33000",
    "contact": "05-7776459",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.77506,
      "longitude": 100.940033
    },
    "name": "MASJID DAERAH RIDZWANIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "55052e11-bd3b-4e3a-91fc-50e24aebe5ae",
    "geohash": "w0zg0vq29p",
    "remarks": "cadangan mendirikan masjid ini adalah di atas daya usaha al-marhum paduka seri sultan idris murshidul azam shah ibni al-marhum raja bendahara alang iskandar, sultan perak yang ke 28. baginda telah mewakafkan masjid tersebut kepada penduduk di daerah ini. masjid ini mula didirikan pada tahun 1915. pembinaan masjid ini memakan masa selama 2 tahun. putera baginda, sultan perak yang ke 29 telah merasmikan pembukaan masjid ini pada 24 januari 1916. pada 17 januari 1982 bangunan masjid yang lama telah mula dirobohkan .masjid baru siap dibina pada bulan ogos 1984.dirasmikan pada 19 april 1985 oleh almarhum sultan azlan muhibbudin shah ibni al marhum sultan yussuf izzudin ghafarullahu-lahu shah.",
    "source_musolla_id": "MY-08-KK-00005",
    "provision": "-tempat wuduk\r\n-telekung\r\n-sejadah\r\n-bilik mesyuarat\r\n-bilik pegawai masjid\r\n-pejabat masjid\r\n-ruang makan\r\n-ruang memasak\r\n-parkir\r\n-kedai perniagaan\r\n-laluan orang kurang upaya\r\n-tandas awam\r\n-tandas orang kurang upaya\r\n-kerusi orang kurang upaya\r\n-perpustakaan\r\n-ruang musafir",
    "directions": "terletak ditangah-gtengah pekan kuala kangsar, bersebelahan koleJ melayu kuala kangsar."
  },
  "w0zuhdux7j": {
    "address": "Kampung Lintang, Pulau Kamiri, Perak, Malaysia 31100",
    "contact": "0148832623",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.938256,
      "longitude": 101.102505
    },
    "name": "MASJID NURUL IMAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "4c0420a8-86d9-4877-8731-01bc48f0bf19",
    "geohash": "w0zuhdux7j",
    "remarks": "telah dibina pada sekitar tahun 1926. pada peringkat awalnya masjid ini bersebelahan dengan sekolah rendah agama rakyat nurul huda. sekitar tahun 1998 masjid ini terpaksa dirobohkan dan dibina semula kerana banyak daripada struktur binaannya telah rozak teruk akibat dimakan usia.\r\n\r\nselain daripada itu, alasan lain ianya dirobohkan aialah kerana arah kiblatnya yang tidak bertepatan dengan arah yang sebenar.pada sekitar tahun 1998 atas usaha seorang ahli dewan undangan negeri perak kawasan lintang yang juga anak jati dari kariah ini iaitu allahyarham dato' haji mohd padil b hj haji harun telah berusaha mendapatkan sumbanganuntuk membina sebuah masjid yang baru sehingga kini dan didaftarkan dengan nama masjid nurul iman.",
    "source_musolla_id": "MY-08-KK-00392",
    "provision": "-tempat wudhu\r\n-telekung\r\n-sejadah\r\n-bilik mesyuarat\r\n-ruang makan\r\n-ruang memasak\r\n-parkir\r\n-tandas awam\r\n-kerusi orang kelainan upaya\r\n-ruang bilik kuliah",
    "directions": "-17km dari bandar sungai siput melalui jalan utama iaitu jalan lintang\r\n-34km dari kuala kangsar bandar diraja"
  },
  "w0zg7vge3d": {
    "address": "Sungai Siput, Perak, Malaysia 31100",
    "contact": "0165621670",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.822198,
      "longitude": 101.068109
    },
    "name": "MASJID INDIA MUSLIM",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "ce2f1542-dcd0-4ac9-951f-6683fec9b308",
    "geohash": "w0zg7vge3d",
    "remarks": "- pada awal tahun 1920-an pihak british telah membawa masuk ramai buruh kasar dari tamil nadu,india untuk bekerja di ladang-ladang getah di tanah melayu. ladang kamuning yang dahulu dikenali sebagai 'estet nombor 8' adalah antara estet yang ramai masyarakat india muslim bekerja ketika itu.\r\n\r\n- ramai juga pendakwah islam yang turut berhijrah ke tanah melayu dengan membawa masuk ilmu kalam allah s.w.t. colongan inilah yang telah mendorong masyarakat setempat mendirikan surau-surau dan pondok-pondok kecil sebagai tempat untuk mendirikan solat jemaah dan menjalankan dakwah di sungai siput. golongan dakwah inilah juga juga telah mendorong pekerja-pekerja india muslim di\"ladang nombor 8\" yang kini dikenali sebagai ladang sime darby ini mendirikan sebuah surau pada tahun 1923 di tepi jalan besar, sungai siput yang ketika itu merupakan sebuah kawasan paya yang bersebelahan dengan sebuah sungai. sungai itulah dikenali sebagai sungai siput.memandangkan ketiadaan sebuah masjid untuk masyarakat islam di sungai siput ketika itu, maka pihak british telah menderma tapak masjid ini.\r\n\r\n-dengan sumbangan daripada peniaga-peniaga india muslim di kawasan sekitar sungai siput dan juga dengan sumbangan masyarakat setempat, maka pada tahun 1929 telah lahir sebuah masjid yang dikenali dengan nama masjid india muslim sungai siput. masjid inilah masjid pertama yang telah dibina di daerah sungai siput.\r\n\r\n-pada penghujung tahun 70-an, kemajuan masjid india muslim sungai siput terus berkembang dan dengan usaha gigih para pegawai masjid ini ketika itu, bilangan umat muslim yang bersolat di masjid ini semakin meningkat. pertambahan penduduk india muslim dikawasan ini telah menyebabkan masjid ini bertambah sesak terutamanya ketika solat jumaat dan solat hari raya. justeru itu, pada pertengahan tahun 80-an, mula dibentuk ahli jawatankuasa pembinaan masjid baharu untuk menggantikan masjid tersebut yang semakin usang.\r\n\r\ndengan usaha gigih jawatankuasa masjid yang ditubuhkan yang penuh dedikasi dan komited pada masa itu, maka pada tahun 1991, terbunalah masjid yang ada sekarang.",
    "source_musolla_id": "MY-08-KK-00363",
    "provision": "- tempat wuduk\r\n- telekung\r\n- sejadah\r\n- bilik mesyuarat\r\n- pejabat masjid\r\n- ruang makan\r\n- ruang memasak\r\n- parking\r\n- laluan orang kurang upaya\r\n- tandas awam\r\n- tandas orang kurang upaya\r\n- ruang bilik kuliah",
    "directions": "masjid inilah masjid pertama yang telah dibina di daerah sungai siput. masjid ini terletak bersebelahan dengan jalan utama laluan ke utara dan ke kuala lumpur. kedudukan di pintu masuk bandar sungai siput turut menjadikan masjid ini tempat persinggahan musafir-musafir yang berlalu di kawasan ini."
  },
  "w0zgkhkdt7": {
    "address": "Sungai Siput, Perak, Malaysia 31100",
    "contact": "0125052145",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.813832,
      "longitude": 101.080632
    },
    "name": "MASJID AL - GHUFRANIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "2013efa6-85e9-44b9-a152-7f689235b539",
    "geohash": "w0zgkhkdt7",
    "remarks": "- MASJID LAMA (BANGUNAN ASAL) TELAH DIBINA PADA TAHUN 1968. MASJID INI TELAH DIRASMIKAN OLEH DYMM SULTAN IDRIS AL-MUTAWAKKIL SHAH IBNI AL MARHUM SULTAN ISKANDAR SHAH SULTAN PERAK DARUL RIDZUAN PADA 11 SEPTEMBER 1970 BERSAMAAN 10 REJAB 1390H.\r\n\r\n- PADA TAHUN 2007, SEMASA LAWATAN YB PERDANA MENTERI TUAN ABDULLAH AHMAD BADAWI KE SUNGAI SIPIUT, BELIAU TELAH MELAWAT MASJID INI DAN TELAH MELULUSKAN PERUNTUKAN UNTUK MEMBINA SEMUA MASJID AL GHUFRANIAH.\r\n\r\n- MASJID BARU INI TELAH DIBINA PADA TAHUN 2011 DAN TELAH SIAP PEMBINAAN PADA BULAN JANUARI 2013. PADA 24 FEBRUARI 2013, MASJID BARU INI TELAH MULA DIGUNAKAN.\r\n\r\n-PADA JULAI 2014 BERSAMAAN 17 RAMADHAN 1435H, DYMM SULTAN NAZRIN MUIZZUDDIN SHAH IBNI ALMARHUM SULTAN AZLAN SHAH AL MAGHFURLAH TELAH BERKENAN MERASMIKAN MASJID BARU INI.",
    "source_musolla_id": "MY-08-KK-00357",
    "provision": "-TEMPAT WUDHU'\r\n-TELEKUNG\r\n-SEJADAH\r\n-BILIK MESYUARAT\r\n-BILIK PEGAWAI MASJID\r\n-RUANG MAKAN\r\n-RUANG MEMASAK\r\n-PARKIR\r\n-LALUAN ORANG KURANG UPAYA\r\n-TANDAS ORANG KURANG UPAYA\r\n-RUANG BILIK KULIAH\r\n-KAWASAN RIADAH",
    "directions": "-250M DARI SEKOLAH KEBANGSAAN SUNGAI SIPUT UTARA\r\n-800M DARI PEJ DAERAH DAN TANAH DAERAH SUNGAI SIPUT (U)\r\n-1KM DARI IBU PEJABAT POLIS DAERAH SG SIPUT   \r\n-1.5KM DARI STESEN KERETAPI TANAH MELAYU (KTM) SG SIPUT (U)\r\n-1.5KM DARI PEJABAT POS SUNGAI SIPUT (U)\r\n-2KM DARI PASARAYA TF VALUE MART\r\n-3.5KM DARI HOSPITAL SUNGAI SIPUT (U)"
  },
  "w0zggzcumn": {
    "address": "Pulau Kamiri, Perak, Malaysia 31120",
    "contact": "0196521970",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.921266,
      "longitude": 101.065856
    },
    "name": "MASJID AR - RAHMANIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "6143cb88-a0ca-4102-a073-7a5c5b8e35f0",
    "geohash": "w0zggzcumn",
    "remarks": "-masjid ar-rahmaniah felda lasah telah mula dibina semenjak tahun 1967 bersebelahan dengan pejabat pengurusan felda. setelah hampir 34 tahun beroperasi, pihak ahli jawatnkuasa mendapati ianya perlu dibina sebuah masjid baru bagi menampung keperluan jemaah yang semakin meningkat.\r\n\r\n-pada 23 november 2001 sebuah masjid baru telah dibina bagi menggantikan masjid lama yang tidak dapat menampung keperluan jemaah yang semakin meningkat. masjid ini dibina di atas sebidang tanah yang dahulunya adalah padang bola.",
    "source_musolla_id": "MY-08-KK-00351",
    "provision": "-tempat wudhu'\r\n-telekung\r\n-sejaah\r\n-bilik mesyuarat\r\n-bilik pegawai masjid\r\n-pejabat masjid\r\n-ruang makan\r\n-ruang memasak\r\n-parkir\r\n-laluan orang kurang upaya\r\n-tandas awam\r\n-tandas orang kurang upaya\r\n-kerusi orang kurang upaya\r\n-ruang bilik kuliah\r\n-bazigo (pondok rehat)\r\n-kawasan riadah",
    "directions": "-lokasi masjid ini yang  berada di tengah-tengah penempatan menjadikan ianya mudah dilihat. terletak di sebelah jalan raya utama dan berhampiran dengan sekolah menengah kebangsaan rlkt lasah, sekolah agama rakyat at tawuniah, sekolah menengah tahfiz daerah kuala kangsar dan sekolah tahfiz al fuqaha"
  },
  "w0zujmwr88": {
    "address": "Jalan Bahagia, Kampung Perlop 2, 31100 Sungai Siput, Perak, Malaysia 31100",
    "contact": "016-5025352",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.953378,
      "longitude": 101.137755
    },
    "name": "MASJID AL - FALAH PERLOP 2",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "dd6d3179-161d-48b9-b666-af5cf7f88356",
    "geohash": "w0zujmwr88",
    "remarks": "kampung perlop 2/3 asalnya sebuah rancangan tanah belia khas perlop yang telah diwujudkan oleh kerajaan negeri perak pada tahun 1970an. skim ini telah ditawarkan kepada belia-belia yang menganggur diseluruh negeri perak pada ketika itu.selepas lima tahun, pihak kerjaan negeri telah menganugerahkan kepada peserta-peserta perlop dengan sebidang tanah yang berkeluasan 10 ekar bagi setiap peserta beserta sebuah rumah dengan nilainya sebanyak rm30,000.00. bermula dari situ maka pelbagai pembangunan telah disediakan oleh pihak kerajaan negeri antaranya jalan tar, bekalanelektrik dan air bersih, surau, padang bola, gelanggang takraw dan dewan orang ramai.\r\n\r\ndalam tempoh beberapa tahun kemudian para peserta rancangan tanah belia perlop telah bersepakat untuk membina sebuah rumah ibadat. oleh yang demikian, satu jawatankuasa penyelarasan telah dibentuk bagi merialisasikan pembangunan sebuah masjid untuk penduduk kampung perlop 2 dan perlop 3 demi menjalankan aktiviti-aktivit agama seperti solat waktu dan yang lebih penting untuk menampung kepadatan jemaah bagi solat jumaat.\r\n\r\npihak jawatankuasa penyelaras telah membuat permohonan melalui wakil rakyat kawasan kepada timbalan perdana menteri malaysia pada ketika itu dan mendapat kelulusan peruntukan sebanyak rm400,000.00 danbermula dari situ proses pembangunan dijalankan pada tahun 1990 dan dinamakan bangunan tersebut sebagai masjid al-falahiyah kampung perlop 2.",
    "source_musolla_id": "MY-08-KK-00342",
    "provision": "-tempat wuduk\r\n-ruang makan\r\n-ruang memasak\r\n-parkir\r\n-tandas awam",
    "directions": "masjid ini terletak di tepi jalan utama kampung perlop 2, dan berhadapan dengan sungai pelus. anggaran perjalanan darat sejauh 20 km dari bandar sungai siput melalui jalan re/ jalan lintang dan jalan felda sebelum ke kampung bawong, hendaklah membelok ke kanan sejauh 2 kilometer arah kampung perlop 2 dan akan bertemu dengan rumah petugas-petugas ccrc perlop dan kem ccrc perlop dan terus ke kampung perlop 2."
  },
  "w0zf89pngj": {
    "address": "Kampung Senggang, Senggang, Perak, Malaysia 33000",
    "contact": "01133948060",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.664887,
      "longitude": 100.930162
    },
    "name": "MASJID AL - ANSAR",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "a5636288-6eb9-4fc1-a402-a244cfc8eaba",
    "geohash": "w0zf89pngj",
    "remarks": "masjid jamek al-andar telah dibina pada tahun 1993 dengan sumbangan orang ramai dan dibantu oleh pihak kerajaan. anggaran kos pembinaan pada ketika itu adalah sebanyak rm400,000.perasmian masjid ini telah disempurnakan oleh dytm raja doktor nazrin shah ibni sultan azlan muhibudin shah  raja muda perak pada 15 ramadhan 1424h bersamaan 10 november 2003.masjid ini telah didaftarkan dibawah jabatan agama islam perak dan no pendaftaran adalah japk/bpm/m/kks/50. masjid ini oleh boleh menampung seramai 800 jemaah dalam satu-satu masa.",
    "source_musolla_id": "MY-08-KK-00383",
    "provision": "-tempat wuduk\r\n-telekung\r\n-sejadah\r\n-bilik pegawai masjid\r\n-ruang memasak\r\n-garaj kenderaan\r\n-tandas awam\r\n-tandas orang kelainan upaya\r\n-pondok rehat"
  },
  "w0zg30txjb": {
    "address": "Kota Lama Kanan, Perak, Malaysia 31050",
    "contact": "0125673046",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.793991,
      "longitude": 100.95019
    },
    "name": "MASJID SULTAN MANSUR SHAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "2492f457-563e-4860-bb27-c0ab14c17b96",
    "geohash": "w0zg30txjb",
    "remarks": "masjid kota lama kanan dibina pada zaman almarhum rahmatullah sultan mansur shah, sultan perak yang ke ii dengan perbelanjaan pada masa itu rm3800. sumbangan-sumbangan adalah dari tengku permaisuri cik uteh mariah rm1000 kerajaan rm1800 dan lain-lain penderma sebanyak rm1000. masjid ini dimulai sembahyang pada 15 zulhijjah 1332 bersamaan 13 oktober 1916m. perubahan masa dan zaman telah menukar bentuk rupa bangunan masjid ini dari lama kepada yang sedia ada sekarang. ini disebabkan dengan penambahan penduduk dan keselesaan para jemaah kian bertambah. sehingga kini masjid ini belum pernah dirasmikan oleh sesiapa.",
    "source_musolla_id": "MY-08-KK-00387",
    "provision": "-tempat wudhu\r\n-telekung\r\n-sejadah\r\n-bilik mesyuarat\r\n-bilik pegawai masjid\r\n-pejabat masjid\r\n-ruang makan\r\n-ruang memasak\r\n-parkir\r\n-laluan orang kurang upaya\r\n-kerusi orang kurang upaya\r\n-ruang bilik kuliah\r\n-bazigo (pondok rehat)\r\n-kawasan riadah\r\n-",
    "directions": "LOKASI MASJID INI TERLETAK DI TEPI SUNGAI PERAK, DI KAMPUNG KOTA LAMA KANAN. JARAKNYA DARI BANDAR DIRAJA KUALA KANGSAR HANYA 3.5KM SAHAJA UNTUK SAMPAI KE MASJID INI.JALAN UNTUK SAMPAI KE MASJID MESTILAH MELALUI JAMBATAN SULTAN ABDUL JALIL. SEPANJANG JALAN KE MASJID INI, KITA AKAN TERNAMPAK SEKOLAH RENDAH KEBANGSAAN KOTA LAMA KANAN, BENGKEL-BENGKEL KRAFTANGAN. TIADA BANGUNAN BERSEJARAH ATAU TERKENAL DISEBABKAN MASJID INI TERLETAK DILUAR BANDAR."
  },
  "w0zg1kw388": {
    "address": "Sayong, Perak, Malaysia 33000",
    "contact": "0175735865",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.771072,
      "longitude": 100.961983
    },
    "name": "MASJID IDRISIAH II",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "247539e3-2092-4d49-b69e-bdc54ac6c162",
    "geohash": "w0zg1kw388",
    "source_musolla_id": "MY-08-KK-00359"
  },
  "w0zg96cbrx": {
    "address": "Kampung Loh, Kota Lama Kanan, Perak, Malaysia 33600",
    "contact": "0125780975",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.849174,
      "longitude": 100.956103
    },
    "name": "MASJID FADZILIAH KG. LOH KARAI",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "c6427044-293b-41d3-8ebe-b2b83208d72c",
    "geohash": "w0zg96cbrx",
    "remarks": "pada tarikh 15.12.1985 seuah masjid dibina di kg loh karai. masjid ini diberi nama masjid jamek kg loh karai mengambil sempena nama kg loh karai. tanah tapak masjid ini diwakafkan oleh tn hj pandak hamzah. sebelum didirikan masjid pihak pejabat agama membenarkan kariah masjid ini bersolat jumaat di surau kg kuala karai bermula 11.9.1987. kariah masjid ini datang dari kg loh, kg ulu karai, kg uala karai dan kg suak rambai. masjid telah dikunjungi sultan perak ke 34 dan ke 35 iaitu almarhum sultan azlan muhibbuddin shah ( masjlis berbuka puasa ) dan dymm sultan nazrin muizuddin shah ( solat jumaat ) pada 24.04.2015.",
    "source_musolla_id": "MY-08-KK-00366",
    "provision": "-tempat wudhu\r\n-telekung\r\n-sejadah\r\n-bilik mesyuarat\r\n-pejabat masjid ( dalam ubahsuai)\r\n-ruang memasak\r\n-parkir\r\n-tandas awam\r\n-kerusi orang kurang upaya\r\n-perpustakaan\r\n-ruang it ( dalam ubahsuai )",
    "directions": "-lokasi 3km dari pekan karai dan 15km dari bandar kuala kangsar\r\n-berhampiran jambatan victoria\r\n-laluan mudah ke masjid jika dari jalan utama kuala kangsar ke ipoh"
  },
  "w0zfh5d442": {
    "address": "Hulu Kinta, Kinta, Perak, Malaysia 30010",
    "contact": "05-2541816",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.589885,
      "longitude": 101.077069
    },
    "name": "MASJID PALOH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "29405a8f-082d-41dd-a3a3-1d85fdbbf2db",
    "geohash": "w0zfh5d442",
    "remarks": "Menurut sejarah, masjid ini merupakan masjid batu yang tertua di negeri Perak yang telah dirancang pembinaannya sewaktu pemerintahan Sultan Idris Murshidul Azam Shah dan siap dibina pada 1912 Masihi. Pembinaan masjid ini adalah atas daya usaha Orang Kaya-Kaya Seri Adika Raja Syahbandar Muda Datuk Wan Muhammad Salleh dan juga daripada derma hartawan bernama Mahmud bin Mohd Taib dan Tuan Haji Mohd Kasim bin Ngah Banjar Jagra.",
    "source_musolla_id": "MY-08-IPH-00185",
    "provision": "-tempat wudhu\r\n-telekung\r\n-sejadah\r\n-bilik mesyuarat\r\n-pejabat masjid\r\n-ruang makan\r\n-ruang memasak\r\n-parkir\r\n-tandas awam\r\n-tandas orang kurang upaya\r\n-ruang bilik kuliah\r\n-pondok rehat",
    "directions": "MASJID INI TERLETAK DI JALAN DATUK, IAITU TIDAK JAUH DARI TEBING KIRI SUNGAI KINTA DAN DI SEBERANG PASAR MINGGU BANDAR IPOH."
  },
  "w0zeevj439": {
    "address": "Taman Saujana Jaya, Asam Kumbang, Perak, Malaysia 34000",
    "contact": "012-5550973",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.861842,
      "longitude": 100.71861
    },
    "name": "MASJID AL HIDAYAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "c853a4bc-fbd5-40c5-a328-1e3ec8cf74bd",
    "geohash": "w0zeevj439",
    "source_musolla_id": "MY-08-TPG-00481"
  },
  "w0zc6jk9q8": {
    "address": "Belanja, Perak, Malaysia 31550",
    "contact": "012 5753463",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.467534,
      "longitude": 100.992795
    },
    "name": "MASJID NAQLIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "81553654-32fd-4eb4-b555-ebe552155103",
    "geohash": "w0zc6jk9q8",
    "remarks": "1. TANAH ASAL WAKAF INDIVIDU, BANGUNAN ASAL ADALAH KAYU\r\n2. DAPAT PERUNTUKAN PERSEKUTUAN rm 400.000.00",
    "source_musolla_id": "MY-08-SI-00147",
    "provision": "1. KEMUDAHAN PENGHAWA DINGIN\r\n2. KERETA JENAZAH",
    "directions": "1. JALAN UTAMA JALAN TG BELANJA - BOTA KIRI\r\n2. BERHAMPIRAN DENGAN MARDI\r\n3. BERHAMPIRAN TEPIAN SUNGAI PERAK"
  },
  "w0z96p9u4v": {
    "address": "Pengkalan Baharu, Perak, Malaysia 34900",
    "contact": "012-4846659",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.480393,
      "longitude": 100.637288
    },
    "name": "MASJID AN-NAWAWI",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "175056d8-01cd-4cbe-a741-2829fcd931f7",
    "geohash": "w0z96p9u4v",
    "remarks": "masjid an nawawi terletak di kg pengkalan baru pantai remis. masjid ini mula dibina pada sekitar awal 1920 an.maklumat asas tidak diperlohi hanya melalui sumber yang boleh dipercayai.tapak asal masjid ini adalah bersebelahan tanah perkuburan islam kg pengkalan baru. masjid in dibina secara gotong royong oleh penduduk kampung.\r\n\r\npada tahun 1939 masjid an nawawi telah berpindah ke kawasan sekarang, pembinaan dibuat secara berperingkatt oleh penduduk kampung menggunakan binaan kayu yang diambil dikawasan sekitar. balai lintang dan ruang masak juga dibuat seiring dengan pembinaan masjid.\r\n\r\ncetusan untuk membina masjid baru bermula sejak tahun 1985, atas sebab pertambahan penduduk ruang solat tidak mencukupi untuk menampung jemaah semasa solat jumaat dan solat sunat hari raya.mulai tahun 1990 atas inisiatif adun pengkalan baru telah melantik ajk bagi pembinaan masjid baru.\r\n\r\nmasjid baru mula dibina pada tahun 1999 dengan dibiayai oleh kerajaan dan derma dari orang ramai. masjid siap dan digunakan pada 1 nov 2002. nama masjid an nawawi ini diambil sempena nama hj nawawi b hj tahir tokoh ulama terkenal di negeri perak.\r\n\r\nmasjid an-nawawi dirasmikan oleh dytm raja muda perak darul ridzuan raja nazrin shah ibni sultan azlan shah muhibbudin shah pada 18 sept 2008.",
    "source_musolla_id": "MY-08-MJG-00045",
    "provision": "-tempat wudhuk\r\n-telekung\r\n-sejadah\r\n-bilik mesyuarat\r\n-bilik pegawai masjid\r\n-pejabat masjid\r\n-ruang makan\r\n-ruang masak\r\n-parkir\r\n-tandas awam\r\n-ruang bilik kuliah\r\n-gazibo ( pondok rehat )\r\n-kawasan riadah",
    "directions": "lokasi masjid ini terletak diantara pertengahan bandar taiping dan juga manjung. pekan terdekat adalah pantai remis 2 km dari masjid ini."
  },
  "w0z8vegm0f": {
    "address": "Sitiawan, Perak, Malaysia 32000",
    "contact": "0195468708",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.372057,
      "longitude": 100.793071
    },
    "name": "MASJID AL RABBANIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "59bac2fe-66f0-440e-b259-dd5f53f9d0ae",
    "geohash": "w0z8vegm0f",
    "source_musolla_id": "MY-08-MJG-00025",
    "provision": "-tempat wuduk\r\n-telekung\r\n-sejadah\r\n-ruang makan\r\n-ruang memasak\r\n-parkir\r\n-kedai perniagaan\r\n-tandas awam\r\n-kerusi orang kurang upaya",
    "directions": "jalan utama - 7 km ke bandar ayer tawar, 16km ke pekan beruas"
  },
  "w0z8sfmnn4": {
    "address": "Sitiawan, Perak, Malaysia 32000",
    "contact": "0175988653",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.320045,
      "longitude": 100.762749
    },
    "name": "MASJID AL-AQSA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "cc57b3a9-058e-42b8-93b7-757819fd31fc",
    "geohash": "w0z8sfmnn4",
    "remarks": "pada awalnya masjid dibina di ayer tawar estate sebelum ia dipindahkan ke kg sungai ramai iaitu ke tapak sekarang pada tahun 1957 atas sebab estate tersebut telah dijual.\r\n\r\nproses pemindahan adalah melalui gotong royong dimana semua penduduk kampung beramai-ramai dan bertungkus lumus memindahkan dan membina semula masjid di tapak sekarang.\r\n\r\npada masa itu, bekalan air dan elektrik masih tidak dapat diperoleh dan air perigi digunakan sebagai alternatif",
    "source_musolla_id": "MY-08-MJG-00030",
    "provision": "-tempat wudhu\r\n-telekung\r\n-sejadah\r\n-ruang makan\r\n-ruang memasak\r\n-parkir\r\n-pondok telefon\r\n-tandas awam",
    "directions": "masjid al-aqsa terletak kira-kira 4km dari pekan ayer tawar"
  },
  "w0zergt3uv": {
    "address": "Kampung Lubuk Merbau, Lubok Merbau, Perak, Malaysia 33010",
    "contact": "0173942468",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.809597,
      "longitude": 100.894874
    },
    "name": "MASJID AL - MARBAWI",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "67b3e9f5-48da-4e25-8309-fbfcbdad0c93",
    "geohash": "w0zergt3uv",
    "remarks": "berdasarkan pertambahan penduduk di kariah masjid jamek al-marbawi, lubuk merbau yang kian meningkat sekarang, maka sebuah masjid yang lebih besar adalah perlu dibina bagi mengimbangi keperluan penuduk yang kian ramai itu.\r\n\r\nkeadaan begini telah mula dirasakan sejak beberapa tahun yang akhir-akhir ini, khususnya pada waktu-waktu bersolat pada hari jumaat dan hari raya. di dua waktu ini, baik pada hari jumaat ataupon pada hari raya aidilfitri atau aidiladha, keadaan bersesak sewaktu bersolat amat dirasakan.ini adalah disebabkan masjid yang sedia ada hanya mampu mengisi keperluan berjemaah untuk seramai 320 orang sahaja, sedangkan penduduk di sekitar kariah masjid ini sudah meningkat ke angka 1200 orang.   \r\n\r\nmasjid yang sedia ada ini atau pon dalam konteks kedudukannya pada hari ini secara lebih mudah disebut sebagai masjid lama, telah dibina pada tahun 1960. usaha-usaha ke arah pembinaannya bolehlah digariskan sebagai sebuah usaha yang dibuat secara tergesa-gesa disebabkan masjid yang terdahulu berada dalam keadaan yang amat uzur sekali.jawatankuasa masjid pada waktu itu berpendapat sebuah masjid baru yang lebih sempurna wajar dibina bagi kemudahan dan keselesaan berjemaah.\r\n\r\ndengan tiada mempunyai walau sesen pon wang tabungan bagi digunakan sebagai perbelanjaan membina sebuah masjid yang sempurna, penduduk mukim lubok merbau telah digerakkan untuk bersama menghulurkan sumbangan bagi tujuan yang suci lagi mulia ini. atas inisiatif serta kerja keras penghulu mukim waktu itu, en khairi b hj mat yatim beserta ketua-ketua kampung dan juga jawatankuasa masjid, sejumlah rm6500 telah dapat dikumpulkan.\r\n\r\nmelalui wang sebanyak itulah beserta tambahan peruntukan dari kerajaan negeri perak  sebanyak rm5500 lagi menjadikan jumlah kesemuanya rm12,000 telah dibelanjakan pada peringkat awal bagi membina sebuah masjid yang baru.jurubina bagi kerja-kerja pembinaan masjid ini ialah cheng fah constructionc company.\r\n\r\ndengan siap terbinanya masjid ini maka masalah ketidakselesaan berjemaah di masjid yang berkeadaan uzur, tidak timbul lagi.masjid jamek al- marbawi ini kemudiannya pada hari ahad 12 februari 1961, telah dirasmikan oleh ke bawah dymm paduka seri sultan perak waktu itu, almarhum sultan yussuf izzuddin ghafarallahu-lahu shah.\r\n\r\nsesudah lebih dari dua dasawarsa masjid lama ini tegak berdiri sebagai tempat beribadat bagi penduduk sekitar kariahnya yang meliputi kg pulai, kg jenalik, kg gemuruh, kg paya, bt 36,kg hujung tanjung, kg kubang panjang, kg guntung, pekan lubuk merbau, kg rambung,dan kg jelapang. masa akhir ini khusunya sejak tujuh lapan tahun yang lalu, kepadatan jemaah yang bersolat disini kian dirasakan.penduduk setempat kian meningkat, sementara masjid yang ada hanya boleh mngekalkan keperluan berjemaah bagi 12 saf yang setiap sesaf sesuai untuk 27 orang sahaja.\r\n\r\nsatu ikhtiar dan usaha baru perlu dijalankan.masjid yang sedia ada mesti diperbesarkan atau jika boleh sebuah masjid baharu yang lebih besar wajar dibina lagi,. untuk membina sebuah masjid/baru masalah tapak tanah terpaksa didepani. namun begitu masalah ini akhirnya dapat diatasi bila puan hajjah khadijah bt kulop wahab dan keluarga, telah bermurah hati menyumbangkan atau mewakagkan sekeping tanahnya yang terletak di kawasan bahagian belakang masjid lama, sebagai tapak untuk didirikan masjid yang baharu. pihak jawatankuasa masjid amatlah terhutang budi serta berterima kasih atas sumbangan yang amat bermakna ini.\r\n\r\nproses biasa untuk membangunkan sebuah masjid dimulakan. mesyuarat demi mesyuarat jawatankuasa kerja pembinaan masjid baru telah dijalankan. berdasarkan keputusan-keputusan dari mesyuarat ini , kutipan derma dari seluruh masyarakat islam setempat dan juga seluruh negeri telah dilancakan serta mendapat sambutan yang menggalakkan . sejumlah rm26,970 telah dapat dikumpulkan pada peringkat awal pelancaran derma ini.\r\n\r\npihak ahli jawatankuasa juga mengucapkan terima kasih kepada yang berhormat tuan haji mior aris mior abu bakar, ahli dewan undangan negeri kawasan lubok merbau kerana dengan daya usahanya telah berjaya mendapatkan peruntukan khas sebanyak rm150,000 daripada yab dati seri dr mahathir mohamed , perdan menteri malaysia dan sebnayak rm76,000 daripada kerajaan negeri perak untuk menjayakan pembinaan masjid ini.\r\n\r\npada 11 julai 1984, kerja-kerja awal meratakan tanah tapak pembinaan masjid baru telah dimulakan. kerja-kerja pembinaan seterusnya telah juga dijalankan dengan lancar, dimana kerja-kerja pembinaan ini telah dilakukan oleh syarikat pembinaan sri akal sdn bhd. pembinaan masjid baru yang dianggarkan menelan belanja sebnayak rm250,000 ini telah sempurna disiapkan pada april 1985. masjid baru ini adalah bersaiz lebih besar dari ruang masjid yang lama, iaitu mempunyai sebanyak 13 saf setiap satu sesuai untuk seramai 36 orang bersolat. ini bermakna masjid baru ini boleh memuatkan seramai sekitar 470 orang untuk berjemaah sekaligus.\r\n\r\nwalaupun masjid baru telah diperolehi, ini tidak bererti masjid lama yang kecil itu dibiarkan begitu sahaja. jawatankuas amasjid berpendpat masjid lama ini hendaklah terusa digunkan, dan dengan pengekalan penggunaan masjid lama begini , keseluruhan komples masjid jamek al-merbawi lubuk merbau mampu menaggung kegunaan berjemaah bagi serami 790 orang sekaligus. untuk itu kerja-kerja membaik pulih dan mgubahsuai beberapa struktur bangunan masjid lama ini, termasuk membekalkan beberapa peralatan baru telah dijalankan. sebanyak rm40,000 telah dibelanjakan bagu tujuan ini.\r\n\r\nsejak dari tahun 1961 hinggalah ke hari ini, seramai sembilan orang imam telah berkhidmat. mereka ialah allahyarham mohd daie b hj abdul karim, hj mohd kamil b hj osman, allahyarham hj mohd yunus b hj mahmuddin, hj abas b abdulraof, mohamed b baharum, allahyarham hj jamil b shariff, hj abdul manaf b ngah mat basir, hj ayob b hj mohamad & mohd radzi b kulob meon\r\n\r\nhari ini jumaat 12 jamadil akhir 1406 bersamaan 21 februari 1986, masjid jamek al-marbawi lubuk merbau sekali lagi mencatatkan sejarahnya. jika suku abad yang lalu paduka seri sultan perak ke-32 mencemar duli berangkat merasmikan masjid yang lama, hari ini paduka seri sultan perak ke-34 pula perkenan mencemar duli berangkat merasmikan bangunan masjid yang baru pula. sesungguhnya di sinilah terletaknya keistimewaan masjid jamek al-merbawi lubuk merbau, kerana kedua-dua kompleks bangunannya telah dirasmikan oleh dua sultan yang mempuyai pertalian yang khusus-ayahnda dan anakanda.",
    "source_musolla_id": "MY-08-KK-00368",
    "provision": "-tempat wudhu\r\n-telekung\r\n-sejadah\r\n-bilik mesyuarat\r\n-bilik pegawai masjid\r\n-pejabat masjid\r\n-ruang makan\r\n-ruang memasak\r\n-kedai perniagaan\r\n-laluan orang kurang upaya\r\n-tandas awam\r\n-kerusi orang kurang upaya\r\n-ruang it\r\n-bazigo\r\n-kawasan riadah",
    "directions": "berhampiran dengan pekan lubuk merbau dan terletak di tengah-tengah kg dan taman perumahan:\r\n\r\ndi sebelah utara masjid : kg jelapang dan kg lubuk merbau tua\r\ndi sebelah selatan : perumahan awam meor aris, taman impiana, taman exora, kg pulai, kg jenalik, kg gemuruh\r\nsebelah barat : kg rambong, kg tersusun\r\ntimur : kg paya, kg ujung tanjung, kg kubang panjang\r\nperumahan dalam kawasan pekan lubuk merbau\r\nberhampiran dengan lebuh raya timur barat ( pantai timur )"
  },
  "w0zkxb01dw": {
    "address": "Taman Keramat Indah, Bagan Serai, Perak, Malaysia 34300",
    "contact": "013 5101354",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.010056,
      "longitude": 100.536005
    },
    "name": "MASJID JAMEK DAERAH BAGAN SERAI",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "0f5881a7-1904-46c3-b591-b1575fcabe66",
    "geohash": "w0zkxb01dw",
    "remarks": "terletak di jalan jetty bagan serai, berhampiran dengan sungai kurau. tidak diketahui tarikh sebenar masjid ini dibangunkan.walaubagaimanapun adalah dipercayai masjid ini dibina sebelum tahun 1900. ini berdasarkan kepada maklumat bahawa seorang daripada kerabat di raja perak yang digelar 'tok mat ali' telah lari daripada british selepas perjanjian pangkor 1874. beliau menetap di pulau mat ali untuk mengelak dari ditangkap oleh pihak inggeris. beliau dikhabarkan sering mendirikan solat jumaat di masjid ini.",
    "source_musolla_id": "MY-08-BS-00009",
    "provision": "-tempat wuduk\r\n-telekung\r\n-sejadah\r\n-bilik mesyuarat\r\n-bilik pegawai masjid\r\n-ruang makan\r\n-ruang memasak\r\n-parkir\r\n-laluan orang kurang upaya\r\n-tandas awam\r\n-tandas orang kurang upaya\r\n-perpustakaan\r\n-ruang it"
  },
  "w0zeefxfbk": {
    "address": "Asam Kumbang, Perak, Malaysia 34000",
    "contact": "012-5151569",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.848215,
      "longitude": 100.722331
    },
    "name": "MASJID JAMEK KPG. BOYAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "77638a81-5fb0-4fe1-9bcf-df80d4db77dd",
    "geohash": "w0zeefxfbk",
    "remarks": "surau diri jumaat telah dimulakan pada tahun 1985 dibangunkan madrasah al-taufiqiah jalan raja sulung kampung boyan. cetusan membangunkan masjid di kg boyan adalah disebabkan beberapa peristiwa ahli kariah yang pergi menunaikan solat jumaat di masjid daerah taiping kerap kali ditimpa kemalangan jalan raya. antara lain seorang ahli kariah meninggal akibat kemalangan jalan raya semasa dalam perjalanan ke masjid daerah taiping.pembangunan pesat di kampung boyan menjadikan pertambahan penduduk lebih pantas.taman long jaafar membina lebih dari 300 rumah sekitar tahun 80an. satu kawasan diperuntukkan tapak masjid kg boyan ditengah-tengah taman long jaafar.\r\n\r\njawatankuasa pembinaan masjid telah ditubuhkan untuk memungut derma. setelah beberapa tahun di jalankan kutipan derma dari ahli kariah dan orang ramai telah berjaya mengumpulkan wang berjumlah rm250,000. bermula dari situ ajk telah merayu sumbangan dari kerajaan negeri dan pusat akhirnya berjaya mendapat sumbangan kerajaan pusat berjumlah rm1,000,000. bermula dari tarikh tersebut pembinaan dimulakan. pembinaan masjid jamek kg boyan dilaksanakan oleh pejabat daerah larut matang dan selama bersama-sama ahli jawatankuasa pembinaan masjid jamek kg boyan. pembinaan berjalan lancar hingga siap dibina.",
    "source_musolla_id": "MY-08-TPG-00486",
    "provision": "-tempat wuduk\r\n-telekung\r\n-sejadah\r\n-bilik mesyuarat\r\n-bilik pegawai masjid\r\n-pejabat masjid\r\n-ruang makan\r\n-ruang memasak\r\n-parkir\r\n-laluan orang kurang upaya\r\n-tandas awam\r\n-perpustakaan\r\n-ruang it\r\n-kawasan riadah",
    "directions": "disertakan pelan lokasi yang lengkap."
  },
  "w0zegcxh1q": {
    "address": "Kampung Jana Baru, Asam Kumbang, Perak, Malaysia 34600",
    "contact": "012-5282444",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.886892,
      "longitude": 100.721344
    },
    "name": "MASJID MAIMON",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "9ab57d73-14e9-4f1d-80f7-efa37db7aaf7",
    "geohash": "w0zegcxh1q",
    "source_musolla_id": "MY-08-TPG-00491"
  },
  "w0zeu4r691": {
    "address": "Kamunting, Perak, Malaysia 34600",
    "contact": "058911013",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.890726,
      "longitude": 100.732664
    },
    "name": "MASJID JAMEK KAMUNTING",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "35fadb9e-a1a6-4209-94a0-0e45302ca808",
    "geohash": "w0zeu4r691",
    "remarks": "masjid jamek kamunting didirikan sekitar tahun 40an di kawasan bekas lombong bijih timah. berkat usaha pemimpin-pemimpin tempatan dan disokong oleh pihak british, yang menganugerahkan sebidang tanah, maka terdirilah sebuah masjid yang berdindingkan papan dengan kos pembinaannya pada masa itu sekitar rm35,000 sahaja. tahun berganti tahun maka banyak perubahan telah berlaku terutamanya struktur bangunannya daripada bangunan kayu berandur-ansur menjadi bangunan batu sepenuhnya. sehingga hari ini sudah empat kali bangunan ini berubah sehingga menjadi bangunan yang sedia ada sekarang.sekarang antara pengerusi-pengerusi yang dikhabarkan kepada penulis adalah seperti berikut :\r\n\r\n1-tn haji jaafar b uduh\r\n2-tn haji mohammad b nor\r\n3-tn haji hasan b basri\r\n4-tn haji shamsuddin b hj salleh\r\n5-tn haji hassan b ali",
    "source_musolla_id": "MY-08-TPG-00515",
    "provision": "-tempat wudhu\r\n-telekung\r\n-sejadah\r\n-bilik mesyuarat\r\n-bilik pegawai masjid\r\n-ruang makan\r\n-ruang memasak\r\n-parking\r\n-kedai perniagaan\r\n-tandas awam\r\n-kerusi orang kurang upaya\r\n-ruang bilik kuliah\r\n-bazigo\r\n-kawasan riadah",
    "directions": "-masjid jamek kamunting terletak dipersimpangan utama dari bandar taiping ke pekan batu kurau, selama dan bagan serai. selain itu, kedudukan masjid ini yang berada dilaluan utama bandar taiping dari lebuh raya utara selatan yang memalui tol kamunting utara, menjadikan masjid ini sebagai tempat persingghana utama pengguna yang beragama islam"
  },
  "w0zestyt2z": {
    "address": "Kamunting, Perak, Malaysia 34600",
    "contact": "0134230049",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.866513,
      "longitude": 100.753596
    },
    "name": "MASJID TELEKOM",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "bf155474-3a9c-4488-9301-2ca6a575b018",
    "geohash": "w0zestyt2z",
    "source_musolla_id": "MY-08-TPG-00524",
    "directions": "-1km dari pusat peranginan bukit larut ( bukit maxwell )\r\n-0.5 km dari maktab rendah sains mara taiping\r\n-1.5 km dari penjara taiping\r\n-5 km dari pusat bandar taiping\r\n-2 km dari zoo taiping"
  },
  "w0zbr8neyy": {
    "address": "Chenderiang, Perak, Malaysia 35350",
    "contact": "0195036338",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.263372,
      "longitude": 101.237252
    },
    "name": "MASJID JAMEK AR RAHMANIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "2c3cd5eb-4a46-49da-855a-57965aecf58a",
    "geohash": "w0zbr8neyy",
    "source_musolla_id": "MY-08-TPH-00410",
    "provision": "1. BALAI LINTANG\n2. TANDAS\n3. TEMPAT WUDUK\n4. STOR\n5. TEMPAT MASAK\n6. TEMPAT LETAK KENDERAAN"
  },
  "w0zbmzsk32": {
    "address": "Kampar, Perak, Malaysia 31900",
    "contact": "0175335861",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.304624,
      "longitude": 101.157021
    },
    "name": "MASJID  AN - NUR KAMPAR",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "c63cbba5-49d4-42ee-a9a0-0694fc376338",
    "geohash": "w0zbmzsk32",
    "source_musolla_id": "MY-08-BG-00332"
  },
  "w0zf7fuz83": {
    "address": "Hulu Kinta, Kinta, Perak, Malaysia 30010",
    "contact": "019-5122015",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.630657,
      "longitude": 101.069776
    },
    "name": "MASJID AS-SAADAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "ff845a06-7111-4a61-b020-419f62bd5b71",
    "geohash": "w0zf7fuz83",
    "source_musolla_id": "MY-08-IPH-00187"
  },
  "w0zfkh42ws": {
    "address": "Ipoh, Perak, Malaysia 31400",
    "contact": "0134477641",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.636341,
      "longitude": 101.077597
    },
    "name": "MASJID JAMEK KAMPUNG DATO' AHMAD SAID",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "8e493a6c-86e4-4225-85a3-64b847635925",
    "geohash": "w0zfkh42ws",
    "source_musolla_id": "MY-08-IPH-00193"
  },
  "w0zfhcksxp": {
    "address": "Hulu Kinta, Kinta, Perak, Malaysia 30010",
    "contact": "0123037352",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.577993,
      "longitude": 101.113668
    },
    "name": "MASJID IDRIS ISKANDAR SHAH 1",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "63139427-a8aa-4922-a526-2172e0192481",
    "geohash": "w0zfhcksxp",
    "remarks": "kampung sungai rokam pada asalnya merupakan sebuah kawasan tanah perlombongan yang diusahakan oleh syarikat inggeris dengan kerjasama kerajaan negeri perak.pada tahun 1959 kawasan perlombongan ini telah ditutup secara berperingkat. setelah tamat kerja-kerja perlombongan oleh syarikat tersebut, kawasan ini telah teringgir dari arus pembangunan untuk sekian lamanya.kesempatan ini telah diambil oleh pihak parti komunis malaya (pkm) untuk cuba menyusup masuk di kawasan-kawasan lombong terbiar ini bagi mendapatkan bantuan dari penduduk yang masih tinggal, terutamanya dari kaum cina.\r\n\r\ndengan keadaan tanah yang terbiar, terdapat sekumpulan kaum cina telah menjalankan penerokaan secara haram bagi mengusahakan tanaman sayur secara berperingkat. lama kelamaan, kawasan ini telah banyak diterokai oleh kaum tersebut. sehubungan dengan itu, yab dato seri panglima bukit gantang wahab, menteri besar perak yang pertama, dengan kerjasama pembesar-pembesar negeri dan pihak keselamatan, telah bersetuju mengambil alih tanah ini untuk menempatkan orang-orang melayu dan dijadikan kampung orang-orang melayu sahaja.\r\n\r\nsemasa negeri perak di bawah pentadbiran yab dato' seri ahmad b said, perkampungan ini telah dibuka dengan nama kampung sungai rokam, bersempena dengan terdapatnya beberapa batang pokok rokam terbiar yang ditanam oleh pekebun sayur sebelumnya.\r\n\r\nsetelah wujudnya sebuah perkampungan yang didiami oleh keseluruhannya orang melayu, maka cadangan pembinaan sebuah masjid mula dirancangkan oleh penduduk-penduduk bersama pihak majlis agama islam dan juga pegawai kerajaan negeri untuk dikemukakan ke yab menteri besar perak. permohonan tersebut telah diluluskan dan proses pembinaannya mula dilaksanakan pada 9 februari 1963,dengan kos pembangunan keseluruhannya pada masa tersebut dianggarkan sebanyak rm45,000 di atas sebidang tanah berkeluasan hampir 1 ekar. pembinaannya berjalan dengan lancar, dan pada penghujung tahun 1964, pembinaan bangunan tersebut siap dengan jayanya. bangunan masjid ini secara rasminya diberi nama masjid sultan iskandar shah 1, kg sungai rokam, bersempena dengan kewujudannya semasa di bawah pemerintahan tuanku sultan. baginda juga telah banyak menyumbang dan memainkan peranan penting di dalam merealisasikan pembangunan masjid ini. pada 11 disember 1964, masjid ini telah dirasmikan oleh yab dato seri ahmad b said, menteri besar perak di masa itu.\r\n\r\ndari tempoh permulaan pembinaannya, masjid ini telah genap mencapai 50 tahun pada 9 feb 2013 yang lalu. seiring dengan peredaran masa,keperluan untuk membangunkan semula masjid ini telah dikaji, agar ianya dapat membantu mengeratkan lagi perpaduan dan ukhwah disamping memberi keselesaan untuk beribadah kepada para jemaah bagi tahun-tahun berikutnya.",
    "source_musolla_id": "MY-08-IPH-00189",
    "provision": "-tempat wuduk\r\n-telekung\r\n-sejadah\r\n-bilik mesyuarat\r\n-bilik pegawai masjid\r\n-pejabat masjid\r\n-ruang makan\r\n-ruang memasak\r\n-parkir\r\n-kedai perniagaan\r\n-tandas awam\r\n-kerusi orang kurang upaya\r\n-perpustakaan\r\n-ruang bilik kuliah\r\n-rumah musafir",
    "directions": "lokasi masjid ini terletak di dalam kawasan kampung sungai rokam, kampung melayu tersusun dengan jarak lebih kurang 6km daripada pusat bandaraya ipoh. kampung ini dikelilingi dengan tempat tumpuan ramai iaitu politeknik ungku omar di sebelah utara dan medan gopeng disebelah barat serta dikelilingi oleh taman perumahan yang berkepadatan agak tinggi. berikut adalah plan lokasi masjid jamek idris iskandar shah 1, sungai rokam, ipoh, perak"
  },
  "w0zcuj5prd": {
    "address": "Ipoh, Perak, Malaysia 31400",
    "contact": "05-3217780/0135",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.55509,
      "longitude": 101.078665
    },
    "name": "MASJID AL - FURQAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "183b6a69-4711-4d2d-9713-f05d817b6edf",
    "geohash": "w0zcuj5prd",
    "remarks": "tapak masjid ini adalah tapak masjid asal yang dirobohkan dan diganti dengan masjid baru.semasa pembinaan sedang berjalan,jemaah disediakan tempat khas sementara dibahagian tepi belakang masjid ini untuk menunaikan solat. kini kawasan tersebut digunakan sebagai dewan makan sementara. dalam perancangan tapak dewan makan ini didirikan bangunan tiga tingkat dengan kemudahan perpustakaan, dewan di bahagian bawah dan lain-lain kegunaan.",
    "source_musolla_id": "MY-08-IPH-00162",
    "provision": "-tempat wuduk\r\n-telekung\r\n-sejadah\r\n-bilik mesyuarat\r\n-bilik pegawai masjid\r\n-pejabat masjid\r\n-ruang makan\r\n-ruang memasak\r\n-parkir\r\n-kedai perniagaan\r\n-laluan orang kurang upaya\r\n-tandas awam\r\n-tandas orang kurang upaya\r\n-perpustakaan\r\n-ruang it\r\n-kawasan riadah",
    "directions": "jalan pasir putih merupakan jalan utama bagii kawasan masjid al-furqan. berhampiran dengan station 18, mempunyai pusat membeli belah jusco dan tesco. terdapat jalan pintas ke medan gopeng melalui jalan lapangan terbang sultan azlan shah."
  },
  "w0z8t4sjkn": {
    "address": "Sitiawan, Perak, Malaysia 32000",
    "contact": "0165341136",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.321311,
      "longitude": 100.772272
    },
    "name": "MASJID AL FALAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "2fd518e9-96fd-40b0-805b-4390d431a4f9",
    "geohash": "w0z8t4sjkn",
    "source_musolla_id": "MY-08-MJG-00018"
  },
  "w0zg9h50v8": {
    "address": "Kampung Temong Hilir, Kota Lama Kiri, Perak, Malaysia 33600",
    "contact": "0195620160",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.85609,
      "longitude": 100.946748
    },
    "name": "MASJID AS - SYAKIRIN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "17a04754-73d7-490c-9501-ef3962eeba53",
    "geohash": "w0zg9h50v8",
    "remarks": "-masjid asy-syakirin terletak di kg temong hilir. masjid ini telah dibina pada tahun 1993 bagi menggantikan masjid lama yang telah uzur. masjid asy syakirin dibina di atas tanah wakaf yang terletak di atas bukit.masjid ini menggabungkan beberapa ahli kariah dari beberapa buah kampung iaitu kg temong hilir, kg lubuk chapin dan sebahagian dari kg temong hulu.",
    "source_musolla_id": "MY-08-KK-00385",
    "directions": "-lokasi masjid asy syakirin kg temong hilir terletak di atas sebidang tanah wakaf.di seberang masjid pula terletak tanah perkuburan kg temong hilir juga merupakan sebahagian daripada tanah wakaf kepunyaan masjid. lokasi masjid ini juga terletak di laluan jalan utama menuju ke pekan kati. selain itu juga masjid asy syakirin juga terletak tidak jauh daripada makam orang-orang besar perak iaitu makam tok temong. makam ini sering dikunjungi oleh orang luar yang datang menziarahi dan secara tidak langsung akan singgah di masjid asy asyakirin untuk memunaikan solat."
  },
  "w0zg9byxfy": {
    "address": "Kota Lama Kanan, Perak, Malaysia 31050",
    "contact": "0166980116",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.839467,
      "longitude": 100.984395
    },
    "name": "MASJID AR - RAUDAH SALAK UTARA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "84253389-1e25-4424-8b3b-1720fdec6f67",
    "geohash": "w0zg9byxfy",
    "remarks": "dalam tahun 1983 jawatankuasa kemajuan keselamatan kampung (jkkk) kampung perik yang dpengerusika oleh tuan hj osman b medon, telah mengambil keputusan untuk memohon daripada jabatan agama islam negeri perak bagi membenarkan penduduk kariah salak utara mendirikan solat jumaat di surau kg perik. hal demikian disebabkan penduduk kariah salak utara terpaksa ke masjid kg enggor yang jauhnya antara enam hingga lapan kilometer, untuk mendirikan solat jumaat.\r\n\r\nsetelah mendapat kelulusan jabatan agama islam perak, maka pada 03 ogos 1983, solat jumaat pertama di kg perik dapat didirikan di surau kampung perik. pada hari yang sama juga pengerusi jkkk kg perik ( ketua kg perik) telah meninggal dunia dan diganti oleh en norbi b deroh.\r\n\r\npada tahun 1988, satu peruntukan telah diluluskan untuk membina sebuah masjid di kg perik. sehubungan itu, pada bulan september 1988 sebuah masjid telah siap dibina di kg perik ini dan penyerahan kunci telah dilaksanakan pada 09 september 1988. ahli kariah masjid ini meliputi penduduk kampung setia, kg perik, kg nasib, taman sekitar salak utara dan kg salak stesen.",
    "source_musolla_id": "MY-08-KK-00412",
    "provision": "-tempat wuduk\r\n-telekung\r\n-sejadah\r\n-bilik pegawai masjid\r\n-parkir\r\n-tandas awam",
    "directions": "MASJID INI TERLETAK DALAM KAWASAN TANAH SELUAS KIRA-KIRA 0.5 EKAR, DI TEPI JALAN RAYA PERSEKUTUAN (KM37 (BATU 25) JALAN IPOH-KUALA KANGSAR. KEDUDUKANNYA BERSEBELAHAN KILANG KICAP TAMIN ANGGOR DAN SEBERANG JALAN BERHADAPAN PUSAT KRAFTANGAN CAWANGAN PERAK DI ENGGOR. JARAKNYA DARI KUALA KANGSAR ADALAH KURANG LEBIH 8 KILOMETER DAN DARI SUNGAI SIPUT (U) KIRA-KIRA 10 KILOMETER."
  },
  "w0zenv2r10": {
    "address": "Kampung Buaya, Perak, Malaysia 33700",
    "contact": "0123297894",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.776137,
      "longitude": 100.843902
    },
    "name": "MASJID AL - HADHARI",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "ebb9a481-135e-4001-a7e6-5a2626be2bfc",
    "geohash": "w0zenv2r10",
    "remarks": "masjid al-hadhari yang terletak di pekan padang rengas telah dibina, bermula pada tahun 1993 menggantikan masjid papan yang pernah diubahsuai sebanyak 3 kali. masjid asal dibina secara bergotong royong oleh penduduk setempat serta pendatang yang kebanyakan mereka adalah keturunan mamak islam yang merantau sebagai pedagang. berlandaskan perubahan dan pembangunan sekitar, masjid baru dibina di tapak sama hasil sumbangan kerajaan persekutuan dan kerajaan negeri perak, serta sumabngan dari syarikat swasta, ahli korporat dan orang ramai yang budiman.\r\n\r\nrekabentuk masjid baru ini adalah hasil rekaan seorang arkitek, anak tempatan iaitu datik dr ins hj hashim b hj daud.peristiwa penting semasa pembinaan masjid baru ini adalah, mengenang kembali bagaimana susah payahnya pengerusi dan barisan ahli jawatankuasa masjid untuk mencari dana bagi melaksanakan pembinaan msjid ini.mereka yang terlibat terpaksa berulang alik ke kuala lumpur berjumpa dengan allahyarham tun ghafar baba selaku timbalan perdana menteri ketika itu,untuk memohon peruntukan, sementara ahli jawatankuasa terpaksa menjelajah ke seluruh pelusuk didalam negeri perak dan juga ke negeri-negeri lain di dalam malaysia ini memohon simpati dari orang ramai bagi mengumpul dana sebagai penambahan kepada kos yang belum mencukupi.",
    "source_musolla_id": "MY-08-KK-00339",
    "provision": "-tempat wuduk\r\n-telekung\r\n-sejadah\r\n-bilik mesyuarat\r\n-bilik pegawai masjid\r\n-ruang makan\r\n-ruang memasak\r\n-parkir\r\n-tandas awam\r\n-perpustakaan\r\n-ruang bilik kuliah\r\n-gazibo\r\n-kawasan riadah"
  },
  "w0zfj5qr75": {
    "address": "Hulu Kinta, Kinta, Perak, Malaysia 30010",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.589426,
      "longitude": 101.126886
    },
    "name": "MASJID SULTAN AZLAN SHAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "72285c9d-d85c-4592-9531-85636c5787ab",
    "geohash": "w0zfj5qr75",
    "source_musolla_id": "MY-08-IPH-00188"
  },
  "w0zfhqjhfz": {
    "address": "Hulu Kinta, Kinta, Perak, Malaysia 30010",
    "contact": "05-2413378",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.604127,
      "longitude": 101.092198
    },
    "name": "MASJID MUHIBBUDDIN SHAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "345103ad-3fd2-43ce-8462-17c66018a211",
    "geohash": "w0zfhqjhfz",
    "remarks": "masjid muhibbuddin shah bermula sebagai sebuah surau, sebidang tanah seluas 1.5 ekar, pembinaan bermula 25 april 1996 majlis pecah tanah sebagai permulaan pembinaan, dan tanggal jumaat 12 mei 2006 masjid muhinbbuddin shah telah dirasmikan oleh dymm paduka seri sultan perak sultan azlan muhibbuddin shah.",
    "source_musolla_id": "MY-08-IPH-00416",
    "provision": "-tempat wuduk\r\n-telekung\r\n-sejadah\r\n-bilik mesyuarat\r\n-bilik pegawai masjid\r\n-pejabat masjid\r\n-ruang makan\r\n-ruang memasak\r\n-parkir\r\n-pondok telefon\r\n-mesin atm\r\n-kedai perniagaan\r\n-laluan orang kurang upaya\r\n-tandas awam\r\n-ruang bilik kuliah\r\n-rumah mesaffir\r\n-pondok rehat\r\n-kawasan riadah",
    "directions": "-bandaraya ipoh\r\n-banguna kerajaan\r\n-pusat beli belah\r\n-hospital\r\n-sekolah\r\n-univesiti"
  },
  "w0zfj0jn1b": {
    "address": "Hulu Kinta, Kinta, Perak, Malaysia 30010",
    "contact": "012-5176425",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.571347,
      "longitude": 101.125109
    },
    "name": "MASJID SULTAN YUSUF",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "95a0b1d7-e411-4ccd-96da-a13a33e32cd0",
    "geohash": "w0zfj0jn1b",
    "remarks": "pembukaan penempatan rapat setia, gunung rapat, ipoh ADALAH MEMPUNYAI HUBUNGKAIT YANG BEGITU RAPAT DENGAN PENUBUHAN SYARIKAT KERJASAMA ORANG-ORANG MELAYU, IPOH DALAM TAHUN 1953.PEMBINAAN FASA PERTAMA RUMAH KEDIAMAAN DI RAPAT SETIA INI TELAH DILAKSANAKAN DALAM TAHUN 1959. SEJAK DARI ITU PEMBINAAN PERUMAHAN BERJALAN LANCAR DAN PENDUDUK YANG MENDIAMI KAWASAN RAPAT SETIA INI SEMAKIN BERTAMBAH RAMAI. untuk memenuhi keperluan penduduk disini, dalam fasa ketiga pembinaan perumahan, sebuah surau/madrasah telah dibina di atas tapak berkeluasan 17,690 kaki persegi (lot 46483)di jalan pasar ( jalan raja musa mahadi), rapat setia, gunung rapat,31350 ipoh ia telah dirasmikan oleh dymm paduka seri sultan idris shah dalam tahaun 1963.\r\n\r\ntanah tapak surau berkenaan telah dihadiahkan oleh syarikat kerjasama perumahan orang-orang melayu perak berhad (kini koperasi perumahan orang melayu kinta berhad). pengasas pembinaan surau ini adalah juga pengasas syarikat kerjasama perumahan orang-orang melayu perak berhad.",
    "source_musolla_id": "MY-08-IPH-00190",
    "provision": "-tempat wuduk\r\n-telekung\r\n-sejadah\r\n-bilik mesyuarat\r\n-bilik pegawai masjid\r\n-pejabat masjid\r\n-ruang makan\r\n-parkir\r\n-kedai perniagaan\r\n-laluan orang kurang upaya\r\n-tandas awam\r\n-tandas orang kurang upaya\r\n-perpustakaan \r\n-ruang bilik kuliah\r\n-homestay\r\n-kawasan riadah dan tempat rehat\r\n-kolam air terjun binaan & ikan hiasan\r\n-kereta jenazah\r\n-rezah tanah perkuburan\r\n-sekolah rendah agama rakyat\r\n-sekolah tahfiz kerjasam sekolah swasta",
    "directions": "-masjid sultan yussuf rapat setia terletak dalam kawasan taman perumahan koperasi dan taman swasta. kedudukannya di jalan raja musa mahadi, yang sejajar dengan politeknik ungku omar dan rtm ipoh perak. masjid ini terletak lebih kurang 5km ke selatan bandaraya ipoh. dari pintu tol keluar (exit) simpang pulai, lebuhraya utara selatan plus, menuju ke bandaraya ipoh lebih kurang 8km."
  },
  "w0zqf2jprb": {
    "address": "Georgetown, Pulau Pinang, Malaysia 10050",
    "contact": "04-8282212",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.40652,
      "longitude": 100.301399
    },
    "name": "MASJID NEGERI PULAU PINANG",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "7a52dc99-1b02-4b15-a12b-a846e988b02f",
    "geohash": "w0zqf2jprb",
    "remarks": "Masjid Negeri Pulau Pinang dibina pada tahun 1979, terletak di Daerah Timur Laut. Masjid Negeri ditadbir oleh seorang Pegawai Hal Ehwal Islam dengan dibantu oleh pegawai-pegawai masjid dan kakitangan yang dilantik oleh pihak kerajaan. Negeri Pulau Pinang terbahagi kepada enam daerah pentadbiran agama.\r\n\r\nPembinaan masjid ini diilhamkan oleh Y.T.M. Tunku Abdul Rahman, bekas Perdana Menteri Malaysia, awal tahun 1968. Peranan aktif Y.T.M. di dalam meninggikan syiar Islam seperti mempeloporkan musabaqah membaca Al-Quran dalam tahun 1960, pembinaan masjid Negara pada tahun 1965 dan mengadakan berbagai-bagai rancangan dakwah Islamiah tidak dapat disangkal oleh segenap lapisan kaum muslimin di Malaysia malah di seluruh dunia. Untuk memenuhi hasrat gigih umat Islam di Pulau Pinang, Y.T.M. Tunku telah mengesyorkan sebuah Masjid Negeri perlu didirikan di negeri ini dengan jaminan sebanyak sejuta ringgit sebagai bantuan dari Kerajaan Persekutuan. Cadangan tersebut disambut baik oleh kerajaan negeri di bawah pimpinan Y.A.B. Ketua Menteri Pulau Pinang, Dr. Lim Chong Eu. Ia juga disokong dengan sepenuhnya oleh Allahyarham Tun Syed Sheh Shahbudin dan Allahyarham Tun Datuk Syed Sheh Al-Haj bin Syed Hassan Barakbah, bekas T.Y.T. Yang Di Pertua Negeri Pulau Pinang. Cadangan pembinaan itu juga diperkenan dan direstui oleh kebawah D.Y.M.M. Seri Paduka Baginda Yang Di Pertuan Agong selaku Ketua Agama bagi negeri Pulau Pinang.\r\n\r\nJawatankuasa Pembinaan Masjid Negeri ditubuhkan pada bulan Jun 1969. Jawatankuasa Pelupur tersebut di Pengerusikan oleh Datuk Haji Harun Sirat yang ketika itu menjawat jawatan Speaker Dewan Undangan Negeri dengan Datuk Haji Mohd. Sidek bin Elamdin yang ketika itu menjadi Setiausaha Sulit kepada T.Y.T. sebagai Setiausaha. Jawatankuasa Pembinaan Masjid Negeri telah memutuskan cara-cara pungutan derma daripada dermawan-dermawan Islam dan Bukan Islam, Badan-Badan Sukarela, Pertubuhan-pertubuhan, Badan Korporat serta Kakitangan Kerajaan yang beragama Islam dan bukan Islam.\r\n\r\nPada 4 Mac, 1971, pelan tapak dibentangkan dalam persidangan Majlis Kebangsan Hal Ehwal Agama dengan Y.T.M. Tunku sendiri mempengerusikan persidangan itu. Sementara itu Jawatan Pengerusi Jawatankuasa Pembinaan Masjid diambil alih oleh Allahyarham Datuk Haji Ahmad bin Haji Abdullah, Ahli Majlis Mesyuarat Kerajaan Negeri dan Pegawai Daerah Timur Laut, Encik Ismar bin Iskandar dilantik sebagai Setiausaha pada awal tahun 1973.",
    "source_musolla_id": "MY-07-TL-00001"
  },
  "w0zcusbjff": {
    "address": "Ipoh, Perak, Malaysia 31400",
    "contact": "05-3127180",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.553459,
      "longitude": 101.096314
    },
    "name": "MASJID RAJA DR. NAZRIN SHAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "95c247f7-d19a-492e-8690-7d2c5771b959",
    "geohash": "w0zcusbjff",
    "remarks": "Masjid ini berkonsepkan seni bina Afrika Selatan dan Timur Tengah. Namun begitu ia dibina lebih ringkas dengan hanya sebuah kubah sahaja di bahagian bumbungnya yang berbentuk rata dan tanpa dilengkapi dengan menara sebagaimana kebiasaan. Bangunan masjid ini dibina dua tingkat dengan menampakkan perbezaan ukuran kelebaran saiz antara tingkat atas dan bawah. Masjid ini dibina pada 17 Rabiulawal 1419 Hijri bersamaan 12 Jun 1998 Masihi. Perasmian masjid ini telah disempurnakan oleh Duli Yang Teramat Mulia Raja Muda Perak, Raja Dr. Nazrin Shah Ibni Sultan Azlan Muhibuddin Shah.",
    "source_musolla_id": "MY-08-IPH-00003",
    "provision": "-tempat wuduk\r\n-telekung\r\n-sejadah\r\n-bilik mesyuarat\r\n-bilik pegawai masjid\r\n-pejabat masjid\r\n-ruang makan\r\n-ruang memasak\r\n-parkir\r\n-tandas awam\r\n-tandas orang kurang upaya\r\n-kerusi orang kurang upaya\r\n-kawasan riadah",
    "directions": "-lokasi masjid terletak lebih kurang 3 km dari pekan gunung rapat\r\n-lokasi masjid terletak lebih kurang 8 km dari bandaraya ipoh\r\n-lokasi masjid juga terletak lebih  kurang 3 kilometer dari pengkaan tudm\r\n-jarak jalan besar gunung rapat dengan lokasi masjid adalah 4 km sahaja"
  },
  "w0zqg4p7bm": {
    "address": "Georgetown, Pulau Pinang, Malaysia 10050",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.416935,
      "longitude": 100.337118
    },
    "name": "MASJID KAPITAN KELING",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "874cc625-89ba-4733-8735-a29ef0672859",
    "geohash": "w0zqg4p7bm",
    "remarks": "Masjid ini dinamakan Masjid Kapitan Keling kerana tokoh yang terlibat dalam usaha membangunkannya iaitu Caudeer Mohudeen berasal daripada peranakan India Muslim yang dikenali sebagai Kapitan Keling. Masjid ini pada asalnya didirikan demi kemudahan kaum India Muslim yang datang berniaga dan menjadi buruh dengan Syarikat Hindia Timur lebih 200 tahun dahulu. Masjid ini kemudiannya telah diubahsuai dan diperbaiki pada tahun 1930-an.",
    "source_musolla_id": "MY-07-TL-00020"
  },
  "w0zqg4sxhm": {
    "address": "Chinatown, 10200 Georgetown, Pulau Pinang, Malaysia 10200",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.420239,
      "longitude": 100.333518
    },
    "name": "MASJID BENGGALI",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "5a07fc16-a706-442f-aa83-c0ef6684456e",
    "geohash": "w0zqg4sxhm",
    "remarks": "Orang-orang India dari Bengal mula berhijrah ke Pulau Pinang pada akhir abad ke-18 sebagai sepoi atau tahanan kepada Syarikat Hindia Timur. Francis Light telah memulakan kemasukan petani Bengal dari Calcutta untuk menggalakkan kemajuan pertanian di Pulau Pinang. Istilah ‘Bengali’ bukan sahaja merujuk kepada pendatang daripada Bengal tetapi telah digelar atau merujuk kepada pendatang lain yang turut berasal dari India Utara.      \n \nMereka ini yang kebanyakannya menganut agama Islam telah mendirikan masjid untuk berkumpul dan mengerjakan ibadah. Masjid ini yang kemudiannya terkenal dengan nama Masjid Benggali dipercayai diasaskan pada tahun 1803 Masihi di atas tapak yang diberikan oleh Syarikat Hindia Timur semasa George Leith menjadi Leftenan Gabenor Pulau Pinang. Pada ketika itu bahasa utama yang digunakan dalam aktiviti di masjid ini ialah Bahasa Urdu. Kini ia masih berfungsi sebagai sebuah pusat ibadah dan bahasa yang digunakan ialah Bahasa Melayu dan Tamil.",
    "source_musolla_id": "MY-07-TL-00014"
  },
  "w0zepuybsd": {
    "address": "Kampung Buaya, Perak, Malaysia 33700",
    "contact": "0125580383",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.772284,
      "longitude": 100.896923
    },
    "name": "MASJID AL - WAHIDIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "cb9f69b0-cb7e-49d4-b6fd-4819e44d42a1",
    "geohash": "w0zepuybsd",
    "remarks": "-sejarah pembinaan masjid ini bermula, bila masjid yang lama, masjid alang iskandar sudah tidak dapat menampung bilangan jemaah yang mendirikan jumaat semakin bertambah. secara kebetulan apabila pemegang tanah wakaf masjid dato' setia diraja meninggal dunia, tanah wakaf ini masih belum dipindah milik kepada jabatan hal ehwal agama islam negeri perak, maka waris-waris beliau telah menuntut tanah wakaf masjid ini sebagai tanah pusaka.\r\n\r\n- oleh sebab itu, kedudukan msjid lama mula tergugat, maka pihak ajk masjid telah memutuskan untuk mencari tapak masjid baru, dan al-marhum tuan hj abd wahid yang merupakan ketua kg dan imam masjid pada masa itu telah bermurah hati mewakafkan tanah beliau lot 2993 bersebelahan masjid lama untuk didirkan masjid baru.\r\n\r\n-pelbagai ikhtiar telah dilakukan untuk mencari peruntukan bagi membolehkan masjid baru dibina,permohonan telah dimajukan kepada yb hj mohd shaffie mat saman yang merupakan adun kawasan pada masa itu. peruntukan telah diperolehi sebanyak rm25000 daripada peruntukan kerajaan negeri perak. maka pembinaan mula berlaku di awal tahun 1975\r\n\r\nperistiwa penting juga berlaku di mana peruntukan diluluskan sebanyak rm50,000 pada awalnya, tetapi terpaksa dibahagi 2 kerana masjid kg lempor memerlukan keadaan yang sama.",
    "source_musolla_id": "MY-08-KK-00349",
    "provision": "-tempat wudhu\r\n-telekung\r\n-sejadah\r\n-bilik mesyuarat\r\n-bilik pegawai masjid\r\n-ruang makan\r\n-ruang memasak\r\n-parkir\r\n-tandas awam\r\n-kerusi orang kurang upaya\r\n-perpustakaan\r\n-ruang it\r\n-ruang bilik kuliah\r\n-rumah musafir\r\n-bazigo (pondok rehat)\r\n-kawasan riadah",
    "directions": "masjid ini terletak di tepi jalan antara bandar kuala kangsar dan padang rengas. disamping berhampiran jalan sisi melalui lebuh raya ke pantai timur. jarak antara bandar kuala kangsar dan padang rengas hanya 6 kilometer. dalam kawasan yang sama juga terletak masjid alng iskandar ( masjid bersejarah) yang menjadi tumpuan pelancong dan murid-murid sekolah."
  },
  "w0zes67dq3": {
    "address": "Kawasan Perusahaan Ringan Tupai, Tupai, Perak, Malaysia 34000",
    "contact": "0195452330",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.846736,
      "longitude": 100.738726
    },
    "name": "MASJID DAERAH TAIPING (KPG. JAMBU)",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "1fb52ff0-7b72-4546-98e9-a2aa3972702b",
    "geohash": "w0zes67dq3",
    "remarks": "masjid ini dibina pada tahun 1968 sebagai masjid melayu baru bandar taiping bagi menggantikan masjid melayu lama yang telah bertambah. ia terletak di atas sebidang tanah lot 2362 bandar taiping dengan keluasan tanah 4,0201 ekar. ianya dibina dengan kos rm500,000 daripada sumbangan kerajaan persekutuan, kerajaan negeri dan orang ramai.\r\n\r\nmasjid ini dirasmikan oleh dymm sultan perak sultan idris pada tahun 1972. pada tahun 1987 apabila kerajaan negeri hendak mewujudkan sebuah masjid daerah.masjid ini telah dipilih kerana ianya merupakan masjid yang tersebsar dan tercantik pada masa itu  dan nama masjid daerah kekal hingga sekarang. masjid ini telah digunakan untuk menunaikan solat jumaat dan solat hari raya oleh penduduk bandar taiping dan kawasan sekitarnya.",
    "source_musolla_id": "MY-08-TPG-00010",
    "provision": "-tempat wuduk\r\n-telekung\r\n-sejadah\r\n-bilik mesyuarat\r\n-bilik pegawai masjid\r\n-pejabat masjid\r\n-ruang makan\r\n-ruang memasak\r\n-parkir\r\n-kedai perniagaan\r\n-tandas awam\r\n-tandas orang kurang upaya\r\n-ruang bilik kuliah\r\n-pondok rehat\r\n-kawasan riadah",
    "directions": "masjid ini terletak di jalan kampung jambu berhadapan stesyen bas taiping berhampiran hotel legend inn dan bank cimb cawangan taiping dan tidak juah dari hotel taiping perdana."
  },
  "w0zqt3e9cv": {
    "address": "Bandar Baru Perda, Bukit Mertajam, Pulau Pinang, Malaysia 14000",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.3699,
      "longitude": 100.430916
    },
    "name": "MASJID DAERAH SEBERANG PERAI TENGAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "2adf185a-0576-411d-93b4-a5bcc6c55e07",
    "geohash": "w0zqt3e9cv",
    "source_musolla_id": "MY-07-SPT-00003"
  },
  "w0zr1gs9bd": {
    "address": "Tanjong Bungah, Pulau Pinang, Malaysia 11200",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.468761,
      "longitude": 100.278428
    },
    "name": "MASJID TANJONG BUNGA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "82cee373-acd7-4e13-8b24-ec20e376e1c2",
    "geohash": "w0zr1gs9bd",
    "remarks": "Masjid Tanjung Bunga ini merupakan antara masjid terapung yang terdapat di negara ini. Ia didirikan di atas tapak yang menganjur ke permukaan laut yang sebahagiannya telah ditambak. Kerja-kerja pembinaan masjid ini telah dimulakan pada 5 Syaaban 1424 Hijri bersamaan 1 Oktober 2003 Masihi dan diseliakan oleh Jabatan Kerja Raya.Konsep yang diutarakan pada masjid ini adalah konsep moden dan ilham keseluruhannya datang daripada pembinaan Masjid Putra, Putrajaya dan Masjid Tengku Tengah Zaharah, Kuala Terengganu.",
    "source_musolla_id": "MY-07-TL-00033"
  },
  "w0zq2e2b0u": {
    "address": "Mukim 6 Batu Hitam, Balik Pulau, Pulau Pinang, Malaysia 11000",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.335262,
      "longitude": 100.218357
    },
    "name": "MASJID KAMPONG PAYA SIMPANG 4 GENTING",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "8c3c23c1-5255-45de-80fc-c2571a3753e1",
    "geohash": "w0zq2e2b0u",
    "source_musolla_id": "MY-07-BD-00053"
  },
  "w0zqg1wt7y": {
    "address": "Georgetown, Pulau Pinang, Malaysia 10050",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.414449,
      "longitude": 100.336238
    },
    "name": "MASJID MELAYU",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "754ad6b6-0226-4630-8fa5-78d4ba11dee1",
    "geohash": "w0zqg1wt7y",
    "remarks": "Masjid Jamek Lebuh Acheh didirikan pada tahun 1808 Masihi oleh Tengku Syed Hussain al-Aidid, kerabat diraja Acheh, Sumatera Indonesia. Beliau telah membuka penempatan dan mendirikan masjid, rumah kediaman, deretan kedai dan pejabat urusan import eksport. Beliau telah berjaya menjadikan penempatan tersebut terkenal sebagai pusat pengajian ilmu Islam yang terawal di Pulau Pinang dan ia bertambah makmur pada akhir abad ke-19 dan pada awal abad ke -20. Pulau Pinang turut dikenali sebagai ‘Jeddah Kedua’ pada ketika itu, kerana menjadi tempat bakal jemaah haji berpusat dan berurusan sebelum berangkat menunaikan haji ke Mekah.\r\n\r\nMasjid Jamek ini dibina berpandukan konsep seni bina masyarakat Cina, terutama reka bentuk menaranya kerana tukang-tukangnya terdiri daripada kaum Cina. Reka bentuk dalamannya pula menonjolkan pengaruh daripada seni bina Moghul yang sinonim dengan kebanyakan bangunan masjid pada zaman itu.",
    "source_musolla_id": "MY-07-TL-00023"
  },
  "w0zq6w4bsd": {
    "address": "Mukim 13 Paya Terubong, Timur Laut, Pulau Pinang, Malaysia 11500",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.350441,
      "longitude": 100.309155
    },
    "name": "MASJID BATU UBAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "6a9b941d-e0b9-498b-a99d-2132cb11e706",
    "geohash": "w0zq6w4bsd",
    "remarks": "Masjid Batu Uban telah diasaskan oleh Tuan Haji Mohammad Saleh yang digelar Nakhoda Nan Intan pada tahun 1734. Nama sebenar beliau ialah Maharaja Nan Intan Ibni Al-Marhum Tengku Patih Nan Sebatang. Beliau berhijrah dari Minangkabau. Nakhoda Nan Intan berasal dari Kampung Buadi, Paya Kumboh, Pagar Ruyung, Sumatera. Nakhoda Nan Intan diketahui telah datang ke Pulau Pinang bersama tiga buah bahtera. Nakhoda Nan Intan singgah di Batu Uban, satu lagi bahtera singgah di Bayan Lepas (Nakhoda Bayan) dan bahtera ketiga singgah di Jelutong (Nakhoda Kecil). Ketiga-tiga nakhoda tersebut mempunyai talian persaudaraan.",
    "source_musolla_id": "MY-07-TL-00013"
  },
  "w0zq6qts6w": {
    "address": "Universiti Sains Malaysia, Gelugor, Pulau Pinang, Malaysia 11800",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.353854,
      "longitude": 100.301854
    },
    "name": "MASJID AL MALIK KHALID",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "3c704b29-257d-495a-830d-8187861361ac",
    "geohash": "w0zq6qts6w",
    "source_musolla_id": "MY-07-TL-00007"
  },
  "w0zrkzy99u": {
    "address": "Mukim 5, Kepala Batas, Pulau Pinang, Malaysia 13100",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.536016,
      "longitude": 100.413062
    },
    "name": "MASJID LAHAR KEPAR",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "4acb6706-7559-4684-85b7-0c935d7c1515",
    "geohash": "w0zrkzy99u",
    "source_musolla_id": "MY-07-KB-00105"
  },
  "w0zbb0we9m": {
    "address": "Bota, Perak, Malaysia 32600",
    "contact": "0195741984",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.353964,
      "longitude": 100.90742
    },
    "name": "MASJID JAMEK BOTA KANAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "56d12926-1785-4435-9118-428435411b4b",
    "geohash": "w0zbb0we9m",
    "remarks": "1. masjid asal di bota kanan ialah dimasjid lama diatas tapak wakaf bersendirian kira  1 km dari masjid baru\r\n2. masjid jamek juga atas waqaf bersendirian hj harun dan diwaqaf kepada maipk seluar 1 ekar",
    "source_musolla_id": "MY-08-SI-00139",
    "provision": "1. dilengkapkan dengan penghawa dingin sepenuhnya\r\n2. memiliki sebuah van jenazah",
    "directions": "1. lokasi di batu 10 jalan utama parit ke kg.gajah\r\n2.  terletak dipinggir pekan bota kanan"
  },
  "w0zrn2p9ut": {
    "address": "Mukim 13, Tasek Gelugor, Pulau Pinang, Malaysia 13310",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.449548,
      "longitude": 100.480472
    },
    "name": "MASJID JARAK ATAS",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "f19569b2-e01f-4535-bd9e-3972fda0909c",
    "geohash": "w0zrn2p9ut",
    "source_musolla_id": "MY-07-BTW-00073"
  },
  "w0zg10gpd2": {
    "address": "Sayong, Perak, Malaysia 33000",
    "contact": "0132560921",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.751502,
      "longitude": 100.946606
    },
    "name": "MASJID KOLEJ UNIVERSITI ISLAM SULTAN AZLAN SHAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "48ece5b5-9a87-4ba3-a81b-4f7810d043e8",
    "geohash": "w0zg10gpd2",
    "source_musolla_id": "MY-08-KK-00591"
  },
  "w0zg0xu6cz": {
    "address": "Taman Kuala Kangsar, Kota Lama Kiri, Perak, Malaysia 33000",
    "contact": "0124576004",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.789176,
      "longitude": 100.926331
    },
    "name": "MASJID RAUDHATUL JANNAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "299b94fe-44e6-4fff-92b6-0f65c477c8d2",
    "geohash": "w0zg0xu6cz",
    "remarks": "masjid taman kuala kangsar terletak lebih kurang 4 kilometer dari bandar kuala kangsar. lokasinya berhampiran dengan stesen keretapi dan hospital kuala kangsar, taman anggerik dan taman sheikh tahir\r\n\r\npada tahun 1998, ahli jawatnkuasa taman kuala kangsar telah berjaya menyiapkan sebuah surau bagi kegunaan penduduk islam taman kuala kangsar pada masa itu dengan anggaran kos pembinaan sebanyak rm27,000. soalt berjemaah 5 waktu telah didirikan di samping pelbagai lagi aktivit keagamaan yang melibatkan semua ahli kariah surau\r\n\r\npada 1hb januari 1990, jabatan agama islam negeri perak telah meluluskan surau taman kuala kangsar bagi mendirikan solat jumaat disebabkan halangan yang dihadapi oleh penduduk taman kuala kangsar terutamanya ketika melintasi laluan keretapi untuk pergi menunaikan solat jumaat di masjid ridzuaniah kuala kangsar. kelulusan ini telah memberi banyak kemudahan dan keselesaan  kepada penduduk taman kuala kangsar dan taman-taman sekitarnya.\r\n\r\npenambahan bilangan penduduk islam di taman kuala kangsar, taman anggerik dan taman sheikh tahir serta ditambah dengan pekerja-pekerja kilang berhampiran yang datang menunaikan solat jumaat menimbulkan situasi yang kurang selesa. justeru pihak ajk surau taman kuala kangsar telah menubuhkan satu jawatankuasa pembinaan masjid taman kuala kangsar yang diketuai oleh tuan hj mohd isa b jaafar, khusus untuk merangka dan bergerak ke arah membina sebuah masjid yang lebih besar dan sempurna bagi menampung keperluan penduduk taman kuala kangsar, taman anggerik dan taman sheikh tahir.\r\n\r\nhasil usaha jk pembinaan dan doa semua penduduk islam, kelulusan pembinaan sebuah masjid di tapak berkeluasan 0.821 hektar di lot 10308 telah diperolehi dengan peruntukan dari jabatan perdana menteri, putrajaya sebanyak rm900,000 disamping hasil derma dan sumbangan AJK dan orang ramai sebanyak rm86,000. pada tahun 2004, kerja-kerja pembinaan telah dilakukan dengan pemantauan pihak jabatan kerja raya.\r\n\r\ndengan jumlah rm968,000 tersebut, masjid taman kuala kangsar telah dapat disiapkan dan upacara penyerahannya telah dilakukan oleh jabatan kerja raya kepada pejabat agama daerah kuala kangsar pada 29 ogos 2005. sehubungan dengan itu, masjid taman kuala kangsar telah digunakan dengan rasminya pada 30 ogos 2005 dengan solat maghrib berjemaah dan diadakan majlis bacaan yassin dan tahlil sempena menaymbut hari kemerdekaan.\r\n\r\npada 16 september 2005, majlis pengisytiharan mendirikan solat jumaat di masjid taman kuala kangsar telah disempurnakan oleh us zamri b hashim dari jabatan mufti negeri perak. bermula daripada tarikh inilah masjid telah digunakan secara optimum oleh seluruh anak kariah. beberapa penambahbaikan telah dilakukan untuk meningkatkan kemudahan dan keselesaan para jemaah yang sentiasa bertambah dari masa ke semasa",
    "source_musolla_id": "MY-08-KK-00534",
    "directions": "lebih kurang 4 kilometer dari bandar kuala kangsar.berhampiran stesen keretapi dan hospital kuala kangsar."
  },
  "w0zg2vqz2n": {
    "address": "Kampung Beluru, Kota Lama Kiri, Perak, Malaysia 33010",
    "contact": "0195612790",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.820159,
      "longitude": 100.940675
    },
    "name": "MASJID AL - HUSAINI WAFA KG. BELURU",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "b41871d4-972d-4dad-b696-43dae4615684",
    "geohash": "w0zg2vqz2n",
    "remarks": "ada 2 buah masjid iaitu masjid lama didirikan sekitar tahun 1930 dan yang baru sekitar tahun 1997. masjid lama hanya digunakan pada hari raya puasa khas bagi jemaah wanita sebab jemaah ramai..sejarah pembinaan tiada dapat diceritakan sebab tiada orang lama yang boleh menceritakan peristiwa dahulu",
    "source_musolla_id": "MY-08-KK-00374",
    "provision": "-tempat wuduk\r\n-telekung\r\n-sejadah\r\n-bilik pegawai masjid\r\n-pejabat masjid\r\n-ruang makan\r\n-ruang memasak\r\n-parking\r\n-kedai perniagaan\r\n-tandas awam\r\n-perpustakaan"
  },
  "w0zu2v1z85": {
    "address": "Kampung Kuak, Durian Pipit, Perak, Malaysia 33400",
    "contact": "016-4071634",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.994592,
      "longitude": 100.93381
    },
    "name": "MASJID AN - NUR",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "e30b77ce-e15b-41f9-89e0-5cb8af87b7df",
    "geohash": "w0zu2v1z85",
    "remarks": "sebelum masjid ini dibina ahli kariah berjamaah waktu jumaat di surau kampung lata papan kuak. sekitar tahun 1950 ahli kariah merancang untuk membina masjid dan menubuhkan ajk pembinaan masjid.tindakan awal ialah membuat kutipan sumbangan dari ahli kariah dan mendapatkan tapak yang sesuai yang telah diwakafkan oleh ahli kariah dan telah digazetkan. mula dibina pada tahun 1954 dengan mendirikan tiang secara bergotong royong. kerja-kerja lain dilakukan oleh kontrak",
    "source_musolla_id": "MY-08-LG-00114",
    "provision": "-tempat wudhu\r\n-telekung\r\n-sejadah\r\n-bilik pegawai masjid\r\n-ruang makan\r\n-ruang memasak\r\n-parkir\r\n-tandas awam\r\n-kawasan riadah",
    "directions": "15km dari pekan lenggong dan berdekatan dengan jalan utama (jalan lama) lenggong ke kuala kangsar."
  },
  "w0zgfgmybh": {
    "address": "Pulau Kamiri, Perak, Malaysia 31120",
    "contact": "0195730076",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.896967,
      "longitude": 101.027193
    },
    "name": "MASJID ISMAILIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "827ec02a-ed2e-4ff2-98fc-f22336628f55",
    "geohash": "w0zgfgmybh",
    "source_musolla_id": "MY-08-KK-00364"
  },
  "w0zf78hsm5": {
    "address": "Taman Kledang Jaya, 30200 Ipoh, Perak, Malaysia 30200",
    "contact": "012-5127056",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.615006,
      "longitude": 101.05865
    },
    "name": "MASJID JAMEK TAMAN KELEDANG JAYA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "55f3973b-5d3b-425a-84e4-e878a953c777",
    "geohash": "w0zf78hsm5",
    "source_musolla_id": "MY-08-IPH-00191"
  },
  "w0zfhb1rru": {
    "address": "Hulu Kinta, Kinta, Perak, Malaysia 30010",
    "contact": "019-5599636",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.571583,
      "longitude": 101.109236
    },
    "name": "MASJID JAMEK KG. MELAYU",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "ffa2c5f1-5122-4ef7-b79e-ce254ea24899",
    "geohash": "w0zfhb1rru",
    "source_musolla_id": "MY-08-IPH-00180"
  },
  "w0zfj2fs53": {
    "address": "Hulu Kinta, Kinta, Perak, Malaysia 30010",
    "contact": "016-5211742",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.575127,
      "longitude": 101.13273
    },
    "name": "MASJID SOLATIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "5b54ac9f-b691-4ea5-82a8-9282b1135ed5",
    "geohash": "w0zfj2fs53",
    "remarks": "masjis solatiah bermula sebagai surau solatiah yang bertempat di sebuah rumah sewa diperisaran wira jaya barat 66, taman rapat setia baru ipoh pada tahun 1986\r\n\r\nkemudian sebuah bangunan surau yang tetap telah didirikan di persimpangan wira jaya barat 66 dengan persiran wira jaya barat 31, tamanrapat setia baru, ipoh.\r\n\r\nhasil dari kepesatan pertambahan penduduk, surau solatiah telah dinaiktaraf kepada surau diri jumaat dan solat jumaat pertamanya didirikan pada 27 november 1988.\r\n\r\nsurau diri jumaat ini kemudiannya dinaiktaraf lagi menjadi masjid solatiah oleh mesyuarat jawatankuasa syariah negeri perak kali ke 150 yangbersidang pada 6 november 2000. pengisytiharan solat jumaat pertamanya telah disempurnakan oleh ss dato' seri mufti negeri perak pada 23 februari 2001\r\n\r\nkepadatan penduduk terus meningkat dan menyebabkan sebuah bangunan naru masjid solatiah telah dibina di tapak yang sama dan bangunan baru ini telah siap dibina dan diserahkan kepada jawatankuasa kariah masjid pada 23 mei 2016. solat jumaat pertama di bangunan baru ini pada 10 jun 2016\r\n\r\nwalaupun bangunan baru masjid solatiah telah mula digunakan untuk solat jumaat namun bangunan lama masjid terus juga digunakan bersama untuk mendirikan solat jumaat kerana bilangan jemaah yang besar yang tidak dapat ditampung sepenuhnya oleh bangunan baru.",
    "source_musolla_id": "MY-08-IPH-00192",
    "provision": "-tempat wuduk\r\n-telekung\r\n-sejadah\r\n-bilik mesyuarat\r\n-bilik pegawai masjid\r\n-pejabat masjid\r\n-parkir\r\n-laluan orang kurang upaya\r\n-tandas awam\r\n-tandas orang kurang upaya\r\n-kerusi orang kurang upaya\r\n-perpustakaan\r\n-bilik pengurusan jenazah\r\n-kereta mpv\r\n-stor\r\n-dataran sembelihan ibadah qurban",
    "directions": "masjid ini berada lebih kurang  :\r\n10 km dari pusat bandaraya ipoh\r\n4 km dari kampus politeknik ungku omar\r\n3 km dari plaza tol ipoh selatan"
  },
  "w0zcgrm7xe": {
    "address": "Hulu Kinta, Kinta, Perak, Malaysia 30010",
    "contact": "019-5454492",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.566814,
      "longitude": 101.0488
    },
    "name": "MASJID MENGLEMBU",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "49f29bd6-17a7-450d-9778-09e9e693a7fb",
    "geohash": "w0zcgrm7xe",
    "source_musolla_id": "MY-08-IPH-00184"
  },
  "w0zcgzw5pd": {
    "address": "Ipoh, Perak, Malaysia 31400",
    "contact": "012-4576183",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.568095,
      "longitude": 101.071799
    },
    "name": "MASJID AL ABIDIN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "b8290ccf-c0b3-41fe-a538-fb2fc9980c30",
    "geohash": "w0zcgzw5pd",
    "source_musolla_id": "MY-08-IPH-00556"
  },
  "w0zcgywjsn": {
    "address": "Ipoh, Perak, Malaysia 31400",
    "contact": "017-5994692",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.563053,
      "longitude": 101.071648
    },
    "name": "MASJID KG. PASIR PUTEH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "97fa5a69-fba6-4b82-a668-cbbbf47b81be",
    "geohash": "w0zcgywjsn",
    "source_musolla_id": "MY-08-IPH-00181"
  },
  "w0zcgy922u": {
    "address": "Ipoh, Perak, Malaysia 31400",
    "contact": "019-5428386",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.562138,
      "longitude": 101.064991
    },
    "name": "MASJID JAMEK AD-DINIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "441277fc-2fc0-44af-9ba3-53538dbea8bf",
    "geohash": "w0zcgy922u",
    "source_musolla_id": "MY-08-IPH-00175"
  },
  "w0zfjwfhjz": {
    "address": "Ipoh, Perak, Malaysia 31400",
    "contact": "012-4347628",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.608116,
      "longitude": 101.143139
    },
    "name": "MASJID  AL - AMIN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "653ef4f8-0206-412d-bfb8-47c6aab0a019",
    "geohash": "w0zfjwfhjz",
    "source_musolla_id": "MY-08-IPH-00176"
  },
  "w0zfk0tdrb": {
    "address": "Hulu Kinta, Kinta, Perak, Malaysia 30010",
    "contact": "019-5647577",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.617391,
      "longitude": 101.082109
    },
    "name": "MASJID AL -AULIA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "629b1b8e-b290-473f-a935-e1626f0c6b97",
    "geohash": "w0zfk0tdrb",
    "source_musolla_id": "MY-08-IPH-00161"
  },
  "w0zes62xhm": {
    "address": "Taiping, Perak, Malaysia 34000",
    "contact": "0194273596",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.847573,
      "longitude": 100.734519
    },
    "name": "MASJID INDIA JALAN KOTA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "5edba2e2-285a-42e0-8c90-fcbc9ee8f09d",
    "geohash": "w0zes62xhm",
    "source_musolla_id": "MY-08-TPG-00012"
  },
  "w0zrm5zwz3": {
    "address": "Mukim 6, Seberang Perai Utara, Pulau Pinang, Malaysia 13300",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.514928,
      "longitude": 100.42566
    },
    "name": "MASJID KEPALA BATAS ( JAMIUL-BADAWI)",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "1cf67736-4593-4262-9cb8-f6e276faa5be",
    "geohash": "w0zrm5zwz3",
    "source_musolla_id": "MY-07-KB-00100"
  },
  "w0zuc7wfgn": {
    "address": "Kampung Banggol Belimbing, Temelong, Perak, Malaysia 33400",
    "contact": "05-7677554",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.073442,
      "longitude": 100.96277
    },
    "name": "MASJID YAHAYA UBUDIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "f4a30d7e-c161-4f2a-a3c3-81b2d2a887d7",
    "geohash": "w0zuc7wfgn",
    "source_musolla_id": "MY-08-LG-00122",
    "provision": "-tempat wuduk\r\n-telekung\r\n-sejadah\r\n-bilik mesyuarat\r\n-bilik pegawai masjid\r\n-ruang makan\r\n-ruang memasak\r\n-parkir\r\n-tandas awam\r\n-kELAS PENGAJIAN AL-QURAN",
    "directions": "kedudukan masjid berhampiran jalan utama dan berhampiran dengan muzium arkeologi kota tampan dan 5km daripada pekan lenggong"
  },
  "w0zg1hexn9": {
    "address": "33000 Sayong, Perak, Malaysia 33000",
    "contact": "0175322181",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.772024,
      "longitude": 100.947478
    },
    "name": "MASJID KHAIRIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "21837e54-b35b-442e-ad41-1dfcdd953800",
    "geohash": "w0zg1hexn9",
    "source_musolla_id": "MY-08-KK-00386"
  },
  "w0zw80evxq": {
    "address": "Kulim, Kedah, Malaysia 09000",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.365053,
      "longitude": 100.552339
    },
    "name": "AL-JAMIUL MAKMUR pekan kulim",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "33986b23-8b81-4404-9bcb-77c2a4651f89",
    "geohash": "w0zw80evxq",
    "source_musolla_id": "MY-02-KLM-00351"
  },
  "w0zrpzncju": {
    "address": "Kampung Permatang Tok Din, 09400 Naga Lilit, Kedah, Malaysia 09400",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.487866,
      "longitude": 100.545412
    },
    "name": "ABD. HALIM MUADZAM SHAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "3b396256-3625-4abb-881c-af5177b63038",
    "geohash": "w0zrpzncju",
    "source_musolla_id": "MY-02-KLM-00356"
  },
  "w0zwfk0uuw": {
    "address": "Kampung Sungai Kob, Karangan, Kedah, Malaysia 09700",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.428099,
      "longitude": 100.646979
    },
    "name": "JAMEK AL-ITTIHAD SUNGAI KOB",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "7bfd991e-a13e-4315-bfeb-cc749ff8ad8c",
    "geohash": "w0zwfk0uuw",
    "remarks": "Sejarah awal penubuhan Masjid Sungai Kob bermula seawal tahun 30an abad ke-18 oleh orang-orang Petani diketuai Penghulu Musa, Mereka datang untuk menangkap gajah-gajah liar, dijinakkan dan dijadikan sebagai kenderaan, menarik balak dan mengangkut bahan hutan berulang alik antara Sungai Kob ke Mahang. Majid Jamek Al-Ittihad yang baru ini adalah yang ke-3 dibina diatas tapak asal, diatas lot 1601 ditambah lot 550 dan 551 mukim Karangan, keluasan termasuk tapak perkuburan 8564 2M Per. Lot 550dan 551 bekas tapak sekolah Melayu Sungai Kob. Tarikh mula dibina 12  Disember 1987 siap pada 10 Julai 1989, dengan kos pembinaan berjumlah RM322000.00. Anak -anak kariah mula bersolat Jumaat pada 25/ 12/ 1409H bersamaan 28/ 7/ 1989M, Imam pertama bertugas Tuan Haji Salleh bin Haji Abdullah. Pada 21 Safar 1421H/ 24 Mei 2000, Jam 12.30 tengahari hari khamis masjid ini telagh dirasmikan pembukaannya oleh KDYMM Tuanku Sultan Abdul Halim Muadzam Shah Ibni Al Marhum Sultan Badlishah.",
    "source_musolla_id": "MY-02-KLM-00364",
    "provision": "1. Dewan Syarahan\n2. Bilik Kuliah\n3. Pejabat Masjid\n4. Papan Tanda Masjid\n5. Papan Kenyataan\n6. Tempat Letak Kenderaan\n7. Dewan Makan \n8. Stor/dapur\n9. Bilik Mesyuarat\n10. Tandas\n11. Bilik Mandi\n12. Komputer\n13. Tempat Wuduk\n14. Khat\n15. Permaidani\n16. Papan Tanda Waktu Solat\n17. Pakaian Solat\n17. Pakaian Solat            \n18. Dewan Syarahan"
  },
  "w0zx3s97n3": {
    "address": "Padang Meha, Kedah, Malaysia 09400",
    "contact": "0194367237",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.518408,
      "longitude": 100.614786
    },
    "name": "NURUL EHSAN SUNGAI KARANGAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "79029268-35f8-4580-a0e3-f052014d3e58",
    "geohash": "w0zx3s97n3",
    "source_musolla_id": "MY-02-KLM-00363",
    "provision": "1. Alat Pandang Dengar\r\n2. Papan tanda Masjid\r\n3. Papan Iklan/Kenyataan\r\n4. Tempat Letak Kenderaan\r\n5. Dewan Makan \r\n6. Stor/Dapur\r\n7. Tandas\r\n8. Bilik Mandi\r\n9. Komputer \r\n10. Tempat Wuduk\r\n11. Pintu Gerbang\r\n12. Permaidani\r\n13. Lampu Antik \r\n14. Wakaf\r\n15. Pakaian Solat"
  },
  "w0zw8m7mrb": {
    "address": "Lunas, Kedah, Malaysia 09600",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.391073,
      "longitude": 100.5626632
    },
    "name": "AL HUDA KELANG LAMA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "811ef5af-4cfa-432d-9344-ebacf095c07f",
    "geohash": "w0zw8m7mrb",
    "remarks": "Mengikut sejarah, masjid pertama dibina sekitar tahun 1940 an di atas tanah wakaf keluarga Tuan Haji Said Bin Saras. Masjid dibina dari bahan kayu dengan kolah (tempat wuduk) dibuat diatas tanah merupakan telaga yang digali diatas tanah (perkuburan) disebelah tepi jalan raya utama Lunas (air mata air masih wujud sehingga sekarang dan perlu dialirkan keluar untuk dijadikan tanah perkuburan yang selesa). \n\nSekitar tahun 1970 an, masjid ini dibina semula. Perletakan batu asas telah dibuat oleh Mantan MB iaitu Dato Seri Syed Ahmad Shahabudin pada 26 oktober 1971.\n\nSetelah siap masjid dirasmikan oleh Mantan Y.A.B Perdana Menteri Kedua iaitu Tun Haji Abd Razak Bin Hussin pada 10 November 1973 (ketika itu DYMM Sultan Kedah adalah Yang Dipertuan Agung). \n\nSekitar tahun 1990 (23 Julai 1990 bersamaan 1 Muharram 1424) Masjid ini telah dianugerahkan masjid terbaik Kategori A Negeri Kedah semasa Tuan Haji Ismail menjawat  jawatan imam. Pihak masjid juga menggunakan sumbangan dana anak kariah untuk membeli sebuah rumah kedai dua tingkat dan disewakan kepada pihak Darus Syifa Kulim.\n\nSekitar Jun 2003 masjid ini sekali lagi dianugerahkan masjid terbaik Kategori bandar peringkat negeri Kedah sempena tahun hijrah 1424 H/2003 oleh Kebawah Duli Yang Maha Mulia Tuanku Sultan Kedah.Tuan imam pada masa itu adalah Tuan Haji Ibrahim Bin Teh.Untuk keselesaan masjid ini telah membeli sebuah rumah(kepunyaan seorang bukan islam) berhampiran masjid beserta tanah pada tahun 1993.Rumah ini dijadikan rumah pegawai (sekarang didiami oleh Siak masjid).\n\nPada tahun 2010 pihak Kementerian Pendidikan Malaysia telah menyalurkan peruntukan kewangan sebanyak RM 180 000 untuk membina bangunan kafa. Melalui tender terbuka sebuah bangunan 4 bilik darjah telah dibina dan mula digunakan untuk kelas kafa pada tahun 2011. \n \nPihak masjid juga dalam proses menyelesaikan pembayaran tanah wakaf untuk dijadikan tanah perkuburan dan lain-lain.\n\nPada 3 Ogos 2014, pihak masjid telah berjaya menubuhkan Koperasi Kariah Masjid Al Huda untuk memudahkan anak kariah berurusan dalam muamalat/barangan kegunaan harian.",
    "source_musolla_id": "MY-02-KLM-00354",
    "provision": "1. Telefon Masjid\n2. Telefon Awam\n3. Taman Rekreasi\n4. Air Pancutan\n5. Rumah Siak\n6. Pintu Gerbang\n7. Lampu Antik"
  },
  "w0zw8f99nq": {
    "address": "Sungai Ular, Kedah, Malaysia 09000",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.375267,
      "longitude": 100.582164
    },
    "name": "AL-FURQAN sungai ular",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "4e831211-8f79-4653-9161-798284057722",
    "geohash": "w0zw8f99nq",
    "source_musolla_id": "MY-02-KLM-00371"
  },
  "w0zx0huktq": {
    "address": "Kampung Naga Lilit, Naga Lilit, Kedah, Malaysia 09400",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.476121,
      "longitude": 100.552945
    },
    "name": "JANNATUL MA'WA nagalilit",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "508a74a6-9339-46a3-bf15-1c542e8306e7",
    "geohash": "w0zx0huktq",
    "source_musolla_id": "MY-02-KLM-00357"
  },
  "w0zwe2kn2p": {
    "address": "FELDA Gunung Bongsu, 09700 Karangan, Kedah, Malaysia 09700",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.363814,
      "longitude": 100.695201
    },
    "name": "NURUL IMAN felda gunung bongsu",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "a514275c-6336-49e7-bb48-734dfb123f43",
    "geohash": "w0zwe2kn2p",
    "source_musolla_id": "MY-02-KLM-00374",
    "provision": "1. Bilik kuliah \r\n2. Bilik Jenazah\r\n3. Alat Pandang Dengar\r\n4. Telefon Masjid \r\n5. Telefon Awam\r\n6. Taman Rekreasi\r\n7. Dewan Makan\r\n8. Bilik Mesyuarat\r\n9. Tempat Letak Kasut\r\n10. Rumah Bilal\r\n11. Rumah Siak \r\n12. Pintu Gerbang\r\n13. Khat\r\n14. Air Pancutan\r\n15. Wakaf\r\n16. Bilik Musafir"
  },
  "w0zrrzr4qp": {
    "address": "Kampung Guar Lobak, Sidam Kanan, Kedah, Malaysia 09400",
    "contact": "04-4851182",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.533417,
      "longitude": 100.545769
    },
    "name": "JAMEK DARUL AMAN guar lobak",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "ff0ff29e-97ea-4187-a199-e23c71ca7381",
    "geohash": "w0zrrzr4qp",
    "source_musolla_id": "MY-02-KLM-00361"
  },
  "w0zwbpgf6n": {
    "address": "09600 Sungai Seluang, Kedah, Malaysia 09600",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.448266,
      "longitude": 100.552119
    },
    "name": "AL MUHTADIN sungai seluang",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "90262e1c-d47a-41a1-909d-b9fc2d7474f8",
    "geohash": "w0zwbpgf6n",
    "source_musolla_id": "MY-02-KLM-00358"
  },
  "w0zqzcgj6t": {
    "address": "Jalan Lunas, Taman Seri Seladang, 09600 Lunas, Kedah, Malaysia 09600",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.415819,
      "longitude": 100.540125
    },
    "name": "TUNKU ABDUR  RAHMAN PUTRA SUNGAI LIMAU",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "2c1e2329-379b-4e6e-b3f7-58e877c8ebed",
    "geohash": "w0zqzcgj6t",
    "remarks": "Qaryah Sungai Limau wujud pada 1930. Binaan Masjid Qaryah Sungai Limau pada 1930. Dirasmikan pada 1972. Dirasmikan oleh Perdana Menteri Malaysia Pertama YTM Allahyarham Tunku Abdurrahman Putra Al-Haj.",
    "source_musolla_id": "MY-02-KLM-00355",
    "provision": "1. Pejabat Masjid\n2. Papan Tanda Nama Masjid\n3. Papan Kenyataan/Iklan\n4. Bilik Mesyuarat\n5. Tandas \n6. Perpustakaan\n7. Bilik Mandi\n8. Komputer\n9. Tempat Wuduk\n10. Permaidani \n11. Papan Tanda waktu Solat\n12. Air Pancutan \n13. Wakaf\n14. Pakaian Solat"
  },
  "w0zg30d29b": {
    "address": "Kota Lama Kiri, Perak, Malaysia 33000",
    "contact": "0194455455",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.792872,
      "longitude": 100.945557
    },
    "name": "MASJID HIDAYATUL UMMAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "13b2d324-f380-4d54-9e47-cc9fe224d18f",
    "geohash": "w0zg30d29b",
    "source_musolla_id": "MY-08-KK-00388",
    "provision": "-tempat wuduk\r\n-telekung\r\n-sejadah\r\n-bilik pegawai masjid\r\n-ruang makan\r\n-parkir\r\n-tandas awam\r\n-kawasan riadah",
    "directions": "-masjid hidayatul ummah hanya lebih kurang 5-6 kilometer dari bandar diraja kuala kangsar, perak.ianya juga terletak dalam kawasan tempat bersejrah di kuala kangsar seperti kubur tok temong, masjid kota lama kanan, uktoria bridge dan lain-lain"
  },
  "w0z81fxyqg": {
    "address": "Lumut, Perak, Malaysia 32200",
    "contact": "0175158122",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.233576,
      "longitude": 100.634718
    },
    "name": "MASJID AL ADLY",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "21b39c73-1dc7-48ff-926e-7e33042d8c93",
    "geohash": "w0z81fxyqg",
    "source_musolla_id": "MY-08-MJG-00016"
  },
  "w0zmw4nrbr": {
    "address": "Mukim 11, Seberang Perai Selatan, Pulau Pinang, Malaysia 14300",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.197902,
      "longitude": 100.467588
    },
    "name": "MASJID CHANGKAT",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "cd53662f-e8a1-4d72-8772-c63762f0542c",
    "geohash": "w0zmw4nrbr",
    "source_musolla_id": "MY-07-SPS-00136"
  },
  "w0zbb0nk9e": {
    "address": "Bota, Perak, Malaysia 32600",
    "contact": "019 5739653",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.351375,
      "longitude": 100.907088
    },
    "name": "MASJID RAISIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "be9322c7-5055-4061-8e3c-15fab01d6f3f",
    "geohash": "w0zbb0nk9e",
    "remarks": "1. DIDIRIKAN SEMULA DITAPAK ASAL YANG DIWAQAF OLEH INDIVIDU. BERUPA BANGUNAN SEKERAT BATU DAN PAPAN\r\n2. BANGUNAN BARU MASJID BARU ATAS SUMABANGAN KELUARGA CIKGU SHAHARUDDIN DIREKA BENTUK OLEH KELUARGA TERSEBUT",
    "source_musolla_id": "MY-08-SI-00149",
    "provision": "1. DIBEKALKAN PENGHAWA DINGIN\r\n2. SEKOLAH AGAMA RAKYAT",
    "directions": "1. TEPI JALAN KM 15 JALAN UTAMA PARIT - BOTA"
  },
  "w0z9eq8pbx": {
    "address": "Jalan Damar Laut-Changkat Jering, Kampung Padang Serai, 32700 Pengkalan Baharu, Perak, Malaysia 32700",
    "contact": "0195704568",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.519498,
      "longitude": 100.689725
    },
    "name": "MASJID EHSANIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "1e1ee170-57d8-441c-a631-6412a4454219",
    "geohash": "w0z9eq8pbx",
    "remarks": "pada tahun 1950an penduduk kampung padang serai. matang aceh dan batu hampar bergotong rotong mencari kayu dihutan untuk membuat masjid pertengahan tahun 70an dengan ihsan penduduk qariah masjid pantai remis bersetuju memberi masjid lama kepada kampung padang serai untuk menggantikan masjid yang sangat daif, dari masa itulah masjid kg padang serai dinamakan masjid ehsaniah.pada tahun 1998 masjid baru telah didirikan dengan peruntukan kerajaan persekutuan sebanyak rm600,000",
    "source_musolla_id": "MY-08-MJG-00036",
    "provision": "-tempat wuduk\r\n-telekung\r\n-sejadah\r\n-bilik pegawai masjid\r\n-ruang makan\r\n-ruang masak\r\n-parkir\r\n-laluan orang kurang upaya\r\n-tandas awam",
    "directions": "dari beruas 15km\r\ndari pantai remis 12km"
  },
  "w0zmurjgeg": {
    "address": "Mukim 16, Pulau Pinang, Malaysia 14100",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.268566,
      "longitude": 100.390148
    },
    "name": "MASJID PULAU AMAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "711b6ef6-429e-4be7-92e0-9328076a615d",
    "geohash": "w0zmurjgeg",
    "source_musolla_id": "MY-07-SPS-00143"
  },
  "w0zqsu8h4e": {
    "address": "Taman Tenggiri, Seberang Jaya, Pulau Pinang, Malaysia 13700",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.386752,
      "longitude": 100.404164
    },
    "name": "MASJID SEBERANG JAYA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "3ca0a9d6-6527-4b9e-af18-8e0fb8ad49cd",
    "geohash": "w0zqsu8h4e",
    "source_musolla_id": "MY-07-SPT-00191"
  },
  "w0zquxbczs": {
    "address": "Mukim 9, Butterworth, Pulau Pinang, Malaysia 13050",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.44817,
      "longitude": 100.394426
    },
    "name": "MASJID SUNGAI PUYU",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "1d62d221-0c19-4715-b0eb-5d22f651e321",
    "geohash": "w0zquxbczs",
    "source_musolla_id": "MY-07-BTW-00088"
  },
  "w0zqu1dbz6": {
    "address": "Taman Melur, 12200 Butterworth, Pulau Pinang, Malaysia 12200",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.413657,
      "longitude": 100.375182
    },
    "name": "MASJID TELAGA AIR",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "4204e0c0-02d4-438c-8361-3d250fb448da",
    "geohash": "w0zqu1dbz6",
    "source_musolla_id": "MY-07-BTW-00089"
  },
  "w0zrhr1pw9": {
    "address": "Mukim 7, Butterworth, Pulau Pinang, Malaysia 13050",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.488965,
      "longitude": 100.383733
    },
    "name": "MASJID TELOK AIR TAWAR",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "0956a9d4-d83c-4992-85b2-d0451755f857",
    "geohash": "w0zrhr1pw9",
    "source_musolla_id": "MY-07-BTW-00090"
  },
  "w0zq23kt3q": {
    "address": "Mukim J Dataran Genting, Balik Pulau, Pulau Pinang, Malaysia 11000",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.325187,
      "longitude": 100.212533
    },
    "name": "MASJID KAMPONG TERANG",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "815db6a4-883c-4884-9c9b-ad4066211123",
    "geohash": "w0zq23kt3q",
    "source_musolla_id": "MY-07-BD-00047"
  },
  "w0zq1kntvd": {
    "address": "Jalan Dato Ismail Hashim, Kampung Masjid, 11900 Bayan Lepas, Pulau Pinang, Malaysia 11900",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.29641,
      "longitude": 100.259414
    },
    "name": "MASJIDAL HIDAYAH  BAYAN LEPAS",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "56544d68-34f0-4b4a-9386-169b000635ef",
    "geohash": "w0zq1kntvd",
    "source_musolla_id": "MY-07-BD-00042"
  },
  "w0zq165dq1": {
    "address": "Kampung Binjai, Bayan Lepas, Pulau Pinang, Malaysia 11960",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.284816,
      "longitude": 100.255317
    },
    "name": "MASJID KAMPONG BINJAI",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "24838bce-fd8c-48a5-b428-92b4416262cc",
    "geohash": "w0zq165dq1",
    "source_musolla_id": "MY-07-BD-00043"
  },
  "w0zmjtkcz6": {
    "address": "Bagan Tiang, Perak, Malaysia 34250",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.126811,
      "longitude": 100.443853
    },
    "name": "MASJID BATU 3",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "6c4315b4-e694-4298-bc31-dc780f4b80d4",
    "geohash": "w0zmjtkcz6",
    "source_musolla_id": "MY-07-SPS-00134"
  },
  "w0zqj8j7mk": {
    "address": "Mukim 14, Simpang Ampat, Pulau Pinang, Malaysia 14100",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.274018,
      "longitude": 100.444454
    },
    "name": "MASJID BUKIT TAMBUN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "bedeab69-aad7-4c78-ae6a-378cdb02efcf",
    "geohash": "w0zqj8j7mk",
    "source_musolla_id": "MY-07-SPS-00135"
  },
  "w0zqj22gkx": {
    "address": "Simpang Ampat, Pulau Pinang, Malaysia 14100",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.275407,
      "longitude": 100.427259
    },
    "name": "MASJID KAMPONG BATU KAWAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "bbd5368b-f2c4-44a7-9949-616e03a36ffa",
    "geohash": "w0zqj22gkx",
    "source_musolla_id": "MY-07-SPS-00137"
  },
  "w0z91z1mex": {
    "address": "Pengkalan Baharu, Perak, Malaysia 34900",
    "contact": "0142551050",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.43397,
      "longitude": 100.625649
    },
    "name": "MASJID AL KHAIRIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "a96e656b-fe0c-4503-b0b6-5627e4223cce",
    "geohash": "w0z91z1mex",
    "source_musolla_id": "MY-08-MJG-00023"
  },
  "w0z9mrq41k": {
    "address": "Beruas, Perak, Malaysia 32700",
    "contact": "0174989517",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.478667,
      "longitude": 100.785885
    },
    "name": "MASJID AS SAADAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "549593a1-9bf8-4cdd-a61f-a41414e6abe7",
    "geohash": "w0z9mrq41k",
    "source_musolla_id": "MY-08-MJG-00032"
  },
  "w0z9j2md7k": {
    "address": "Beruas, Perak, Malaysia 32700",
    "contact": "0125629154",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.396316,
      "longitude": 100.785287
    },
    "name": "MASJID DARUL NAIM",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "74aab5af-1fcf-4b64-bbe7-350d81ddca69",
    "geohash": "w0z9j2md7k",
    "source_musolla_id": "MY-08-MJG-00035"
  },
  "w0z8677qk0": {
    "address": "Lumut, Perak, Malaysia 32200",
    "contact": "0125071603",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.281621,
      "longitude": 100.650387
    },
    "name": "MASJID NURUL TAKZIM",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "b0b2f714-e967-4a8e-b77c-8dd0648c608e",
    "geohash": "w0z8677qk0",
    "source_musolla_id": "MY-08-MJG-00043"
  },
  "w0zc70srm2": {
    "address": "Sungai Terap, Perak, Malaysia 31000",
    "contact": "0135212134",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.442473,
      "longitude": 101.036339
    },
    "name": "MASJID AL-KHAIRIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "6d5a31af-7e8d-4248-9642-d68d070e9832",
    "geohash": "w0zc70srm2",
    "source_musolla_id": "MY-08-BG-00562"
  },
  "w0z9drtwpv": {
    "address": "Jalan Pantai Remis-Taiping, 34900 Pengkalan Baharu, Perak, Malaysia 34900",
    "contact": "0175092273",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.524682,
      "longitude": 100.653645
    },
    "name": "MASJID HASSANIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "bae58ba3-f10a-4469-bca5-7415500a37a5",
    "geohash": "w0z9drtwpv",
    "remarks": "pembinaan awal semua usaha secara gotong royong serta bantuan dari kapung yang berhampiran. dan semasa ubahsuai bangunan juga 1961 juga secara bergotong royong penambakan tapak masjid dengan tanah berpasir menggunakan angkut dengan oleh orang kmpung. ketika itu jalan raya panchor masih jalan 12 kaki jalan batu belum diletak tar.",
    "source_musolla_id": "MY-08-MJG-00037",
    "provision": "-tempat wuduk\r\n-telekung\r\n-sejadah\r\n-bilik mesyuarat\r\n-ruang memasak\r\n-parkir\r\n-tandas awam\r\n-kerusi orang kurang upaya\r\n-pondok rehat",
    "directions": "Lokasi bangunan masjid ada lah ditepi jalan raya yang menghubungkan Pantai Remis dan Bandar Taiping"
  },
  "w0z853t8xc": {
    "address": "Jalan Utama Kampung Serdang, Kampung Serdang, 32000 Sitiawan, Perak, Malaysia 32000",
    "contact": "0195697175",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.227085,
      "longitude": 100.697585
    },
    "name": "MASJID MAHMUDIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "7966eb41-b0b0-4ca0-8ece-182c78083692",
    "geohash": "w0z853t8xc",
    "remarks": "masjid ini bermula daripada sebuah surau yang didirkan pada tahun 1997 menggantikan surau lama yang diperbuat daripada kayu yang berusia kira-kira 3o tahun. dirasmikan pada 17 ogos 1997 oleh yb dato muhamad wajdi b datohaji ishak adun pangkor sebagai sebuah surau yang baru.dinaiktaraf sebagai masjid pada 18 april 2008.",
    "source_musolla_id": "MY-08-MJG-00585",
    "provision": "-tempat wuduk\r\n-telekung\r\n-sejadah\r\n-bilik pegawai masjid\r\n-ruang makan\r\n-ruang memasak\r\n-parkir\r\n-tandas awam\r\n-kerusi orang kurang upaya",
    "directions": "-terletak di jalan utama kampung serdang\r\n-jarak dari bandar berhampiran ialah 2km"
  },
  "w0z9w42edz": {
    "address": "Beruas, Perak, Malaysia 32700",
    "contact": "0135282789",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.49542,
      "longitude": 100.811355
    },
    "name": "MASJID KHAIRUL HUDA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "4bda432d-9a66-43ce-b292-cc2ccc273bd3",
    "geohash": "w0z9w42edz",
    "remarks": "1. Masjid Kg. Dendang di bina kali pertama diatas tapak yang ada sekarang ini pada tahun 1950.\r\n  2. Tapak ini telah diwakafkan oleh pemilik tanah yang bernama Ngah Ahmad, Lot no. 2320 seluas 0.2625 ekar.\r\n  3. Sebelum dijadikan tapak masjid, tapak ini merupakan tapak surau pertama di Kampung Dendang yang kemudian diwakafkan sebagai \r\n      tapak masjid ini dipernamakan atas nama 3 orang iaitu:\r\n     a. En. Ahmad bin Mat Yasin(Kadhi Lumut)\r\n     b. En. Ali Am bin Darban(Penghulu Mukim Beruas)\r\n     c. En. Mohd. Salleh bin Abd. Manaf(Ketua Kampung Dendang",
    "source_musolla_id": "MY-08-MJG-00041",
    "provision": "1. Bilik Mesyuarat\r\n        2. Penghawa Dingin\r\n        3. Ruang Solat Muslimah\r\n        4. Balai Lintang untuk jamuan makan\r\n        5. Kolah untuk mengambil wudhuk \r\n        6. Bilik Kuliah Muslimah\r\n        7. Ruang untuk laungan azan \r\n        8. Bilik khas Imam\r\n        9. Kedai gunting rambut\r\n       10.Tandas berasingan unrtuk lelaki dan perempuan",
    "directions": "1. Kedudukan dilaluan utama Beruas-Kuala Kangsar-Ipoh"
  },
  "w0z8gjukpu": {
    "address": "Pengkalan Baharu, Perak, Malaysia 34900",
    "contact": "0177455425",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.38288,
      "longitude": 100.684887
    },
    "name": "MASJID SULTAN IDRIS SHAH 1",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "ff941615-192a-4205-ba34-ee2453a852f9",
    "geohash": "w0z8gjukpu",
    "source_musolla_id": "MY-08-MJG-00050"
  },
  "w0z8ddy7gg": {
    "address": "Kampung Telaga Nenas, Lumut, Perak, Malaysia 32400",
    "contact": "0129037891",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.322411,
      "longitude": 100.665491
    },
    "name": "MASJID POROYAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "9d6a0ac7-acad-4b72-900e-9bbcef5f75e1",
    "geohash": "w0z8ddy7gg",
    "source_musolla_id": "MY-08-MJG-00047"
  },
  "w0z9w35b25": {
    "address": "Kampung Pintu Gerbang, Beruas, Perak, Malaysia 32700",
    "contact": "0135314453",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.487978,
      "longitude": 100.826689
    },
    "name": "MASJID AT TAUFIQIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "a531117c-292a-42f8-a2ed-5bc49b0922e8",
    "geohash": "w0z9w35b25",
    "source_musolla_id": "MY-08-MJG-00033"
  },
  "w0zqq3xbem": {
    "address": "Mukim 15, Bukit Mertajam, Pulau Pinang, Malaysia 14000",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.32574,
      "longitude": 100.480757
    },
    "name": "MASJID ALMA JAYA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "a075937e-ad64-46ee-a4ee-240eb2ec1cf3",
    "geohash": "w0zqq3xbem",
    "source_musolla_id": "MY-07-SPT-00202",
    "directions": "5.327574, 100.480757"
  },
  "w0zqsxkh1e": {
    "address": "Taman Tenggiri, 13700 Seberang Jaya, Pulau Pinang, Malaysia 13700",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.40186,
      "longitude": 100.398631
    },
    "name": "MASJID KAWASAN SEMBILANG",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "7b9e1b6f-ce5b-4acf-8971-42b78b47cb6e",
    "geohash": "w0zqsxkh1e",
    "source_musolla_id": "MY-07-SPT-00200"
  },
  "w0zrs0mwjh": {
    "address": "13100 Penaga, Pulau Pinang, Malaysia 13100",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.539539,
      "longitude": 100.37887
    },
    "name": "MASJID BAKAR KAPOR",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "d0f69bd9-cdd7-4cf7-baa9-c71f43b77808",
    "geohash": "w0zrs0mwjh",
    "source_musolla_id": "MY-07-KB-00092",
    "directions": "5.539539, 100.378870"
  },
  "w0zrsp7bym": {
    "address": "Penaga, Pulau Pinang, Malaysia 13100",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.577093,
      "longitude": 100.376515
    },
    "name": "MASJID BAKAU TUA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "e94e36ef-93b9-45db-9e7f-500237e52d96",
    "geohash": "w0zrsp7bym",
    "source_musolla_id": "MY-07-KB-00093",
    "directions": "5.577093, 100.376515"
  },
  "w0zrt7x4rt": {
    "address": "Kampung Bumbung Lima, 13200 Kepala Batas, Pulau Pinang, Malaysia 13200",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.556753,
      "longitude": 100.435965
    },
    "name": "MASJID BUMBUNG LIMA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "918e096b-6809-458b-9650-2291669b4406",
    "geohash": "w0zrt7x4rt",
    "source_musolla_id": "MY-07-KB-00094",
    "directions": "5.556753, 100.435965"
  },
  "w0zrjy3zcj": {
    "address": "Mukim 11, Seberang Perai Utara, Pulau Pinang, Malaysia 13800",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.484912,
      "longitude": 100.450454
    },
    "name": "MASJID KAMPONG BANGGOL",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "7fb3231d-0c44-463b-a63d-bb81419511e8",
    "geohash": "w0zrjy3zcj",
    "source_musolla_id": "MY-07-KB-00095",
    "directions": "5.484912, 100.450454"
  },
  "w0zrsd9bdm": {
    "address": "Kampung Tok Otek, Penaga, Pulau Pinang, Malaysia 13110",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.55096,
      "longitude": 100.395572
    },
    "name": "MASJID KAMPONG LEMBAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "4398678c-bfe9-4e17-b8b9-280d259141d0",
    "geohash": "w0zrsd9bdm",
    "source_musolla_id": "MY-07-KB-00096",
    "directions": "5.550960, 100.395572"
  },
  "w0zrt0h0g1": {
    "address": "Mukim 5, Kepala Batas, Pulau Pinang, Malaysia 13100",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.537246,
      "longitude": 100.420661
    },
    "name": "MASJID KAMPONG PADANG",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "a11d0182-65fe-43f9-a3c0-754edcc7ce7a",
    "geohash": "w0zrt0h0g1",
    "source_musolla_id": "MY-07-KB-00097",
    "directions": "5.537246, 100.420661"
  }
}