{
  "w0zfj0jn1b": {
    "address": "Hulu Kinta, Kinta, Perak, Malaysia 30010",
    "contact": "012-5176425",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.571347,
      "longitude": 101.125109
    },
    "name": "MASJID SULTAN YUSUF",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "95a0b1d7-e411-4ccd-96da-a13a33e32cd0",
    "geohash": "w0zfj0jn1b",
    "remarks": "pembukaan penempatan rapat setia, gunung rapat, ipoh ADALAH MEMPUNYAI HUBUNGKAIT YANG BEGITU RAPAT DENGAN PENUBUHAN SYARIKAT KERJASAMA ORANG-ORANG MELAYU, IPOH DALAM TAHUN 1953.PEMBINAAN FASA PERTAMA RUMAH KEDIAMAAN DI RAPAT SETIA INI TELAH DILAKSANAKAN DALAM TAHUN 1959. SEJAK DARI ITU PEMBINAAN PERUMAHAN BERJALAN LANCAR DAN PENDUDUK YANG MENDIAMI KAWASAN RAPAT SETIA INI SEMAKIN BERTAMBAH RAMAI. untuk memenuhi keperluan penduduk disini, dalam fasa ketiga pembinaan perumahan, sebuah surau/madrasah telah dibina di atas tapak berkeluasan 17,690 kaki persegi (lot 46483)di jalan pasar ( jalan raja musa mahadi), rapat setia, gunung rapat,31350 ipoh ia telah dirasmikan oleh dymm paduka seri sultan idris shah dalam tahaun 1963.\r\n\r\ntanah tapak surau berkenaan telah dihadiahkan oleh syarikat kerjasama perumahan orang-orang melayu perak berhad (kini koperasi perumahan orang melayu kinta berhad). pengasas pembinaan surau ini adalah juga pengasas syarikat kerjasama perumahan orang-orang melayu perak berhad.",
    "source_musolla_id": "MY-08-IPH-00190",
    "provision": "-tempat wuduk\r\n-telekung\r\n-sejadah\r\n-bilik mesyuarat\r\n-bilik pegawai masjid\r\n-pejabat masjid\r\n-ruang makan\r\n-parkir\r\n-kedai perniagaan\r\n-laluan orang kurang upaya\r\n-tandas awam\r\n-tandas orang kurang upaya\r\n-perpustakaan \r\n-ruang bilik kuliah\r\n-homestay\r\n-kawasan riadah dan tempat rehat\r\n-kolam air terjun binaan & ikan hiasan\r\n-kereta jenazah\r\n-rezah tanah perkuburan\r\n-sekolah rendah agama rakyat\r\n-sekolah tahfiz kerjasam sekolah swasta",
    "directions": "-masjid sultan yussuf rapat setia terletak dalam kawasan taman perumahan koperasi dan taman swasta. kedudukannya di jalan raja musa mahadi, yang sejajar dengan politeknik ungku omar dan rtm ipoh perak. masjid ini terletak lebih kurang 5km ke selatan bandaraya ipoh. dari pintu tol keluar (exit) simpang pulai, lebuhraya utara selatan plus, menuju ke bandaraya ipoh lebih kurang 8km."
  }
}