{
  "w0zfhh9n3s": {
    "address": "Hulu Kinta, Kinta, Perak, Malaysia 30010",
    "contact": "013-5237989/05-",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.59613,
      "longitude": 101.075662
    },
    "name": "MASJID SULTAN IDRIS SHAH II (MASJID NEGERI PERAK)",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "33cac357-145e-42d5-a38f-d0895ae2e4ac",
    "geohash": "w0zfhh9n3s",
    "remarks": "Masjid Sultan Idris Shah II telah dirasmikan pada 15 September 1978 oleh Sultan Idris Iskandar Shah II (1963-1984), Sultan yang ke-33, sempena dengan perayaan ulangtahun hari keputeraan baginda yang ke-33. Ianya terletak di atas sebidang tanah seluas kira-kira 2.6 hektar di tengah- tengah bandaraya Ipoh. Kerja-kerja pembinaan masjid tersebut telah dimulakan pada 16 Mei 1966, dan batu asas telah diletakkan pada 27 Oktober 1967 oleh (Allahyarham) Tun Haji Abdul Razak, pada ketika itu menjadi Timbalan Perdana Menteri. Masjid ini telah siap dibina pada 26 Ogos 1968.\r\n\r\nPada mulanya, masjid ini dinamakan sebagai 'Masjid Negeri (Perak)' dan telah digelarkan 'Masjid Sultan Idris Shah II' sempena nama Sultan Idris Iskandar Shah II yang telah kembali ke Rahmatullah pada tahun 1984.\r\n\r\nIdea pembinaan masjid ini berasal daripada (Allahyarham) Orang Kaya-Kaya Panglima Bukit Gantang Seri Amar Diraja Abdul Wahab pada tahun 1951. Beliau yang pada ketika itu adalah Menteri Besar telah sedar bahawa masjid-masjid yang sedia ada di lpoh tidak mencukupi untuk memuatkan semua jemaah yang menunaikan ibadah pada satu-satu masa seperti hari kebesaran Islam dan ibadah sembahyang Jumaat. Jumlah kos perbelanjaan pembinaannya ialah RM1,840,000.00",
    "source_musolla_id": "MY-08-IPH-00001",
    "provision": "Di tingkat bawah mengandungi kemudahan-kemudahan seperti ruang berwudhuk, bilik persidangan dan kutub khanah, bilik pejabat dan bilik setor. Terdapat pula sebuah dewan jemaah yang sebesar dengan dewan jemaah besaf di tingkat atas. Dewan jemaah bawah juga boleh memuatkan 1,500 orang. Di depan bangunan masjid terletaknya tempat letak kenderaan, manakala di belakang terletaknya kuarters untuk imam, bilal dan lain-lain pegawai masjid. Sehingga hari ini, masjid ini masih dirujuk orang ramai sebagai 'Masjid Negeri Perak'.",
    "directions": "Masjid ini terletak di atas sebidang tanah seluas 2.6 hektar. Kerja-kerja pembinaannya telah dimulakan pada 16 Mei 1966 Masihi dan peletakan batu asas dilakukan pada 27 Oktober 1967 Masihi oleh Allahyarham Tun Haji Abdul Razak yang ketika itu menjadi Timbalan Perdana Menteri Malaysia. Masjid ini disiapkan pada 26 Ogos 1968 Masihi dan dirasmikan oleh Almarhum Sultan Iskandar Shah II (1963-1984), Sultan Perak ke-33 sempena ulang tahun keputeraan baginda."
  }
}