{
  "w0zg96cbrx": {
    "address": "Kampung Loh, Kota Lama Kanan, Perak, Malaysia 33600",
    "contact": "0125780975",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.849174,
      "longitude": 100.956103
    },
    "name": "MASJID FADZILIAH KG. LOH KARAI",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "c6427044-293b-41d3-8ebe-b2b83208d72c",
    "geohash": "w0zg96cbrx",
    "remarks": "pada tarikh 15.12.1985 seuah masjid dibina di kg loh karai. masjid ini diberi nama masjid jamek kg loh karai mengambil sempena nama kg loh karai. tanah tapak masjid ini diwakafkan oleh tn hj pandak hamzah. sebelum didirikan masjid pihak pejabat agama membenarkan kariah masjid ini bersolat jumaat di surau kg kuala karai bermula 11.9.1987. kariah masjid ini datang dari kg loh, kg ulu karai, kg uala karai dan kg suak rambai. masjid telah dikunjungi sultan perak ke 34 dan ke 35 iaitu almarhum sultan azlan muhibbuddin shah ( masjlis berbuka puasa ) dan dymm sultan nazrin muizuddin shah ( solat jumaat ) pada 24.04.2015.",
    "source_musolla_id": "MY-08-KK-00366",
    "provision": "-tempat wudhu\r\n-telekung\r\n-sejadah\r\n-bilik mesyuarat\r\n-pejabat masjid ( dalam ubahsuai)\r\n-ruang memasak\r\n-parkir\r\n-tandas awam\r\n-kerusi orang kurang upaya\r\n-perpustakaan\r\n-ruang it ( dalam ubahsuai )"
  },
  "w0zg9h50v8": {
    "address": "Kampung Temong Hilir, Kota Lama Kiri, Perak, Malaysia 33600",
    "contact": "0195620160",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.85609,
      "longitude": 100.946748
    },
    "name": "MASJID AS - SYAKIRIN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "17a04754-73d7-490c-9501-ef3962eeba53",
    "geohash": "w0zg9h50v8",
    "remarks": "-masjid asy-syakirin terletak di kg temong hilir. masjid ini telah dibina pada tahun 1993 bagi menggantikan masjid lama yang telah uzur. masjid asy syakirin dibina di atas tanah wakaf yang terletak di atas bukit.masjid ini menggabungkan beberapa ahli kariah dari beberapa buah kampung iaitu kg temong hilir, kg lubuk chapin dan sebahagian dari kg temong hulu.",
    "source_musolla_id": "MY-08-KK-00385"
  },
  "w0zg9byxfy": {
    "address": "Kota Lama Kanan, Perak, Malaysia 31050",
    "contact": "0166980116",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.839467,
      "longitude": 100.984395
    },
    "name": "MASJID AR - RAUDAH SALAK UTARA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "84253389-1e25-4424-8b3b-1720fdec6f67",
    "geohash": "w0zg9byxfy",
    "remarks": "dalam tahun 1983 jawatankuasa kemajuan keselamatan kampung (jkkk) kampung perik yang dpengerusika oleh tuan hj osman b medon, telah mengambil keputusan untuk memohon daripada jabatan agama islam negeri perak bagi membenarkan penduduk kariah salak utara mendirikan solat jumaat di surau kg perik. hal demikian disebabkan penduduk kariah salak utara terpaksa ke masjid kg enggor yang jauhnya antara enam hingga lapan kilometer, untuk mendirikan solat jumaat.\r\n\r\nsetelah mendapat kelulusan jabatan agama islam perak, maka pada 03 ogos 1983, solat jumaat pertama di kg perik dapat didirikan di surau kampung perik. pada hari yang sama juga pengerusi jkkk kg perik ( ketua kg perik) telah meninggal dunia dan diganti oleh en norbi b deroh.\r\n\r\npada tahun 1988, satu peruntukan telah diluluskan untuk membina sebuah masjid di kg perik. sehubungan itu, pada bulan september 1988 sebuah masjid telah siap dibina di kg perik ini dan penyerahan kunci telah dilaksanakan pada 09 september 1988. ahli kariah masjid ini meliputi penduduk kampung setia, kg perik, kg nasib, taman sekitar salak utara dan kg salak stesen.",
    "source_musolla_id": "MY-08-KK-00412",
    "provision": "-tempat wuduk\r\n-telekung\r\n-sejadah\r\n-bilik pegawai masjid\r\n-parkir\r\n-tandas awam"
  }
}