{
  "w0zg15mc5d": {
    "address": "33000 Sayong, Perak, Malaysia 33000",
    "contact": "0175782944",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.764134,
      "longitude": 100.95044
    },
    "name": "MASJID DIRAJA UBUDIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "a6904107-a08d-43e0-aa36-e291d0fdd021",
    "geohash": "w0zg15mc5d",
    "remarks": "Masjid Diraja Ubudiah terletak di sebelah kawasan Makam Diraja Bukit Chandan, Kuala Kangsar. Masjid ini dibina atas titah Sultan Idris Murshidul Azam Shah, Sultan Perak ke -28 (1887-1816) kerana menunaikan nazar ketika baginda gering.\r\n\r\nKerajaan Negeri Perak kemudiannya telah mengarahkan Coloney Huxley dari Pejabat Kerja Raya di Kuala Lumpur sepaya merangka sebuah pelan masjid yang hendak didirikan itu. Tugas membuat pelan reka bentuknya telah diserahkan kepada Hubbeck, seorang arkitek kerajaan dan tugas melaksanakan pembinaan bangunan itu pula diserahkan kepada Caufield, iaitu ketua jurutera di Negeri Perak ketika itu.\r\n\r\nPada hari Jumaat, 25 Syawal 1331 Hijri bersamaan 26 September 1913 Masihi, Sultan Idris telah meletakkan batu asas masjid tersebut. Pembinaan masjid tergendala beberapa tahun kerana kerosakan ketul-ketul marmar di tempat simpanannya yang telah dipijak oleh dua ekor gajah kepunyaan Sultan Idris dan Raja Chulan.\r\n\r\nPenghantaran batu marmar yang dipesan dari Itali pula tergendala akibat meletusnya Perang Dunia Pertama. Setelah beberapa halangan berlaku, pada tahun 1917 Masihi barulah masjid yang terindah di Negeri Perak ini dengan rasminya dibuka oleh Sultan Abdul Jalil Nasaruddin Shah, iaitu pengganti Sultan Idris yang mangkat pada tahun 1916 Masihi.",
    "source_musolla_id": "MY-08-KK-00006",
    "provision": "-tempat wuduk\r\n-telekung\r\n-sejadah\r\n-bilik mesyuarat\r\n-bilik pegawai masjid\r\n-pejabat masjid\r\n-ruang makan\r\n-ruang memasak\r\n-parkir\r\n-laluan orang kurang upaya\r\n-tandas awam\r\n-perpustakaan\r\n-rumah musafir\r\n-kawasan riadah",
    "directions": "terletak diatas bukit chandan berhampiran istana iskandariah."
  },
  "w0zg0vq29p": {
    "address": "Kota Lama Kiri, Perak, Malaysia 33000",
    "contact": "05-7776459",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.77506,
      "longitude": 100.940033
    },
    "name": "MASJID DAERAH RIDZWANIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "55052e11-bd3b-4e3a-91fc-50e24aebe5ae",
    "geohash": "w0zg0vq29p",
    "remarks": "cadangan mendirikan masjid ini adalah di atas daya usaha al-marhum paduka seri sultan idris murshidul azam shah ibni al-marhum raja bendahara alang iskandar, sultan perak yang ke 28. baginda telah mewakafkan masjid tersebut kepada penduduk di daerah ini. masjid ini mula didirikan pada tahun 1915. pembinaan masjid ini memakan masa selama 2 tahun. putera baginda, sultan perak yang ke 29 telah merasmikan pembukaan masjid ini pada 24 januari 1916. pada 17 januari 1982 bangunan masjid yang lama telah mula dirobohkan .masjid baru siap dibina pada bulan ogos 1984.dirasmikan pada 19 april 1985 oleh almarhum sultan azlan muhibbudin shah ibni al marhum sultan yussuf izzudin ghafarullahu-lahu shah.",
    "source_musolla_id": "MY-08-KK-00005",
    "provision": "-tempat wuduk\r\n-telekung\r\n-sejadah\r\n-bilik mesyuarat\r\n-bilik pegawai masjid\r\n-pejabat masjid\r\n-ruang makan\r\n-ruang memasak\r\n-parkir\r\n-kedai perniagaan\r\n-laluan orang kurang upaya\r\n-tandas awam\r\n-tandas orang kurang upaya\r\n-kerusi orang kurang upaya\r\n-perpustakaan\r\n-ruang musafir",
    "directions": "terletak ditangah-gtengah pekan kuala kangsar, bersebelahan koleJ melayu kuala kangsar."
  },
  "w0zg7vge3d": {
    "address": "Sungai Siput, Perak, Malaysia 31100",
    "contact": "0165621670",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.822198,
      "longitude": 101.068109
    },
    "name": "MASJID INDIA MUSLIM",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "ce2f1542-dcd0-4ac9-951f-6683fec9b308",
    "geohash": "w0zg7vge3d",
    "remarks": "- pada awal tahun 1920-an pihak british telah membawa masuk ramai buruh kasar dari tamil nadu,india untuk bekerja di ladang-ladang getah di tanah melayu. ladang kamuning yang dahulu dikenali sebagai 'estet nombor 8' adalah antara estet yang ramai masyarakat india muslim bekerja ketika itu.\r\n\r\n- ramai juga pendakwah islam yang turut berhijrah ke tanah melayu dengan membawa masuk ilmu kalam allah s.w.t. colongan inilah yang telah mendorong masyarakat setempat mendirikan surau-surau dan pondok-pondok kecil sebagai tempat untuk mendirikan solat jemaah dan menjalankan dakwah di sungai siput. golongan dakwah inilah juga juga telah mendorong pekerja-pekerja india muslim di\"ladang nombor 8\" yang kini dikenali sebagai ladang sime darby ini mendirikan sebuah surau pada tahun 1923 di tepi jalan besar, sungai siput yang ketika itu merupakan sebuah kawasan paya yang bersebelahan dengan sebuah sungai. sungai itulah dikenali sebagai sungai siput.memandangkan ketiadaan sebuah masjid untuk masyarakat islam di sungai siput ketika itu, maka pihak british telah menderma tapak masjid ini.\r\n\r\n-dengan sumbangan daripada peniaga-peniaga india muslim di kawasan sekitar sungai siput dan juga dengan sumbangan masyarakat setempat, maka pada tahun 1929 telah lahir sebuah masjid yang dikenali dengan nama masjid india muslim sungai siput. masjid inilah masjid pertama yang telah dibina di daerah sungai siput.\r\n\r\n-pada penghujung tahun 70-an, kemajuan masjid india muslim sungai siput terus berkembang dan dengan usaha gigih para pegawai masjid ini ketika itu, bilangan umat muslim yang bersolat di masjid ini semakin meningkat. pertambahan penduduk india muslim dikawasan ini telah menyebabkan masjid ini bertambah sesak terutamanya ketika solat jumaat dan solat hari raya. justeru itu, pada pertengahan tahun 80-an, mula dibentuk ahli jawatankuasa pembinaan masjid baharu untuk menggantikan masjid tersebut yang semakin usang.\r\n\r\ndengan usaha gigih jawatankuasa masjid yang ditubuhkan yang penuh dedikasi dan komited pada masa itu, maka pada tahun 1991, terbunalah masjid yang ada sekarang.",
    "source_musolla_id": "MY-08-KK-00363",
    "provision": "- tempat wuduk\r\n- telekung\r\n- sejadah\r\n- bilik mesyuarat\r\n- pejabat masjid\r\n- ruang makan\r\n- ruang memasak\r\n- parking\r\n- laluan orang kurang upaya\r\n- tandas awam\r\n- tandas orang kurang upaya\r\n- ruang bilik kuliah",
    "directions": "masjid inilah masjid pertama yang telah dibina di daerah sungai siput. masjid ini terletak bersebelahan dengan jalan utama laluan ke utara dan ke kuala lumpur. kedudukan di pintu masuk bandar sungai siput turut menjadikan masjid ini tempat persinggahan musafir-musafir yang berlalu di kawasan ini."
  },
  "w0zgkhkdt7": {
    "address": "Sungai Siput, Perak, Malaysia 31100",
    "contact": "0125052145",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.813832,
      "longitude": 101.080632
    },
    "name": "MASJID AL - GHUFRANIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "2013efa6-85e9-44b9-a152-7f689235b539",
    "geohash": "w0zgkhkdt7",
    "remarks": "- MASJID LAMA (BANGUNAN ASAL) TELAH DIBINA PADA TAHUN 1968. MASJID INI TELAH DIRASMIKAN OLEH DYMM SULTAN IDRIS AL-MUTAWAKKIL SHAH IBNI AL MARHUM SULTAN ISKANDAR SHAH SULTAN PERAK DARUL RIDZUAN PADA 11 SEPTEMBER 1970 BERSAMAAN 10 REJAB 1390H.\r\n\r\n- PADA TAHUN 2007, SEMASA LAWATAN YB PERDANA MENTERI TUAN ABDULLAH AHMAD BADAWI KE SUNGAI SIPIUT, BELIAU TELAH MELAWAT MASJID INI DAN TELAH MELULUSKAN PERUNTUKAN UNTUK MEMBINA SEMUA MASJID AL GHUFRANIAH.\r\n\r\n- MASJID BARU INI TELAH DIBINA PADA TAHUN 2011 DAN TELAH SIAP PEMBINAAN PADA BULAN JANUARI 2013. PADA 24 FEBRUARI 2013, MASJID BARU INI TELAH MULA DIGUNAKAN.\r\n\r\n-PADA JULAI 2014 BERSAMAAN 17 RAMADHAN 1435H, DYMM SULTAN NAZRIN MUIZZUDDIN SHAH IBNI ALMARHUM SULTAN AZLAN SHAH AL MAGHFURLAH TELAH BERKENAN MERASMIKAN MASJID BARU INI.",
    "source_musolla_id": "MY-08-KK-00357",
    "provision": "-TEMPAT WUDHU'\r\n-TELEKUNG\r\n-SEJADAH\r\n-BILIK MESYUARAT\r\n-BILIK PEGAWAI MASJID\r\n-RUANG MAKAN\r\n-RUANG MEMASAK\r\n-PARKIR\r\n-LALUAN ORANG KURANG UPAYA\r\n-TANDAS ORANG KURANG UPAYA\r\n-RUANG BILIK KULIAH\r\n-KAWASAN RIADAH",
    "directions": "-250M DARI SEKOLAH KEBANGSAAN SUNGAI SIPUT UTARA\r\n-800M DARI PEJ DAERAH DAN TANAH DAERAH SUNGAI SIPUT (U)\r\n-1KM DARI IBU PEJABAT POLIS DAERAH SG SIPUT   \r\n-1.5KM DARI STESEN KERETAPI TANAH MELAYU (KTM) SG SIPUT (U)\r\n-1.5KM DARI PEJABAT POS SUNGAI SIPUT (U)\r\n-2KM DARI PASARAYA TF VALUE MART\r\n-3.5KM DARI HOSPITAL SUNGAI SIPUT (U)"
  },
  "w0zggzcumn": {
    "address": "Pulau Kamiri, Perak, Malaysia 31120",
    "contact": "0196521970",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.921266,
      "longitude": 101.065856
    },
    "name": "MASJID AR - RAHMANIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "6143cb88-a0ca-4102-a073-7a5c5b8e35f0",
    "geohash": "w0zggzcumn",
    "remarks": "-masjid ar-rahmaniah felda lasah telah mula dibina semenjak tahun 1967 bersebelahan dengan pejabat pengurusan felda. setelah hampir 34 tahun beroperasi, pihak ahli jawatnkuasa mendapati ianya perlu dibina sebuah masjid baru bagi menampung keperluan jemaah yang semakin meningkat.\r\n\r\n-pada 23 november 2001 sebuah masjid baru telah dibina bagi menggantikan masjid lama yang tidak dapat menampung keperluan jemaah yang semakin meningkat. masjid ini dibina di atas sebidang tanah yang dahulunya adalah padang bola.",
    "source_musolla_id": "MY-08-KK-00351",
    "provision": "-tempat wudhu'\r\n-telekung\r\n-sejaah\r\n-bilik mesyuarat\r\n-bilik pegawai masjid\r\n-pejabat masjid\r\n-ruang makan\r\n-ruang memasak\r\n-parkir\r\n-laluan orang kurang upaya\r\n-tandas awam\r\n-tandas orang kurang upaya\r\n-kerusi orang kurang upaya\r\n-ruang bilik kuliah\r\n-bazigo (pondok rehat)\r\n-kawasan riadah",
    "directions": "-lokasi masjid ini yang  berada di tengah-tengah penempatan menjadikan ianya mudah dilihat. terletak di sebelah jalan raya utama dan berhampiran dengan sekolah menengah kebangsaan rlkt lasah, sekolah agama rakyat at tawuniah, sekolah menengah tahfiz daerah kuala kangsar dan sekolah tahfiz al fuqaha"
  },
  "w0zg30txjb": {
    "address": "Kota Lama Kanan, Perak, Malaysia 31050",
    "contact": "0125673046",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.793991,
      "longitude": 100.95019
    },
    "name": "MASJID SULTAN MANSUR SHAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "2492f457-563e-4860-bb27-c0ab14c17b96",
    "geohash": "w0zg30txjb",
    "remarks": "masjid kota lama kanan dibina pada zaman almarhum rahmatullah sultan mansur shah, sultan perak yang ke ii dengan perbelanjaan pada masa itu rm3800. sumbangan-sumbangan adalah dari tengku permaisuri cik uteh mariah rm1000 kerajaan rm1800 dan lain-lain penderma sebanyak rm1000. masjid ini dimulai sembahyang pada 15 zulhijjah 1332 bersamaan 13 oktober 1916m. perubahan masa dan zaman telah menukar bentuk rupa bangunan masjid ini dari lama kepada yang sedia ada sekarang. ini disebabkan dengan penambahan penduduk dan keselesaan para jemaah kian bertambah. sehingga kini masjid ini belum pernah dirasmikan oleh sesiapa.",
    "source_musolla_id": "MY-08-KK-00387",
    "provision": "-tempat wudhu\r\n-telekung\r\n-sejadah\r\n-bilik mesyuarat\r\n-bilik pegawai masjid\r\n-pejabat masjid\r\n-ruang makan\r\n-ruang memasak\r\n-parkir\r\n-laluan orang kurang upaya\r\n-kerusi orang kurang upaya\r\n-ruang bilik kuliah\r\n-bazigo (pondok rehat)\r\n-kawasan riadah\r\n-",
    "directions": "LOKASI MASJID INI TERLETAK DI TEPI SUNGAI PERAK, DI KAMPUNG KOTA LAMA KANAN. JARAKNYA DARI BANDAR DIRAJA KUALA KANGSAR HANYA 3.5KM SAHAJA UNTUK SAMPAI KE MASJID INI.JALAN UNTUK SAMPAI KE MASJID MESTILAH MELALUI JAMBATAN SULTAN ABDUL JALIL. SEPANJANG JALAN KE MASJID INI, KITA AKAN TERNAMPAK SEKOLAH RENDAH KEBANGSAAN KOTA LAMA KANAN, BENGKEL-BENGKEL KRAFTANGAN. TIADA BANGUNAN BERSEJARAH ATAU TERKENAL DISEBABKAN MASJID INI TERLETAK DILUAR BANDAR."
  },
  "w0zg1kw388": {
    "address": "Sayong, Perak, Malaysia 33000",
    "contact": "0175735865",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.771072,
      "longitude": 100.961983
    },
    "name": "MASJID IDRISIAH II",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "247539e3-2092-4d49-b69e-bdc54ac6c162",
    "geohash": "w0zg1kw388",
    "source_musolla_id": "MY-08-KK-00359"
  },
  "w0zg96cbrx": {
    "address": "Kampung Loh, Kota Lama Kanan, Perak, Malaysia 33600",
    "contact": "0125780975",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.849174,
      "longitude": 100.956103
    },
    "name": "MASJID FADZILIAH KG. LOH KARAI",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "c6427044-293b-41d3-8ebe-b2b83208d72c",
    "geohash": "w0zg96cbrx",
    "remarks": "pada tarikh 15.12.1985 seuah masjid dibina di kg loh karai. masjid ini diberi nama masjid jamek kg loh karai mengambil sempena nama kg loh karai. tanah tapak masjid ini diwakafkan oleh tn hj pandak hamzah. sebelum didirikan masjid pihak pejabat agama membenarkan kariah masjid ini bersolat jumaat di surau kg kuala karai bermula 11.9.1987. kariah masjid ini datang dari kg loh, kg ulu karai, kg uala karai dan kg suak rambai. masjid telah dikunjungi sultan perak ke 34 dan ke 35 iaitu almarhum sultan azlan muhibbuddin shah ( masjlis berbuka puasa ) dan dymm sultan nazrin muizuddin shah ( solat jumaat ) pada 24.04.2015.",
    "source_musolla_id": "MY-08-KK-00366",
    "provision": "-tempat wudhu\r\n-telekung\r\n-sejadah\r\n-bilik mesyuarat\r\n-pejabat masjid ( dalam ubahsuai)\r\n-ruang memasak\r\n-parkir\r\n-tandas awam\r\n-kerusi orang kurang upaya\r\n-perpustakaan\r\n-ruang it ( dalam ubahsuai )",
    "directions": "-lokasi 3km dari pekan karai dan 15km dari bandar kuala kangsar\r\n-berhampiran jambatan victoria\r\n-laluan mudah ke masjid jika dari jalan utama kuala kangsar ke ipoh"
  },
  "w0zg9h50v8": {
    "address": "Kampung Temong Hilir, Kota Lama Kiri, Perak, Malaysia 33600",
    "contact": "0195620160",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.85609,
      "longitude": 100.946748
    },
    "name": "MASJID AS - SYAKIRIN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "17a04754-73d7-490c-9501-ef3962eeba53",
    "geohash": "w0zg9h50v8",
    "remarks": "-masjid asy-syakirin terletak di kg temong hilir. masjid ini telah dibina pada tahun 1993 bagi menggantikan masjid lama yang telah uzur. masjid asy syakirin dibina di atas tanah wakaf yang terletak di atas bukit.masjid ini menggabungkan beberapa ahli kariah dari beberapa buah kampung iaitu kg temong hilir, kg lubuk chapin dan sebahagian dari kg temong hulu.",
    "source_musolla_id": "MY-08-KK-00385",
    "directions": "-lokasi masjid asy syakirin kg temong hilir terletak di atas sebidang tanah wakaf.di seberang masjid pula terletak tanah perkuburan kg temong hilir juga merupakan sebahagian daripada tanah wakaf kepunyaan masjid. lokasi masjid ini juga terletak di laluan jalan utama menuju ke pekan kati. selain itu juga masjid asy syakirin juga terletak tidak jauh daripada makam orang-orang besar perak iaitu makam tok temong. makam ini sering dikunjungi oleh orang luar yang datang menziarahi dan secara tidak langsung akan singgah di masjid asy asyakirin untuk memunaikan solat."
  },
  "w0zg9byxfy": {
    "address": "Kota Lama Kanan, Perak, Malaysia 31050",
    "contact": "0166980116",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.839467,
      "longitude": 100.984395
    },
    "name": "MASJID AR - RAUDAH SALAK UTARA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "84253389-1e25-4424-8b3b-1720fdec6f67",
    "geohash": "w0zg9byxfy",
    "remarks": "dalam tahun 1983 jawatankuasa kemajuan keselamatan kampung (jkkk) kampung perik yang dpengerusika oleh tuan hj osman b medon, telah mengambil keputusan untuk memohon daripada jabatan agama islam negeri perak bagi membenarkan penduduk kariah salak utara mendirikan solat jumaat di surau kg perik. hal demikian disebabkan penduduk kariah salak utara terpaksa ke masjid kg enggor yang jauhnya antara enam hingga lapan kilometer, untuk mendirikan solat jumaat.\r\n\r\nsetelah mendapat kelulusan jabatan agama islam perak, maka pada 03 ogos 1983, solat jumaat pertama di kg perik dapat didirikan di surau kampung perik. pada hari yang sama juga pengerusi jkkk kg perik ( ketua kg perik) telah meninggal dunia dan diganti oleh en norbi b deroh.\r\n\r\npada tahun 1988, satu peruntukan telah diluluskan untuk membina sebuah masjid di kg perik. sehubungan itu, pada bulan september 1988 sebuah masjid telah siap dibina di kg perik ini dan penyerahan kunci telah dilaksanakan pada 09 september 1988. ahli kariah masjid ini meliputi penduduk kampung setia, kg perik, kg nasib, taman sekitar salak utara dan kg salak stesen.",
    "source_musolla_id": "MY-08-KK-00412",
    "provision": "-tempat wuduk\r\n-telekung\r\n-sejadah\r\n-bilik pegawai masjid\r\n-parkir\r\n-tandas awam",
    "directions": "MASJID INI TERLETAK DALAM KAWASAN TANAH SELUAS KIRA-KIRA 0.5 EKAR, DI TEPI JALAN RAYA PERSEKUTUAN (KM37 (BATU 25) JALAN IPOH-KUALA KANGSAR. KEDUDUKANNYA BERSEBELAHAN KILANG KICAP TAMIN ANGGOR DAN SEBERANG JALAN BERHADAPAN PUSAT KRAFTANGAN CAWANGAN PERAK DI ENGGOR. JARAKNYA DARI KUALA KANGSAR ADALAH KURANG LEBIH 8 KILOMETER DAN DARI SUNGAI SIPUT (U) KIRA-KIRA 10 KILOMETER."
  },
  "w0zg10gpd2": {
    "address": "Sayong, Perak, Malaysia 33000",
    "contact": "0132560921",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.751502,
      "longitude": 100.946606
    },
    "name": "MASJID KOLEJ UNIVERSITI ISLAM SULTAN AZLAN SHAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "48ece5b5-9a87-4ba3-a81b-4f7810d043e8",
    "geohash": "w0zg10gpd2",
    "source_musolla_id": "MY-08-KK-00591"
  },
  "w0zg0xu6cz": {
    "address": "Taman Kuala Kangsar, Kota Lama Kiri, Perak, Malaysia 33000",
    "contact": "0124576004",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.789176,
      "longitude": 100.926331
    },
    "name": "MASJID RAUDHATUL JANNAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "299b94fe-44e6-4fff-92b6-0f65c477c8d2",
    "geohash": "w0zg0xu6cz",
    "remarks": "masjid taman kuala kangsar terletak lebih kurang 4 kilometer dari bandar kuala kangsar. lokasinya berhampiran dengan stesen keretapi dan hospital kuala kangsar, taman anggerik dan taman sheikh tahir\r\n\r\npada tahun 1998, ahli jawatnkuasa taman kuala kangsar telah berjaya menyiapkan sebuah surau bagi kegunaan penduduk islam taman kuala kangsar pada masa itu dengan anggaran kos pembinaan sebanyak rm27,000. soalt berjemaah 5 waktu telah didirikan di samping pelbagai lagi aktivit keagamaan yang melibatkan semua ahli kariah surau\r\n\r\npada 1hb januari 1990, jabatan agama islam negeri perak telah meluluskan surau taman kuala kangsar bagi mendirikan solat jumaat disebabkan halangan yang dihadapi oleh penduduk taman kuala kangsar terutamanya ketika melintasi laluan keretapi untuk pergi menunaikan solat jumaat di masjid ridzuaniah kuala kangsar. kelulusan ini telah memberi banyak kemudahan dan keselesaan  kepada penduduk taman kuala kangsar dan taman-taman sekitarnya.\r\n\r\npenambahan bilangan penduduk islam di taman kuala kangsar, taman anggerik dan taman sheikh tahir serta ditambah dengan pekerja-pekerja kilang berhampiran yang datang menunaikan solat jumaat menimbulkan situasi yang kurang selesa. justeru pihak ajk surau taman kuala kangsar telah menubuhkan satu jawatankuasa pembinaan masjid taman kuala kangsar yang diketuai oleh tuan hj mohd isa b jaafar, khusus untuk merangka dan bergerak ke arah membina sebuah masjid yang lebih besar dan sempurna bagi menampung keperluan penduduk taman kuala kangsar, taman anggerik dan taman sheikh tahir.\r\n\r\nhasil usaha jk pembinaan dan doa semua penduduk islam, kelulusan pembinaan sebuah masjid di tapak berkeluasan 0.821 hektar di lot 10308 telah diperolehi dengan peruntukan dari jabatan perdana menteri, putrajaya sebanyak rm900,000 disamping hasil derma dan sumbangan AJK dan orang ramai sebanyak rm86,000. pada tahun 2004, kerja-kerja pembinaan telah dilakukan dengan pemantauan pihak jabatan kerja raya.\r\n\r\ndengan jumlah rm968,000 tersebut, masjid taman kuala kangsar telah dapat disiapkan dan upacara penyerahannya telah dilakukan oleh jabatan kerja raya kepada pejabat agama daerah kuala kangsar pada 29 ogos 2005. sehubungan dengan itu, masjid taman kuala kangsar telah digunakan dengan rasminya pada 30 ogos 2005 dengan solat maghrib berjemaah dan diadakan majlis bacaan yassin dan tahlil sempena menaymbut hari kemerdekaan.\r\n\r\npada 16 september 2005, majlis pengisytiharan mendirikan solat jumaat di masjid taman kuala kangsar telah disempurnakan oleh us zamri b hashim dari jabatan mufti negeri perak. bermula daripada tarikh inilah masjid telah digunakan secara optimum oleh seluruh anak kariah. beberapa penambahbaikan telah dilakukan untuk meningkatkan kemudahan dan keselesaan para jemaah yang sentiasa bertambah dari masa ke semasa",
    "source_musolla_id": "MY-08-KK-00534",
    "directions": "lebih kurang 4 kilometer dari bandar kuala kangsar.berhampiran stesen keretapi dan hospital kuala kangsar."
  },
  "w0zg2vqz2n": {
    "address": "Kampung Beluru, Kota Lama Kiri, Perak, Malaysia 33010",
    "contact": "0195612790",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.820159,
      "longitude": 100.940675
    },
    "name": "MASJID AL - HUSAINI WAFA KG. BELURU",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "b41871d4-972d-4dad-b696-43dae4615684",
    "geohash": "w0zg2vqz2n",
    "remarks": "ada 2 buah masjid iaitu masjid lama didirikan sekitar tahun 1930 dan yang baru sekitar tahun 1997. masjid lama hanya digunakan pada hari raya puasa khas bagi jemaah wanita sebab jemaah ramai..sejarah pembinaan tiada dapat diceritakan sebab tiada orang lama yang boleh menceritakan peristiwa dahulu",
    "source_musolla_id": "MY-08-KK-00374",
    "provision": "-tempat wuduk\r\n-telekung\r\n-sejadah\r\n-bilik pegawai masjid\r\n-pejabat masjid\r\n-ruang makan\r\n-ruang memasak\r\n-parking\r\n-kedai perniagaan\r\n-tandas awam\r\n-perpustakaan"
  },
  "w0zgfgmybh": {
    "address": "Pulau Kamiri, Perak, Malaysia 31120",
    "contact": "0195730076",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.896967,
      "longitude": 101.027193
    },
    "name": "MASJID ISMAILIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "827ec02a-ed2e-4ff2-98fc-f22336628f55",
    "geohash": "w0zgfgmybh",
    "source_musolla_id": "MY-08-KK-00364"
  },
  "w0zg1hexn9": {
    "address": "33000 Sayong, Perak, Malaysia 33000",
    "contact": "0175322181",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.772024,
      "longitude": 100.947478
    },
    "name": "MASJID KHAIRIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "21837e54-b35b-442e-ad41-1dfcdd953800",
    "geohash": "w0zg1hexn9",
    "source_musolla_id": "MY-08-KK-00386"
  },
  "w0zg30d29b": {
    "address": "Kota Lama Kiri, Perak, Malaysia 33000",
    "contact": "0194455455",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.792872,
      "longitude": 100.945557
    },
    "name": "MASJID HIDAYATUL UMMAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "13b2d324-f380-4d54-9e47-cc9fe224d18f",
    "geohash": "w0zg30d29b",
    "source_musolla_id": "MY-08-KK-00388",
    "provision": "-tempat wuduk\r\n-telekung\r\n-sejadah\r\n-bilik pegawai masjid\r\n-ruang makan\r\n-parkir\r\n-tandas awam\r\n-kawasan riadah",
    "directions": "-masjid hidayatul ummah hanya lebih kurang 5-6 kilometer dari bandar diraja kuala kangsar, perak.ianya juga terletak dalam kawasan tempat bersejrah di kuala kangsar seperti kubur tok temong, masjid kota lama kanan, uktoria bridge dan lain-lain"
  }
}