{
  "w0zg9byxfy": {
    "address": "Kota Lama Kanan, Perak, Malaysia 31050",
    "contact": "0166980116",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.839467,
      "longitude": 100.984395
    },
    "name": "MASJID AR - RAUDAH SALAK UTARA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "84253389-1e25-4424-8b3b-1720fdec6f67",
    "geohash": "w0zg9byxfy",
    "remarks": "dalam tahun 1983 jawatankuasa kemajuan keselamatan kampung (jkkk) kampung perik yang dpengerusika oleh tuan hj osman b medon, telah mengambil keputusan untuk memohon daripada jabatan agama islam negeri perak bagi membenarkan penduduk kariah salak utara mendirikan solat jumaat di surau kg perik. hal demikian disebabkan penduduk kariah salak utara terpaksa ke masjid kg enggor yang jauhnya antara enam hingga lapan kilometer, untuk mendirikan solat jumaat.\r\n\r\nsetelah mendapat kelulusan jabatan agama islam perak, maka pada 03 ogos 1983, solat jumaat pertama di kg perik dapat didirikan di surau kampung perik. pada hari yang sama juga pengerusi jkkk kg perik ( ketua kg perik) telah meninggal dunia dan diganti oleh en norbi b deroh.\r\n\r\npada tahun 1988, satu peruntukan telah diluluskan untuk membina sebuah masjid di kg perik. sehubungan itu, pada bulan september 1988 sebuah masjid telah siap dibina di kg perik ini dan penyerahan kunci telah dilaksanakan pada 09 september 1988. ahli kariah masjid ini meliputi penduduk kampung setia, kg perik, kg nasib, taman sekitar salak utara dan kg salak stesen.",
    "source_musolla_id": "MY-08-KK-00412",
    "provision": "-tempat wuduk\r\n-telekung\r\n-sejadah\r\n-bilik pegawai masjid\r\n-parkir\r\n-tandas awam",
    "directions": "MASJID INI TERLETAK DALAM KAWASAN TANAH SELUAS KIRA-KIRA 0.5 EKAR, DI TEPI JALAN RAYA PERSEKUTUAN (KM37 (BATU 25) JALAN IPOH-KUALA KANGSAR. KEDUDUKANNYA BERSEBELAHAN KILANG KICAP TAMIN ANGGOR DAN SEBERANG JALAN BERHADAPAN PUSAT KRAFTANGAN CAWANGAN PERAK DI ENGGOR. JARAKNYA DARI KUALA KANGSAR ADALAH KURANG LEBIH 8 KILOMETER DAN DARI SUNGAI SIPUT (U) KIRA-KIRA 10 KILOMETER."
  }
}