{
  "w0zqf2jprb": {
    "address": "Georgetown, Pulau Pinang, Malaysia 10050",
    "contact": "04-8282212",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.40652,
      "longitude": 100.301399
    },
    "name": "MASJID NEGERI PULAU PINANG",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "7a52dc99-1b02-4b15-a12b-a846e988b02f",
    "geohash": "w0zqf2jprb",
    "remarks": "Masjid Negeri Pulau Pinang dibina pada tahun 1979, terletak di Daerah Timur Laut. Masjid Negeri ditadbir oleh seorang Pegawai Hal Ehwal Islam dengan dibantu oleh pegawai-pegawai masjid dan kakitangan yang dilantik oleh pihak kerajaan. Negeri Pulau Pinang terbahagi kepada enam daerah pentadbiran agama.\r\n\r\nPembinaan masjid ini diilhamkan oleh Y.T.M. Tunku Abdul Rahman, bekas Perdana Menteri Malaysia, awal tahun 1968. Peranan aktif Y.T.M. di dalam meninggikan syiar Islam seperti mempeloporkan musabaqah membaca Al-Quran dalam tahun 1960, pembinaan masjid Negara pada tahun 1965 dan mengadakan berbagai-bagai rancangan dakwah Islamiah tidak dapat disangkal oleh segenap lapisan kaum muslimin di Malaysia malah di seluruh dunia. Untuk memenuhi hasrat gigih umat Islam di Pulau Pinang, Y.T.M. Tunku telah mengesyorkan sebuah Masjid Negeri perlu didirikan di negeri ini dengan jaminan sebanyak sejuta ringgit sebagai bantuan dari Kerajaan Persekutuan. Cadangan tersebut disambut baik oleh kerajaan negeri di bawah pimpinan Y.A.B. Ketua Menteri Pulau Pinang, Dr. Lim Chong Eu. Ia juga disokong dengan sepenuhnya oleh Allahyarham Tun Syed Sheh Shahbudin dan Allahyarham Tun Datuk Syed Sheh Al-Haj bin Syed Hassan Barakbah, bekas T.Y.T. Yang Di Pertua Negeri Pulau Pinang. Cadangan pembinaan itu juga diperkenan dan direstui oleh kebawah D.Y.M.M. Seri Paduka Baginda Yang Di Pertuan Agong selaku Ketua Agama bagi negeri Pulau Pinang.\r\n\r\nJawatankuasa Pembinaan Masjid Negeri ditubuhkan pada bulan Jun 1969. Jawatankuasa Pelupur tersebut di Pengerusikan oleh Datuk Haji Harun Sirat yang ketika itu menjawat jawatan Speaker Dewan Undangan Negeri dengan Datuk Haji Mohd. Sidek bin Elamdin yang ketika itu menjadi Setiausaha Sulit kepada T.Y.T. sebagai Setiausaha. Jawatankuasa Pembinaan Masjid Negeri telah memutuskan cara-cara pungutan derma daripada dermawan-dermawan Islam dan Bukan Islam, Badan-Badan Sukarela, Pertubuhan-pertubuhan, Badan Korporat serta Kakitangan Kerajaan yang beragama Islam dan bukan Islam.\r\n\r\nPada 4 Mac, 1971, pelan tapak dibentangkan dalam persidangan Majlis Kebangsan Hal Ehwal Agama dengan Y.T.M. Tunku sendiri mempengerusikan persidangan itu. Sementara itu Jawatan Pengerusi Jawatankuasa Pembinaan Masjid diambil alih oleh Allahyarham Datuk Haji Ahmad bin Haji Abdullah, Ahli Majlis Mesyuarat Kerajaan Negeri dan Pegawai Daerah Timur Laut, Encik Ismar bin Iskandar dilantik sebagai Setiausaha pada awal tahun 1973.",
    "source_musolla_id": "MY-07-TL-00001"
  }
}