{
  "w0zujnuu69": {
    "address": "Jalan Bagan Serai, Kampung Baru Lasah, 31100 Pulau Kamiri, Perak, Malaysia 31100",
    "contact": "055911241",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.95969,
      "longitude": 101.124803
    },
    "name": "MASJID al - RAMLIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "a0a9d247-f304-461b-9f1a-fd16a6066e5b",
    "geohash": "w0zujnuu69",
    "source_musolla_id": "MY-08-KK-00417",
    "provision": "-tempat wuduk\r\n-telekung\r\n-sejadah\r\n-ruang makan\r\n-ruang memasak\r\n-parking\r\n-tandas awam\r\n-bazigo"
  },
  "w0zujmwr88": {
    "address": "Jalan Bahagia, Kampung Perlop 2, 31100 Sungai Siput, Perak, Malaysia 31100",
    "contact": "016-5025352",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.953378,
      "longitude": 101.137755
    },
    "name": "MASJID AL - FALAH PERLOP 2",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "dd6d3179-161d-48b9-b666-af5cf7f88356",
    "geohash": "w0zujmwr88",
    "remarks": "kampung perlop 2/3 asalnya sebuah rancangan tanah belia khas perlop yang telah diwujudkan oleh kerajaan negeri perak pada tahun 1970an. skim ini telah ditawarkan kepada belia-belia yang menganggur diseluruh negeri perak pada ketika itu.selepas lima tahun, pihak kerjaan negeri telah menganugerahkan kepada peserta-peserta perlop dengan sebidang tanah yang berkeluasan 10 ekar bagi setiap peserta beserta sebuah rumah dengan nilainya sebanyak rm30,000.00. bermula dari situ maka pelbagai pembangunan telah disediakan oleh pihak kerajaan negeri antaranya jalan tar, bekalanelektrik dan air bersih, surau, padang bola, gelanggang takraw dan dewan orang ramai.\r\n\r\ndalam tempoh beberapa tahun kemudian para peserta rancangan tanah belia perlop telah bersepakat untuk membina sebuah rumah ibadat. oleh yang demikian, satu jawatankuasa penyelarasan telah dibentuk bagi merialisasikan pembangunan sebuah masjid untuk penduduk kampung perlop 2 dan perlop 3 demi menjalankan aktiviti-aktivit agama seperti solat waktu dan yang lebih penting untuk menampung kepadatan jemaah bagi solat jumaat.\r\n\r\npihak jawatankuasa penyelaras telah membuat permohonan melalui wakil rakyat kawasan kepada timbalan perdana menteri malaysia pada ketika itu dan mendapat kelulusan peruntukan sebanyak rm400,000.00 danbermula dari situ proses pembangunan dijalankan pada tahun 1990 dan dinamakan bangunan tersebut sebagai masjid al-falahiyah kampung perlop 2.",
    "source_musolla_id": "MY-08-KK-00342",
    "provision": "-tempat wuduk\r\n-ruang makan\r\n-ruang memasak\r\n-parkir\r\n-tandas awam"
  }
}