{
  "w1p6gf5tcf": {
    "address": "Alor Setar, Kedah, Malaysia 05460",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 6.120383,
      "longitude": 100.364998
    },
    "name": "MASJID ZAHIR (MASJID NEGERI)",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "95206ea1-49d1-460d-9075-62ae8f9c886f",
    "geohash": "w1p6gf5tcf",
    "remarks": "Masjid Zahir atau juga dikenali sebagai Masjid Zahrah merupakan Masjid Negeri Kedah yang terletak berhadapan dengan Balai Nobat dan Istana Pelamin di tengah-tengah bandar raya Alor Setar. Mula dibina pada 22 Rabiulawal 1330H (11 Mac 1912) atas usaha YTM Tunku Mahmud Ibni Almarhum Sultan Tajuddin Mukarram Shah, tapak masjid ini pada asalnya adalah tanah pusara wira-wira Kedah yang gugur semasa mempertahankan Kedah dari serangan Siam (1821).\n\nUpacara perasmiannya dilakukan pada hari Jumaat, 6 Zulhijjah 1333H (15 Oktober 1915) oleh DYMM Almarhum Sultan Abdul Hamid Halim Shah. Tunku Mahmud telah membaca khutbah Jumaat sementara baginda Sultan Abdul Hamid Shah mengimamkan solat Jumaat. Ia juga dikenali sebagai Masjid Raja kerana ia merupakan masjid Diraja dan terletak di perkarangan Istana Pelamin.",
    "source_musolla_id": "MY-02-KS-00001"
  },
  "w1p6uk7g2c": {
    "address": "Alor Setar, Kedah, Malaysia 05460",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 6.132312,
      "longitude": 100.387271
    },
    "name": "MASJID ALOR MALAI (AL-BUKHARY)",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "3a0ebc10-3baf-4088-a39d-9564b29e82ea",
    "geohash": "w1p6uk7g2c",
    "remarks": "Masjid Al-Bukhari terletak di Jalan Langgar, Mukim Alor Malai, Alor Setar. Pembinaan masjid ini dibiayai oleh jutawan terkenal, iaitu Tan Sri Syed Mokhtar Al-Bukhari. Masjid ini dibina berserta dengan sebuah kompleks yang dilengkapi dengan pelbagai kemudahan seperti hospital, tempat penginapan pelancong, ruang perniagaan dan lain-lain lagi. Di samping itu, di sini terdapat juga asrama anak yatim dan rumah warga tua. Sekolah yang berfungsi sebagai tempat pendidikan dan pembelajaran turut disediakan. Prasarana sebegini dianggap sebagai salah satu cara memakmur dan menggiatkan aktiviti masjid supaya tidak dipandang sepi.",
    "source_musolla_id": "MY-02-KS-00009"
  },
  "w1pk9dw6jd": {
    "address": "Arau, Perlis, Malaysia 02600",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 6.430104,
      "longitude": 100.270059
    },
    "name": "MASJID NEGERI",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "c1b028ad-6465-4960-b38b-01b7a789316f",
    "geohash": "w1pk9dw6jd",
    "remarks": "bermula penubuhan negara kota atau bandar purba di perlis ialah Kota Sena iaitu pada kurun ke 17 mAsihi.sewaktu zaman pemerintahan sultan mahyiddin mansur shah (1653-1661).Pusat tumpuan penduduk yang penuh sesak dengan pelbagai jenis kegiatan harian terbentuk di persekitaran kota ini.Walaupun institusi raja telah pun wujud di kota sena tetapi tidak ada bukti yang mengatakan adanya pembinaan masjid di kawasan kota ini seperti yang sering dikaitkan dengan sejarah kerajaan Islam yang lain.Masjid alwi di kangar pula hanya siap pembinaannya pada bulan mac 1933 m.maka masjid-masjid yang boleh dijadikan sebagai contoh kajian di atas perkembangan islam di perlis adalah masjid yang lebih awal pembinaannya.\r\n\r\nsherard osborn, seorang pelaut inggeris, telah beberapa kali melawat perlis dan menyatakan semasa lawatannya pada tahun 1838 m bahawa di bahagian tengah bandar kangar terdapat sebuah masjid yang meninggi di antara pokok-pokok dan dibuat daripada bahan yang rapuh :\r\n\r\n\" in the center of the town a mosque like building rose amongst the trees,and proved that, althought the many pretty houses scattered about might be as evanescent as their fragile construction indicated. \" \r\n(Sherard osborn, the blockade of kedah in 1838, hlm. 274).\r\n\r\nbiarpun terdapat di dalam catatan sejarah mengenai wujudnya sebuah binaan masjid awal di Pekan Kangar,namun sudah tiada lagi kesannya untuk dibuat kajian kerana terlalu usang dan bahan binaannya tidak tahan lama.menurut kenyataan orang-orang tua mereka hanya mengetahui lokasi masjid lama tersebut berada di tepi anak SUNGAI PERLIS YANG BERTENTANGAN DENGAN MASJID ALWI SEKARANG TETAPI MEREKA TIDAK TAHU MENGENAI CERITA PEMBINAANNYA.\r\n\r\nNAMUN BEGITU TERDAPAT MASJID YANG LEBIH LAMA DIBANGUNKAN SEBELUM MASJID ALWI IAITU MASJID LAMA ARAU YANG LETAKNYA BERTENTANGAN DENGAN MASJID NEGERI ARAU SEKARANG.IA ADALAH MERUPAKAN MASJID YANG TERTUA DI PERLIS DAN BINAANNYA MASIH KEKAL HINGGA KE HARI INI.MASJID INI BERUSIA LEBIH DARIPADA 1 ABAD DAN DIBANGUNKAN 100 TAHUN LEBIH AWAL DARIPADA MASJID ALWI, KANGAR.\r\n\r\nSEBELUM MASJID LAMA ARAU DIDIRIKAN, DIKATAKAN TERDAPAT mASJID YANG DIDIRIKAN LEBIH AWAL DI ARAU SEMASA PEMERINTAHAN rAJA SYED HUSSIN JAMALULLAIL.MASJID INI DIBINA DARIPADA KAYU SAHAJA DAN LOKASINYA HAMPIR DENGAN SEMPADAN UTARA PAGAR MASJID LAMA ARAU.\r\n\r\nKEMUDIAN SEMASA PEMERINTAHAN RAJA SYED AHMAD JAMALULLAIL YANG MENJADI RAJA PERLIS PADA MASA ITU, MASJID LAMA ARAU DIDIRIKAN IAITU PADA TAHUN (1873-1897).BAHAGIAN TENGAH MASJID LAMA INI DIBINA DARIPADA BATU MANAKALA PADA BAHAGIAN YANG LAIN KEBANYAKKANNYA DIBINA DARIPADA KAYU. mASJID INI DIBINA OLEH TUKANG-TUKANG aRAB DAN mELAYU.\r\n\r\nUNIKNYA BINAAN MASJID LAMA INI, OLEH KERANA PADA MASA ITU BELUM ADA SIMEN, PASIR-PASIR DICAMPUR DENGAN KAPUR DAN BATU KEMUDIAN DIBANCUH DENGAN MANISAN LEBAH, MANISAN TEBU, MANISAN NIPAH, TELUR AYAM DAN TELUR ITIK SEBAGAI BAHAN BINAAN. tELUR AYAM DAN ITIK DIAMBIL YANG PUTIH SAHAJA MANAKALA YANG BAHAGIAN TELUR MERAH DIGUNAKAN UNTUK MEMBUAT KUIH.\r\n\r\nSEMASA PEMERINTAHAN RAJA SYED SAFFI JAMALULLAIL, SAIZ MASJID TERSEBUT DIPERBESAR DAN MIMBAR BARU DIBINA. MIMBAR INI DIBUAT DI PULAU PINANG OLEH TUKANG MIMBAR YANG BERNAMA ABDULLAH BUYUNG DARI PULAU PINANG DAN DIBANTU OLEH HAJI ABDULLAH DARI RANI ESTATE, ARAU.MIMBAR INI SIAP DIBINA PADA TAHUN 1905M/ 1322H DAN DIBAWA PULANG KE PERLIS MENGGUNAKAN JALAN AIR KEMUDIAN MELEWATI SUNGAI TEBING TINGGI KE KANGAR.DARI KANGAR MIMBAR INI TELAH DIBAWA MENGGUNAKAN KERETA KUDA KE ARAU.KINI MIMBAR TERSEBUT BERUSIA HAMPIR 112 TAHUN DAN IANYA MASIH LAGI DIGUNAKAN HINGGA KE HARI INI SEBAGAI MIMBAR MASJID NEGERI DI ARAU.\r\n\r\nTAMBAHAN BERANDA SEKELILING MASJID LAMA INI DILAKUKAN SEMASA PEMERINTAHAN RAJA SYED ALWI JAMALULLAIL.BEBERAPA TAHUN SELEPAS ITU,BANGUNAN TAMBAHAN DIBINA DI SEBELAH KANAN DAN KIRI MASJID.KELUASAN MASJID INI AWALNYA BERUKURAN 60 KAKI X 60 KAKI PERSEGI IAITU BERBENTUK EMPAT SEGI TEPAT.MASJID INI TIDAK MRNGGUNAKAN KUBAH DI ATAS PUNCAKNYA TETAPI MENGGUNAKAN KECUBUNG.KECUBUNG MASJID TERSEBUT IALAH JENIS KECUBUNG BESAR DAN SEKELILINGNYA BERDINDING KACA BERWARNA HIJAU.\r\n\r\nZINK TEBAL YANG BERBUCU EMPAT SEGI DIGUNAKAN UNTUK MEMBUAT ATAPNYA.TIANGNYA DIBUAT DARIPADA BATU-BATA DAN DICAMPUR TANAH LIAT YANG DIADUN DENGAN PUTIH TELUR AYAM DAN ITIK.PUTIH TELUR AYAM-ITIK DAN MANISAN BERFUNGSI SEBAGAI SIMEN UNTUK MENEGUHKAN STRUKTUR BATU-BATA DAN TANAH LIAT.pINTU, ALANG DAN KELENGKAPAN ATAS YANG LAIN DIBINA DARIPADA KAYU YANG TEGUH.\r\n\r\nAWALNYA LANTAI MASJID INI DIPERBUATA DARIPADA TANAH LIAT KEMUDIAN DISIMENKAN OLEH JEMAAH MASJID SETELAHNYA.PADA WAKTU MALAM PULA, LAMPU MINYAK TANAH DIPASANG UNTUK MENERANGI MASJID TERUTAMANYA PADA BULAN RAMADAN DAN SEKIRANYA ADA SEBARANG SAMBUTAN ATAU KENDURI.SEBAGAI HAMPARAN DI DALAM MASJID, TIKAR MENGKUANG, TIKAR MENERUNG ATAU TIKAR RUMPUT DIGUNAKAN.\r\n\r\nAIR UNTUK BERWUDUK PULA DIANGKUT OELH ANAK JEMAAH SECARA GOTONG-ROYONG SEMINGGI SEKALI MENGIKUT GILIRAN.AIR TERSEBUT DIANGKUT DARIPADA SUNGAI BERHAMPIRAN IAITU SUNGAI ARAU DAN KEMUDIAN DITUNAG KE DALAM KOLAH AIR BERSEBELAHAN MASJID.MASJID DAN HALAMANNYA DIBERSIHKAN SECARA GOTONG-ROYONG OLEH ANAK JEMAAH MASJID.\r\n\r\nSEORANG KADHI DILANTIK UNTUK MENGETUAI PENTADBIRAN MASJID LAMA ARAU.BELIAU YANG AKAN  MENGENDALIKAN ORANG-ORANG DI BAWAHNYA IAITU IMAM, BILAL DAN SIAK.SELEPAS MERDEKA IAITU SEMASA PEMERINTAHAN RAJA SYED PUTRA JAMALULLAIL, MASJID LAMA ARAU TELAH MENGALAMI PERUBAHAN.BAGINDA TELAH MEMPERBAHARUI ATAP MASJID DENGAN ATAP GENTING.OLEH KERANA ANAK JEMAAH SEMAKIN BERTAMBAH, RUANG MASJID DIBESARKAN.\r\n\r\nLAMPU MINYAK TANAH JUGA TIDAK LAGI DIGUNAKAN DAN DIGANTI DENGAN LAMPU ELEKTRIK MANAKALA TIKAR RUMPUT DIGANTIKAN DENGAN TIKAR GETAH DAN HAMPARAN YANG BARU.KERJA MENCUCI MASJID DAN HALAMANNYA JUGA TIDAK LAGI DILAKUKANJ SECARA GOTONG-ROYONG TETAPI DILAKUKAN OLEH PEKERJA YANG DIBAYAR GAJI HARI DAN KEMUDIANNYA GAJI BULAN.\r\n\r\nPADA TAHUN 1973, HARAPAN ANAK-ANAK JEMAAH ARAU YANG BEGITU LAMA BAGI MENDAPATKAN SEBUAH BANGUNAN MASJID BARU YANG LEBIH LUAS DAN SELESA TELAH DIMAKBULKAN ALLAH.KERAJAAN NEGERI PERLIS TELAH BERSETUJU UNTUK MEMBANGUNKAN SEBUAH MASJID NEGERI DI TAPAK MASJID YANG ADA SEKARANG.PERLETAKAN BATU ASAS PROJEK PEMBINAAN MASJID NEGERI INI TELAH DISEMPURNAKAN OLEH RAJA PERLIS, SYED PUTRA JAMALULLAIL PADA HARI JUMAAT 18 MAC 1972 BERSAMAAN 2 SAFAR 1392H.\r\n\r\nJAWATANKUASA PEMBINAAN MASJID INI TELAH MENETAPKAN KOS PEMBINAANNYA SEBANYAK RM400,000.00 NAMUN SANGAT MENDUKACITAKAN KERANA KOS KENAIKAN BAHAN BINAAN SEMASA PROJEK PEMBINAAN DIJALANKAN, PEMBINAAN MASJID BARU TERPAKSA DITANGGUHKAN BUAT SEMENTARA WAKTU.\r\n\r\nNAMUN BEGITU, AKHIRNYA PEMBUKAAN RASMI MASJID INI DISEMPURNAKAN PADA HARI JUMAAT 6 FEBRUARI 1976 BERSAMAAN 6 SAFAR 1396 OLEH RAJA SYED PUTRA JAMALULLAIL.SEHINGGA SEKARANG MASJID NEGERI INI SUDAH DUA KALI DIUBAHSUAI SUPAYA RUANGNYA LEBIH LUAS SEPERTI YANG KITA SAKSIKANNYA SEKARANG.\r\n\r\nMAKA DEMIKIAN PERANA MASJID LAMA DIAMBIL ALIH OLEH MASJID NEGERI YANG TELAH SIAP DIBINA.KINI MASJID LAMA ARAU MASIH TEGAK DAN GAGAH DENGAN BANGUNANNYA YANG MASIH ELOK DAN BERSIH.MASJID INI SETELAH ITU DIJADIKAN TAMAN ASUHAN KANAK-KANAK ISLAM (TASKI) BERTUJUAN UNTUK MENDIDIDK KANAK-KANAK DI PERSEKITARAN PEKAN DAN KAMPUNG-KAMPUNG ARAU.PERSEKITARAN MASJID INI DIKELILINGI OLEH KAWASAN PERKUBURAN LAMA RAJA-RAJA YANG PERNAH MEMERINTAHPERLIS TERMASUKLAH MAKAM RAJA YANG MEMERINTAH DI ZAMAN AWAL PEMBINAAN MASJID LAMA TERSEBUT IAITU RAJA SYED HUSSIN JAMALULLAIL.\r\n\r\nPADA AKHIR TAHUN 2016, MASJID LAMA ARAU TELAH DIRENOVASI DAN PADA 17 JANUARI 2017 DENGAN RASMINYA MASJID LAMA ARAU TELAH BERFUNGSI SEBAGAI CENTRE OF SUNNAH MAIPS.DYTM TUANKU SYED FAIZUDDIN PUTRA IBNI TAUNKU SYED SIRAJUDDIN JAMALULLAIL, RAJA MUDA PERLIS BERSAMA DYTM RAJA PUAN MUDA PERLIS TUANKU LAILATUL SHAHREEN AKASHAH KHALIL TURUT BERCEMAR DULI BAGI MERASMIKAN CENTER OF SUNNAH MAIPS.\r\n\r\nBERBAGAI PENGISIAN DAN KAJIAN KITAB AGAMA DILAKUKAN DI CENTRE OF SUNNAH INI BEBERAPA HARI SETIAP MINGGU.SEMOGA MASJID LAMA ARAU SENTIASA DIPELIHARA DA DAPAT TERUS BERPERANAN SEBAGAI PUSAT PENYEBARAN DAN PEMAHAMAN AGAMA iSLAM YANG TERBILANG.\r\n\r\nARTIKEL OLEH : ahmad abu hassan",
    "source_musolla_id": "MY-09-AR-00001",
    "provision": "1. Perpustakaan mini\r\n 2. KAWASAN MELETAK KENDERAAN BERMOTOR\r\n 3. DEWAN SOLAT UTAMA YANG BERHAWA DINGIN\r\n 4. KOPERASI MASJID NEGERI BERHAD",
    "directions": "1. Berdekatan dengan Kompleks Tok Arau - C-Mart\r\n 2. Berdekatan dengan Istana Arau.\r\n 3. Berdekatan stesyen keretapi Arau ( KTM Berhad )\r\n 4. BERDEKATAN KOMPLEKS CENTRE OF SUNNAH MAIPs @ masjid lama arau"
  },
  "w1pk9m93f3": {
    "address": "Sungai Adam, Perlis, Malaysia 02600",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 6.446537,
      "longitude": 100.252064
    },
    "name": "MASJID AL ABRAR",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "891b1283-7b32-461c-b127-ecd5b81baeaf",
    "geohash": "w1pk9m93f3",
    "source_musolla_id": "MY-09-AR-00065",
    "provision": "1. Penghawa dingin masjid.Sumbangan oleh Dato' Seri Dr Shahidan Bin Kassim"
  },
  "w1p6ez97n7": {
    "address": "Alor Setar, Kedah, Malaysia 05460",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 6.106187,
      "longitude": 100.3621
    },
    "name": "MASJID AKAR PELURU (AL-GHUFRAN)",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "aa24afad-0a5a-4e90-b97f-38e9c6331c8b",
    "geohash": "w1p6ez97n7",
    "remarks": "Selain daripada Masjid Al-Bukhari di Jalan Langgar, terdapat sebuah lagi masjid indah terletak di Jalan Pegawai yang telah dipelopori oleh Tan Sri Syed Mokhtar. Masjid ini dibina mengikut konsep kebanyakan masjid di Afrika dan di Tanah Arab. Bentuk bumbung bersegi masjid ini dilengkapi dengan sebuah kubah utama di bahagian tengah dan didampingi oleh empat buah kubah kecil yang diletakkan di setiap empat penjuru bumbung.\n\nJika dibuat perbandingan, kedua-dua masjid ini mempunyai perbezaan dari segi reka bentuk. Masjid di Jalan Pegawai ini mempunyai hanya sebuah menara yang dibina secara terpisah dari bangunan masjid itu sendiri, sedangkan masjid di Jalan Langgar, menara-menaranya dibina bersekali dengan bangunan masjid. Meskipun ada perbezaan, kedua-dua masjid ini mempunyai keindahan dan keunikan yang tersendiri, namun fungsinya sebagai sebuah tempat ibadah yang sangat dimuliakan tetap sama dan penting dalam meningkatkan syiar Islam.",
    "source_musolla_id": "MY-02-KS-00004"
  },
  "w1p2p0knpx": {
    "address": "13 Jalan Berangan 2/1, 08000 Sungai Petani, Kedah, Malaysia 08000",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.627442,
      "longitude": 100.508755
    },
    "name": "MASJID MUKIM BERANGAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "9032cf77-b3d0-41c9-926b-69e804fd7e13",
    "geohash": "w1p2p0knpx",
    "remarks": "Pada asalnya masjid ini ialah surau kayu dan dana pembinaan masjid ini telah disumbangkan oleh pihak kerajaan pusat sebanyak RM100,000.",
    "source_musolla_id": "MY-03-PP-00483",
    "provision": "Kemudahan yang terdapat di masjid ini ialah stor yang dijadikan sebagai tempat menyimpan barang.Tandas,tempat  wuduk lelaki dan perempuan juga disediakan di masjid ini.Tempat parking berbumbung turut disediakan di masjid ini hanya untuk motosikal dan kereta.Selain itu,terdapat juga tempat parking terbuka  yang dapat memuatkan 10 buah kenderaan dalam satu masa.",
    "directions": "Masjid ini berada di dalam kawasan kampung.Lokasi masjid ini ialah 10km dari bandar Pasir Puteh."
  }
}