{
  "w22ruj4zv0": {
    "address": "Kampung Bukit Kadir, Nilai, Negeri Sembilan, Malaysia 71800",
    "contact": "019-6237952",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 2.797355,
      "longitude": 101.78134
    },
    "name": "MASJID KARIAH BUKIT KADIR",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "331785e2-d635-4820-9b24-082bb67096c2",
    "geohash": "w22ruj4zv0",
    "remarks": "MASJID KARIAH BUKIT KADIR TELAH DIBINA PADA TAHUN 1972M. PENGASANYA ADALAH PENDUDUK SETEMPAT DAN ALLAHYARHAM DATO' ADAT HAJI ABU BAKAR YANG MENJADI TOK MUDA LABU PADA WAKTU ITU. \r\n    TAPAK MASJID INI TELAH DIKURNIAKAN OLEH KERAJAAN NEGERI. BANGUNAN MASJID INI ADALAH SEBAGAI GANTI BANGUNAN MASJID LAMA YANG DIBUAT DARIPADA BANGUNAN KAYU. MASJID INI PERNAH DIBAIKI DAN DIBESARKAN PADA TAHUN 1980M DAN 1993M.                             \r\n    SEMASA DIBINA AHLI JEMAAH ADALAH SERAMAI 100 ORANG DAN KINI TELAH MENCAPAI JUMLAH SERAMAI 500 ORANG.\r\n     MASJID INI MENGURUS DAN MENGURUS SELIA EMPAT BUAH SURAU.",
    "source_musolla_id": "MY-05-SBN-00030"
  },
  "w22ruqjgfd": {
    "address": "Nilai, Negeri Sembilan, Malaysia 71800",
    "contact": "017-2821069",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 2.802173,
      "longitude": 101.796344
    },
    "name": "MASJID KARIAH PEKAN NILAI",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "22f063fc-b154-4327-8419-eeeb9a1f23de",
    "geohash": "w22ruqjgfd",
    "remarks": "MASJID KARIAH PEKAN NILAI TELAH DIBINA PADA TAHUN 1982M. PENGASASNYA ADALAH PENDUDUK SETEMPAT. TAPAK MASJID INI TELAH DIKURNIAKAN OLEH KERAJAAN NEGERI.\n   BANGUNAN MASJID LAMA YANG DIBINA PADA TAHUN 1928M SUDAH UZUR DAN DIGANTIKAN DENGAN BANGUNAN BARU SEKARANG HASIL USAHA PENDUDUK SETEMPAT DENGAN SOKONGAN TIMBALAN MENTERI PENERANGAN PADA MASA ITU. MASJID INI PERNAH DIBAIKI DAN DINAIK TARAF PADA TAHUN 1995M.               \n   SEMASA DIBINA AHLI JEMAAH ADALAH SERAMAI 200 ORANG DAN KINI TELAH MENCAPAI JULAH SERAMAI 700 ORANG.\n    MASJID INI MENGURUS DAN MENGAWAL SELIA SEBUAH KAWASAN TANAH PERKUBURAN DAN SEBUAH SURAU.\n    MASJID INI PERNAH MENJADI JOHAN BAGI ANUGERAH MASJID CONTOH PERINGKAT DAERAH SEREMBAN PADA TAHUN 1991M.",
    "source_musolla_id": "MY-05-SBN-00029"
  }
}