{
  "w22sd33qcc": {
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 2.2053,
      "longitude": 102.0538
    },
    "name": "MASJID LONDANG (AL-EHSAN)",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "fa242c72-e2ea-474f-b8ba-ff77b5e70061",
    "geohash": "w22sd33qcc",
    "remarks": "Masjid  ini diasaskan sekitar tahun 1921 dengan nama Masjid Londang . Antara pengasasnya ialah Hj.Deraman, Hj.Rajak Dollah, Hj.Dol Rajak . Keluasan masjid ini pada awalnya kira-kira 15m X 15m persegi. Manakala senibinanya menyamai senibina masjid-masjid tua di Melaka seperti Masjid Tengkera dan Masjid Kg.Hulu. Ukiran-ukiran lama  masih jelas pada tiang-tiang batu bulat yang memayungi masjid ini.  Walaupun telah melalui proses ubahsuai lebih 10 kali , namun tiang-tiang batu berukir ini masih dikekalkan termasuk senibina  ukir kayu mimbarnya.  Antara  imam-imam yang pernah memimpin masjid ini ialah Imam Hj.Yunus  Abun, Imam Yasin Latip, Imam Hj.Mohd Nor , Imam Mohamad Jantan. Turut sama menguruskan  pentadbiran masjid ini ialah siding-sidang Kg.Londang seperti  Sidang Mohamad, Sidang Abuchik Nekmat, Sidang Md.Karim Ani. Manakala pegawai-pegawai masjid yang masih diingati ialah Bilal Pedin, Tok Musa, Bilal Sukor, Khatib Husin, Tok Karim Osman, Bilal Othman dan Mukim Hj.Yunus Tahir.\nSekitar tahun 1980an masjid Kg.Londang telah dinamakam Masjid Al Ehsan dan dirasmikan oleh bekas Ketua Menteri Melaka Datuk Mohd Adib Bin Adam. Keluasannya telah bertambah  kira-kira  25m X 30m persegi dan boleh menampung  lebih kurang 800 jemaah. \n\nMasjid ini ditokok tambah dengan mewujudkan perpustakaan, bilik mesyuarat, menara azan, garaj kereta jenazah, tandas baru, pondok sembelihan korban. Bilik mimbar utama tengah masjid telah dipasang  penghawa dingin. Keluasan tanah wakaf masjid ini ialah 0ek.0r.22pol di atas Lot 398 Mukim Sungai Baru Tengah. Imam yang memimpin jemaah masjid ialah Imam  Hj.Mohd Saref Ismail dan Imam Yaakob Sohor. Manakala Sidang Mohamad Bin Othman sebagai teraju sidang Kg.Londang sekarang. Turut bernaung dibawah masjid Al Ehsan ialah pentadbiran 3 buah surau di Kg.Londang iaitu Madrasah Al Rahman Bt. 19, Madrasah Al Hidayah dan Madrasah Al Hairiyah. Kesemua madrasah ini serba moden dan selesa . \n              Masjid ini mula dibina pada tahun 1925 dan dibesarkan dengan bantuan kerajaan.",
    "source_musolla_id": "MY-04-AG-00038",
    "address": "KM 31.6, Kampung LONDANG,78300 MASJID TANAH 78300, Malaysia"
  }
}