{
  "w22u2hb90p": {
    "address": "Kampung Tambak Sebelong, Alai, Melaka, Malaysia 75200",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 2.179623,
      "longitude": 102.305384
    },
    "name": "MASJID ALAI (AL-FALIHIN)",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "21b692df-e8e6-46ac-b858-377f20c3a0f6",
    "geohash": "w22u2hb90p",
    "remarks": "Masjid asal dibina pada tahun 1890 dan terletak kira-kira 4 rantai dari kedudukan masjid sekarang. Masjid asal ini diperbuat daripada kayu dengan keluasan 30 x 40 kaki persegi. Masjid ini telah diasaskan oleh Datuk Penghulu Daud dengan bantuan Che Mat Haji Kecut. Ianya telah diwakafkan oleh Tuan Haji Yahya bin Sipang dan Akib in Taip. Semasa pembinaannya kayu-kayu ditarik menggunakan kerbau atau kereta lembu dari hutan dan batu-bata pula diambil dari Bukit Punggor, manakala batu karang yang diukir untuk menghias kemuncak dan penjuru-penjuru atap masjid di bawa dari Pulau Besar. Tukang yang mengetuai kerja-kerja pembinaan ini adalah Tuan Haji Yaacob dan Haji Yahaya. Menara masjid dibina pada tahun 1922, dengan ketinggian 72 kaki. Lampu akan dipasang di kemuncak menara sebagai menandakan hari kebesaran seperti Hari Raya, Maulud Nabi dan sebagainya. Mimbar masjid telah dibuat pada tahun 1303H melalui pakar tukang kayu dari Telok Mas dan Serkam. Pembesaran masjid ini telah dilakukan pada tahun 1925 melalui derma orang ramai berjumlah diantara RM30,000.00 hingga RM40,000.00.\n\nSetelah pembesara masjid dan menara siap, acara perasmian telah diadakan secara besar-besaran dengan upacara penyembelihan 3 ekor lembu. Pengubahsuaian juga telah dilakukan pada tahun 1979 dengan kos RM35,000.00 dan bantuan Kerajaan sebanyak RM20,000.00. Kerja-kerja pengubahsuaian terdiri dari membuat kolah dan menaiktaraf masjid. Kontraktor yang melaksanakan kerja-kerja berkenaan adalah Tuan Haji Bakar bin Haji Abd Wahab dengan bantuan jurupelan Tuan Haji Lasim. Pada tahun 1981 dibuat tambahan di bahagian kanan masjid dengan kos sebanyak RM28,000.00 dan bantuan kerajaan sebanyak RM20,000.00. Kontraktor yang terlibat adalah Tuan Haji Mohd Yassin bin Saji dengan bantuan jururpelan D. Ghose.\n\nPada tahun 1986, masjid ini telah diubahsuai lagi dengan menambah dua buah tandas dan kolah untuk mengambil air sembahyang .Masjid ini mula dibina dalam tahun 1890 dengan derma orang\nramai dan bergotong-royong. Dalam tahun 1925 masjid ini\ndibaharui dengan derma orang ramai juga.",
    "source_musolla_id": "MY-04-MT-00109"
  },
  "w22u267495": {
    "address": "Taman Alai Perdana, Telok Mas, Melaka, Malaysia 75460",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 2.166127,
      "longitude": 102.319842
    },
    "name": "MASJID TELOK MAS",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "7bb39290-05ac-4185-be87-5ad62c666fd3",
    "geohash": "w22u267495",
    "remarks": "Masjid ini berasal daripada surau yang dibina pada tahun 1820 di ketuai oleh Datuk Panglima Daeng Salleh yang bergelar Panglima Sulong Raja bertempat di jalan Raja Haji, Telok Mas. Imamnya ialah Tuan Haji Fakeh Dalili dan bilalnya pula Haji Hassan.\n\nPada tahun 1840, masjid baru dibina di tapak masjid sekarang. Masjid ini diasaskan oleh Ketua Kampung, Datuk Penghulu Haji Idris dan Imam pertama adalah Haji Bia Nurudin. Menara masjid didirikan jauh daripada tapak masjid pada tahun 1913, di bawah pimpinan Datuk Penghulu Daud bin Hamzah. Rekabentuk menara bersamaan dengan menara yang terdapat di Masjid Tanjung Kling dan Tengkera. Senarai imam yang bertugas bermula tahun 1820 – 1995 ialah Haji Faheh Dali (1820-1840), Haji Bia Nurudin (1840-1860), Haji Mohd Shah (1860-1887), Haji Idris (1887-1925), Haji Yusof bin Haji Omar (1925-1947), Haji Ghazali bin Haji Idris (1948-1958), Haji Said bin Zainal (1958-1978), Haji Husin bin Kassim (1978-1986), Haji Bokhari bin Haji Said (1986-1992), Haji Zaini bin Haji Ghazali (1992-1993), Haji Jalil bin Haji Idrus sebagai Imam 1 dan Haji Zaidan bin Haji Bahar sebagai Imam II.\n\nPengubahsuaian masjid telah dilakukan pada tahun 1951 dan pada tahun 1967 ruang tambahan di bahagian hadapan dibina bagi kemudahan jemaah. Pada tahun 1989, ruang tambahan dirobohkan dan dibina semula dengan membesarkan keseluruhan ruang sehingga ke pagar kawasan masjid. Namun rekabentuk asal masjid masih dikekalkan. Manakala bumbung hanya tinggal dua tingkat sahaja kerana bahagian bawah telah tertutup dengan tembok. Tiang seri di bahagian dalam masjid hanya tinggal 2 batang sahaja dan telah disalut dengan simen.\n\nKerja-kerja pengubahsuaian ini menelan belanja sebanyak RM110,000.00.",
    "source_musolla_id": "MY-04-MT-00142"
  }
}