{
  "w280hhdcg6": {
    "address": "Jugra, Selangor, Malaysia 42960",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 2.837535,
      "longitude": 101.429702
    },
    "name": "MASJID AL MUTTAQIN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "842c44f9-20dd-43e6-a04f-e85d7c31c2dd",
    "geohash": "w280hhdcg6",
    "remarks": "Masjid tertua di negeri selangor.Sebelum ibu negeri selangor berpindah ke klang, masjid ini merupakan tempat bersemayan sultan selangor, selain daripada masjid sultan alaiddin kg bandar.ahli kariah masjid sultan abd samad kg seri jugra merupakan jemaah masjid ini sebelum pembinaannya pada tahun 1986.makam al-marhum sultan abd samad berada berdekatan dengan masjid ini.",
    "source_musolla_id": "MY-10-KL-00113",
    "provision": "Antara kemudahan yang terdapat ialah  ruang parkir ,  van jenazah dan urusan jenazah,  ruangan solat yang selesa untuk sembahyang,  tempat  wuduk dan bilik mesyuarat.",
    "directions": "Masjid ini terletak di kawasan perkampongan Kampong Permatang Pasir, Jugra."
  },
  "w280hy381c": {
    "address": "Bandar, Selangor, Malaysia 42700",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 2.84684,
      "longitude": 101.460882
    },
    "name": "MASJID AL ISTIQOMAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "deaea039-1bad-49f9-bb44-a4d085f85b6e",
    "geohash": "w280hy381c",
    "remarks": "MASJID PERTAMA DIBINA PADA TAHUN 1919 DI ATAS TAPAK LOT 571 DALAM BENTUK SEPARUH KAYU. OLEH KERANA SUDAH TERLALU UZUR, MASJID BARU DIBINA PADA TAHUN 1966 DI ATAS TAPAK LOT 521 DENGAN PERUNTUKAN SEBANYAK RM 25 RIBU.",
    "source_musolla_id": "MY-10-KL-00111",
    "provision": "Antara kemudahan yang terdapat ialah  ruang parkir yang luas dan berbumbung,  van jenazah, pondok rehat dan  ruangan solat yang luas.,",
    "directions": "Masjid ini terletak dikawasan perkampongan Kampong Sungai Buaya berhampiran dengan Sekolah Agama, dekat dengan rumah Penyayang dan Klinik Kesihatan."
  },
  "w280h8bevb": {
    "address": "Jugra, Selangor, Malaysia 42960",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 2.817267,
      "longitude": 101.448697
    },
    "name": "MASJID SULTAN ABDUL SAMAD",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "cce85749-5592-45b7-8221-62469c4f0abc",
    "geohash": "w280h8bevb",
    "source_musolla_id": "MY-10-KL-00114",
    "provision": "Antara kemudahan yang terdapat ialah  ruang parkir yang luas,  van jenazah dan urusan jenazah,  ruangan solat yang selesa untuk sembahyang,  tempat  wuduk dan pondok  tempat berehat..",
    "directions": "Masjid ini terletak di tepi jalan Banting ke Morib berhampiran Kolej Matrikulasi Selangor."
  }
}