{
  "w2820e5vw8": {
    "address": "Kampung Bukit Changgang, Banting, Selangor, Malaysia 42700",
    "contact": "03-31491579",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 2.829927,
      "longitude": 101.628974
    },
    "name": "MASJID AS SOBIRIN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "131e6c32-09a4-49c4-97a8-40293fd0404e",
    "geohash": "w2820e5vw8",
    "remarks": "MASJID PERTAMA DIBINA DI KG.BUKIT CHANGGANG TERLETAK DI KAWASAN KUBUR (TANAH WAKAF). PADA TAHUN 1950, MASJID BARU DIBINA HASIL USAHA ORANG RAMAI DI TANAH WAKAF HJ. MUSA (1EKAR). TAHUN 1964, KELUASAN MASJID DITAMBAH HASIL SUMBANGAN KERAJAAN.",
    "source_musolla_id": "MY-10-KL-00235",
    "provision": "Antara kemudahan yang terdapat ialah  ruang parkir yang sederhana  luas,  van jenazah,  ruangan solat yang selesa untuk sembahyang, alat penghawa dingin dan  kolah untuk wuduk ."
  },
  "w2829yryy5": {
    "address": "Putrajaya, Wilayah Persekutuan, Malaysia 62000",
    "contact": "03-88885678",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 2.9359,
      "longitude": 101.689378
    },
    "name": "MASJID PUTRA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "a32cba2a-a38c-4430-a418-49e9268fbc93",
    "geohash": "w2829yryy5",
    "remarks": "Masjid Putra didirikan pada 22 Zulkaedah 1419 Hijri bersamaan 9 Mac 1999 Masihi. Ia menjadi mercu tanda Wilayah Persekutuan Putrajaya. Masjid ini dinamakan Masjid Putra sempena Perdana Menteri Malaysia yang pertama, Almarhum Tunku Abdul Rahman Putra Al-Haj.\r\nKedudukan masjid ini bersebelahan dengan Dataran Putra dan bertentangan dengan blok Perdana Putra. Dari arah masjid ini, dapat dilihat pemandangan indah Tasik Putra dan kawasan sekitarnya. Sebahagian besar kawasan masjid dikelilingi oleh tasik, menjadikan masjid ini kelihatan terapung-apung di atas air seperti Masjid Tengku Tengah Zaharah di Terengganu dan Masjid Tanjung Bunga di Pulau Pinang. Bezanya kedua-dua masjid ini dibina berhampiran dengan laut, manakala Masjid Putra dikelilingi oleh tasik.",
    "source_musolla_id": "MY-16-WPJ-00001",
    "provision": "AUDITORIUM\r\nMasjid Putra dilengkapi dengan sebuah Auditorium yang boleh memuatkan sehingga 380 orang. Ia digunakan untuk program/aktiviti anjuran Masjid Putra sendiri mahupun agensi luar sepanjang tahun. Ia turut digunakan sebagai tempat penyampaian taklimat/maklumat berkaitan Masjid Putra kepada tetamu Masjid yang membuat permohonan lawatan secara rasmi. Ia dibuka untuk sewaan dengan kadar harga RM170.00 sejam atau RM1,200.00 sehari (8 jam) dengan disertakan kemudahan penghawa dingin dan peralatan P.A. System. \r\n\r\nBILIK KULIAH\r\nMasjid Putra dilengkapi dengan dua buah Bilik Kuliah yang boleh memuatkan sehingga 70-80 orang dalam satu-satu masa bagi setiap bilik. Ia digunakan untuk program-program pengajian Masjid Putra sepanjang tahun yang berjalan sama ada pada waktu siang ataupun malam setiap hari termasuk hujung minggu. Selain itu, ia turut digunakan untuk aktiviti perbincangan secara rasmi ataupun tidak rasmi terutamanya jika melibatkan penggunaan LCD kerana Bilik Kuliah tersebut dilengkapi dengan kemudahan LCD dan P.A. System. Ia dibuka untuk sewaan dengan kadar harga RM35.00 sejam atau RM240.00 sehari (8 jam) dengan disertakan kemudahan penghawa dingin, peralatan P.A. System dan kerusi meja. \r\n\r\nDEWAN MAKAN\r\nMasjid Putra dilengkapi dengan sebuah Dewan Makan yang boleh memuatkan sehingga 230 orang. Ia digunakan untuk jamuan makan bagi program/aktiviti anjuran Masjid Putra sendiri mahupun agensi luar sepanjang tahun.\r\n\r\nDEWAN SOLAT UTAMA\r\nDewan Solat Utama Masjid Putra mempunyai ciri-ciri reka bentuk yang ringkas dan menarik. Ia amat luas dan tidak mempunyai dinding dalaman, sebaliknya ia mempunyai 12 tiang seri. Dewan Solat Utama yang berada di Aras G boleh memuatkan sehingga 8,000 jemaah lelaki manakala di Aras 1 pula boleh memuatkan sehingga 2,000 jemaah wanita dalam satu-satu masa. Selain digunakan untuk aktiviti solat berjemaah lima waktu, Dewan Solat Utama (Aras G) juga turut digunakan untuk aktiviti-aktiviti lain anjuran Masjid Putra mahupun agensi luar seperti Solat Sunat Hajat, Majlis Bacaan Yasin, Tahlil dan Doa Selamat, Tazkirah/kuliah agama, majlis pernikahan dan sebagainya yang bersesuaian dengan konsep masjid sebagaisebuah tempat ibadah\r\n\r\nPERPUSTAKAAN\r\nPerpustakaan Masjid Putra sehingga kini mempunyai sejumlah 10,193 naskhah buku yang sesuai untuk setiap peringkat umur daripada kanak-kanak pra-sekolah, pelajar sekolah rendah dan menengah, belia/pelajar universiti/kolej, pegawai dan kakitangan kerajaan hinggalah kejemaah Masjid Putra sendiri.\r\n\r\nSetakat ini ia hanya menawarkan perkhidmatan bacaan dan rujukan kepada umum manakala pinjaman hanya dibuka kepada kakitangan Masjid Putra sahaja. Pinjaman hanya akan dibuka kepada umum setelah sistem perpustakaan yang bersesuaian dan berkesan diperolehi."
  },
  "w2829g3y2h": {
    "address": "Putrajaya, Wilayah Persekutuan, Malaysia 62000",
    "contact": "0388804300",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 2.91934,
      "longitude": 101.680875
    },
    "name": "MASJID TUANKU MIZAN ZAINAL ABIDIN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "ea1faf81-42d8-48fd-b7c1-50b35dc1a7f5",
    "geohash": "w2829g3y2h",
    "remarks": "Masjid Tuanku Mizan Zainal Abidin muncul sebagai satu mercu tanda baru di Putrajaya. Masjid ini mula dibina oleh Perbadanan Putrajaya pada tahun 2004 Masihi di satu kawasan seluas 4.04 hektar berhampiran Tasik Putrajaya di Presint 3, Putrajaya dan siap pada bulan September 2009 Masihi.\r\n\r\nMasjid yang berkonsepkan kontemporari dan reka bentuk moden\r\nini dibina menggunakan 70 peratus (kira-kira 6,000 tan) besi keluli.\r\nBahan konkrit hanya digunakan untuk membina ruang letak kereta dan\r\nlaluan pejalan kaki yang terletak bersebelahan masjid. Selebihnya ialah\r\nkawasan lantai jubin, keemasan arkitektural luaran besi tahan karat,\r\naluminium, crystalised glass, grannite, dan spray grannite.ILHAM PENUBUHANNYA JUGA ADALAH DARIPADA PUCUK PIMPINAN NEGARA YANG SENTIASA MENGAMBIL BERAT BERKAITAN HAL EHWAL AGAM ISLAM.",
    "source_musolla_id": "MY-16-WPJ-00002",
    "provision": "Selain kompleks masjid yang berkapasiti 12,000 jemaah di dewan solat utama dan 8,000 di ruangan sahn, ia turut dilengkapi pelbagai kemudahan lain termasuk tiga unit kuarters dua tingkat, 10 unit kedai serta dewan serbaguna berkapasiti 250 orang. Bilik jenazah, ruang pejabat, bilik kawalan televisyen dan radio serta 620 petak letak kereta dan 100 petak letak motosikal turut disediakan bagi kemudahan pengunjung.  \r\n\r\nPengunjung juga pasti teruja apabila melalui Laluan Kiblat (Kiblat\r\nWalk) yang menghubungkan Kompleks Perbadanan Putrajaya dengan\r\nmasjid. Ia berkeluasan 13,639 meter persegi, memudahkan kakitangan\r\ndi pejabat-pejabat yang berdekatan berjalan kaki ke masjid untuk\r\nmenunaikan ibadah. \r\n\r\nMasjid bertaraf dunia yang menggabungkan kesenian Jerman dan\r\nCHina ini bernilai kira-kira RM200 juta. Ia telah diserah secara rasmi oleh\r\nPerbadanan Putrajaya kepada Jakim untuk diurustadbir pada 20 Ogos\r\n2009 Masihi bersamaan 29 Sya’ban 1430H. Tarikh itu juga terpahat satu\r\nsejarah apabila ia mula digunakan dengan Solat Asar berjemaah yang\r\ndiimamkan oleh Imam Besarnya, Ustaz Haji Mohd Ali Sarbini. Sembahyang\r\nlima waktu dan sembahyang Tarawih bermula pada 21 Ogos 2009 Masihi\r\nmanakala solat Jumaat mula didirikan pada 4 September 2009 Masihi."
  },
  "w2828pvykm": {
    "address": "Taman Putra Perdana, Puchong, Selangor, Malaysia 47130",
    "contact": "03-83187677",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 2.944067,
      "longitude": 101.609647
    },
    "name": "MASJID PUTRA PERDANA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "125b9e7c-6e90-4328-89d4-187d732d0d34",
    "geohash": "w2828pvykm",
    "remarks": "Masjid ini dibina pada tahun 2001 dn mula digunakan pada penghujung tahun 2003.",
    "source_musolla_id": "MY-10-SPG-00137",
    "provision": "Antara kemudahan yang terdapat di masjid ini ialah ruang solat yang selesa untuk lelaki dan wanita, tempat wuduk, tempat letak kereta, stor,pejabat,bilik imam dan bilal,van jenazah dan bilik mandi jenazah."
  },
  "w282gxq6nu": {
    "address": "Kajang, Selangor, Malaysia 43000",
    "contact": "012-9336220",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 2.984531,
      "longitude": 101.764253
    },
    "name": "MASJID HJ. MAT SAMAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "eeed1f35-3ede-4130-b67d-785fcc4272d9",
    "geohash": "w282gxq6nu",
    "remarks": "Bangunan Masjid Jamek Berkembar Haji Mat Saman ini memang bersejarah kerana tua dan klasiknya. Masjid ini telah dibina sejak 1929 sesuai dengan lokasinya yang berada di pinggir Sungai Ramal, iaitu pengkalan tempat persinggahan melalui jalan sungai. Sebagai tempat pertemuan perjalanan dan perniagaan, maka inisiatif diambil tokoh pemimpin semasa itu, iaitu Haji Mat Saman mendirikan masjid di tapak yang ada sekarang untuk kegunaan berjamaah dan berjumaat penduduk Sungai Ramal Luar, iaitu sebelum jalan secara sempurna dari Kajang ke Serdang dibina. Dikatakan juga masjid ini dibina di tepi sungai Ramal bagi memudahkan ahli jamaah mengambil wuduk dari Sungai Ramal tersebut. Sudah tentulah dalam usia lebih 80 tahun masjid ini telah mengalami perubahan dan penambahan sehingga kepada bentuk sebagaimana kini",
    "source_musolla_id": "MY-10-HL-00027",
    "provision": "Pelbagai kemudahan yang disediakan di masjid ini seperti van jenazah,bilik pengurusan jenazah serta koleksi kitab dan bahan bacaan. Masjid ini mempunyai talian internet untuk kegunaan stafnya dan juga mempunyai bilik mesyuarat dan tempat jamuan."
  },
  "w282g6wj21": {
    "address": "Bandar Baru Bangi, Selangor, Malaysia 43650",
    "contact": "019-8811257",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 2.958977,
      "longitude": 101.752633
    },
    "name": "MASJID AL - HASANAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "543f8ab5-657c-475e-812b-b6bc99a96054",
    "geohash": "w282g6wj21",
    "remarks": "Masjid ini adalah dibina pada tahun 90an apabila ujudnya bandar baru Bangi bagi kegunaan penduduk disekitarnya. Ianya telah dirasmikan oleh  DYMM Tengku Idris Shah Ibni Almarhum Sultan Sallehuddin Abd Aziz Shah Alhaj pada tanggal 10 Mac 2000.",
    "source_musolla_id": "MY-10-HL-00032",
    "provision": "Antara kemudahan yang terdapat ialah  ruang parking yang luas,  van jenazah,  ruangan solat yang selesa untuk sembahyang, rumah pegawai , deretan kedai pakaian dan khidmat insuran."
  },
  "w282fvp1y1": {
    "address": "Universiti Tenaga Nasional (UNITEN), Dengkil, Selangor, Malaysia 43009",
    "contact": "03-89212020",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 2.972109,
      "longitude": 101.732283
    },
    "name": "MASJID UNITEN (MASJID INSTITUSI)",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "d2453793-4e66-4c35-bd92-5e734a8997bd",
    "geohash": "w282fvp1y1",
    "remarks": "Sejajar dengan pembangunan infrastruktur IKATAN yang kemudian dinaik taraf kepada sebuah universiti dalam tahun 1997.Tenaga Nasional Berhad telah memasukkan pembinaan sebuah masjid bersam -sama dengan pembinaan bangunan-bangunan lain projek pembangunan infrastruktur fasa du Universiti Tenaga Nasional. Kos pembinaan sebanyak RM13.5 juta ringgit",
    "source_musolla_id": "MY-10-SPG-00136",
    "provision": "Antara kemudahan yang terdapat ialah  ruang parkir yang luas, alat penghawa dingin, kolam ikan dalam bangunan masjid, dewan besar yang boleh digunakan untuk majlis perkahwinan dan majlis-majlis lain dan  ruangan solat yang luas.,"
  },
  "w282bqwkxy": {
    "address": "Bandar Bukit Puchong, Puchong, Selangor, Malaysia 47120",
    "contact": "0133488921",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 2.980849,
      "longitude": 101.621474
    },
    "name": "MASJID BANDAR BUKIT PUCHONG",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "a268973e-2280-4a37-9693-4f48e5d5d589",
    "geohash": "w282bqwkxy",
    "source_musolla_id": "MY-10-PTG-00382",
    "provision": "Antara kemudahannya ialah kawasan parkir, dewan dan ruang solat yang selesa."
  },
  "w2824crv6h": {
    "address": "Bandar Baru Salak Tinggi, Selangor, Malaysia 43900",
    "contact": "03-87060081",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 2.820293,
      "longitude": 101.733146
    },
    "name": "MASJID JAMEK SULTAN HISAMUDIN (DAERAH)",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "bf3ef739-7f95-4f51-a5de-531d73db3eb4",
    "geohash": "w2824crv6h",
    "remarks": "Masjid ini telah dibina pada 6 Januari 1999 dan siap sepenuhnya pada tahun 2000.Pada ^ april, Pemangku Raja Selangor telah merasmikan masjid ini",
    "source_musolla_id": "MY-10-SPG-00134",
    "provision": "Antara kemudahan yang terdapat ialah ruang parkir dan  ruangan solat yang luas.,"
  },
  "w282bus2tw": {
    "address": "Kampung Pulau Meranti, Puchong, Selangor, Malaysia 47120",
    "contact": "013-2716394",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 2.969177,
      "longitude": 101.640603
    },
    "name": "MASJID MERANTI",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "16b44698-b45f-470a-bd88-8ca9cb1d971d",
    "geohash": "w282bus2tw",
    "remarks": "Mula dibina pada tahun 2004 dan siap sepenuhnya pada tahun 2007. Dibina bagi menggantikan masjjid lama iatu Masjid Nur Hidayah, kini ialah menjadi pusat jagaan orang -orang tua.",
    "source_musolla_id": "MY-10-SPG-00132",
    "provision": "Mempunyai pejabat dan bilik mesyuarat"
  },
  "w282h1xwjt": {
    "address": "Putra Nilai, Nilai, Negeri Sembilan, Malaysia 71800",
    "contact": "013-3219002",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 2.821799,
      "longitude": 101.787889
    },
    "name": "MASJID dato' klana petra undang luak sungei ujong",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "43a1525f-a627-40aa-9628-0c07041261d5",
    "geohash": "w282h1xwjt",
    "remarks": "Masjid Putra Nilai telah dibina pada tahun 2003M. Pengasasnya adalah penduduk setempat dan Kerajaan Negeri.\r\n     Tapak Masjid ini adalah kurniaan Kerajaan Negeri. Pada asalnya nama masjid ini adalah Masjid Bandar Baru Nilai tetapi kemudiannya telah ditukar nama menjadi Masjid Putra Nilai pada tahun 2007m.\r\n      Bilangan jemaah pada masa kini adalah seramai 5000 orang. Masjid ini mengurus sebelas buah surau di bawah seliaannya.",
    "source_musolla_id": "MY-05-SBN-00004",
    "provision": "Selain digunakan untuk beribadah, masjid ini kerap digunakan untuk pelbagai aktiviti persatuan seperti kelas fardu ain dan fardu kifayah oleh para pelajar institusi-institusi pengajian yang terdapat berhampirannya. Terdapat juga kelas mengaji al-Quran untuk kanak-kanak yang dianjurkan oleh jawatankuasa masjid."
  },
  "w2823b2hpm": {
    "address": "Pekan Dengkil, 43800 Dengkil, Selangor, Malaysia 43800",
    "contact": "03-87686951",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 2.858533,
      "longitude": 101.678782
    },
    "name": "MASJID  JAMIATUS SOLEHAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "847f296e-6b90-4c98-abe3-563f484dc7c8",
    "geohash": "w2823b2hpm",
    "source_musolla_id": "MY-10-SPG-00124",
    "provision": "Antara kemudahan yang terdapat ialah  ruang parkir yang sederhana  luas,  van jenazah,  ruangan solat yang selesa untuk sembahyang, alat penghawa dingin dan  kolah untuk wuduk ."
  },
  "w282evpzgh": {
    "address": "UKM, Bangi, Selangor, Malaysia 43600",
    "contact": "03-89215404",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 2.929211,
      "longitude": 101.777138
    },
    "name": "MASJID UKM",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "91a052ff-512b-400b-916a-4fa757e755c7",
    "geohash": "w282evpzgh",
    "remarks": "Masjid UKM telah dibina di atas tapak seluas dua hektar yang terletak di hadapan pintu masuk utama Universiti Kebangsaan Malaysia. Pembinaannya dimulakan pada 16 Mac 1979 dengan kos berjumlah RM 5.1 juta. Ia telah diserahkan secara rasmi kepada pihak Universiti Kebangsaan Malaysia pada hari Rabu 14 April 1982. Usaha pengimarahan masjid ini bermula  pada hari Jumaat 16 April 1982.\r\nReka bentuk Masjid UKM adalah hasil ilham Encik Abdullah Bakri, bekas Pengarah Unit Pembangunan, UKM.  Bangunan Masjid ini dikelilingi oleh enam menara dan sebuah menara besar setinggi 6,666 sentimeter yang diilhamkan oleh Tun  Syed Nasir, bekas Pro Canselor UKM.",
    "source_musolla_id": "MY-10-HL-00031",
    "provision": "Bangunan Masjid mempunyai tiga paras, dengan keluasan 25,713.41 meter persegi. \r\n\r\nParas Satu Masjid mempunyai sebuah dewan sembahyang, dua tempat wuduk (lelaki dan perempuan), dua tandas (lelaki dan perempuan), pejabat pentadbiran Pusat Islam, tiga buah bilik seminar, sebuah bilik mesyuarat dan sebuah bilik mandian jenazah.\r\n\r\nParas Dua Masjid mempunyai sebuah dewan sembahyang, sebuah kutub khanah, sebuah bilik rehat Imam dan Bilal dan sebuah bilik tetamu (VIP).\r\n\r\nParas Tiga mempunyai dewan sembahyang Muslimat, bilik studio dan dua tempat wudu'. Persekitaran masjid mempunyai enam buah pondok wakaf, sebuah dapur (termasuk bilik mandi dan tandas) serta terdapat lebih kurang 300 lot tempat letak kereta."
  },
  "w282ffjwc2": {
    "address": "Dengkil, Selangor, Malaysia 43800",
    "contact": "0193621355",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 2.956483,
      "longitude": 101.730026
    },
    "name": "MASJID  AL - MUSTAQIM",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "5cb14fe4-0e9b-4d0c-bb5f-3ccf268da891",
    "geohash": "w282ffjwc2",
    "remarks": "Berasal dari sebuah kampung teroka seawal tahun 1920 yang bernama Kampung Air Hitam dengan penduduk yaang tidak berapa ramai, penduduk menunaikan kewajipan solat di sebuah surau yang dibina di atas taanah persendirian di tengah - tengah kampung. Sehingga kini dalam menghadapi pertambahan penduduk, masjid telah diubahsuai dan dinaik taraf dan kini masjid tersebut dikenali sebagai Masjid Al-Mustaqim.",
    "source_musolla_id": "MY-10-SPG-00131",
    "provision": "Antara kemudahan yang terdapat di masjid ini ialah ruang solat yang selesa untuk lelaki dan wanita, tempat wuduk, tempat letak kereta, stor dan bilik imam."
  },
  "w282v9325g": {
    "address": "Kampung Baru Semenyih, Semenyih, Selangor, Malaysia 43500",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 2.951222,
      "longitude": 101.845142
    },
    "name": "MASJID RAJA MUDA MUSA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "3502b85b-4b07-477e-99d7-69381103dbff",
    "geohash": "w282v9325g",
    "source_musolla_id": "MY-10-HL-00360",
    "provision": "Kemudahan yang terdapat ialah  ruang parkir yang sederhana luas dan  ruangan solat yang selesa."
  },
  "w282md8r0n": {
    "address": "Beranang, Selangor, Malaysia 43700",
    "contact": "012-3031169",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 2.871416,
      "longitude": 101.843607
    },
    "name": "MASJID KARIAH KUALA PAJAM",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "322e565a-ec7f-42df-b400-0a3ec639bb5e",
    "geohash": "w282md8r0n",
    "remarks": "Asal tapak masjid kampong Kuala Pajam terletak dibangunan SRA Kampong Kuala Pajam. Masjid Kampong Kuala Pajam asalnya dibina pada tahun 1930. Masjid ini diperbuat daripada kayu. Akibat banjir yang sering melanda, masjid baru dibina diatas bukit. Siap dibina pada tahun 1972. Tapak masjid ini diwakafkan oleh Allahyarham Tuan Hj Salim.",
    "source_musolla_id": "MY-10-HL-00040",
    "provision": "Antara kemudahan yang terdapat ialah  ruang parkir  dan  ruangan solat yang selesa."
  },
  "w282q55trx": {
    "address": "Kampung Tanjung, Beranang, Selangor, Malaysia 43700",
    "contact": "013-2494595",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 2.873867,
      "longitude": 101.870368
    },
    "name": "MASJID KAMPUNG SESAPAN BATU REMBAU",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "0baca358-2a9e-4b8a-8d2b-c5c9f9e57e13",
    "geohash": "w282q55trx",
    "source_musolla_id": "MY-10-HL-00361",
    "provision": "Antara kemudahan yang terdapat ialah  ruang parkir yang luas,  parkir berbumbung dan ruangan solat yang luas.,"
  }
}