{
  "w2829yryy5": {
    "address": "Putrajaya, Wilayah Persekutuan, Malaysia 62000",
    "contact": "03-88885678",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 2.9359,
      "longitude": 101.689378
    },
    "name": "MASJID PUTRA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "a32cba2a-a38c-4430-a418-49e9268fbc93",
    "geohash": "w2829yryy5",
    "remarks": "Masjid Putra didirikan pada 22 Zulkaedah 1419 Hijri bersamaan 9 Mac 1999 Masihi. Ia menjadi mercu tanda Wilayah Persekutuan Putrajaya. Masjid ini dinamakan Masjid Putra sempena Perdana Menteri Malaysia yang pertama, Almarhum Tunku Abdul Rahman Putra Al-Haj.\r\nKedudukan masjid ini bersebelahan dengan Dataran Putra dan bertentangan dengan blok Perdana Putra. Dari arah masjid ini, dapat dilihat pemandangan indah Tasik Putra dan kawasan sekitarnya. Sebahagian besar kawasan masjid dikelilingi oleh tasik, menjadikan masjid ini kelihatan terapung-apung di atas air seperti Masjid Tengku Tengah Zaharah di Terengganu dan Masjid Tanjung Bunga di Pulau Pinang. Bezanya kedua-dua masjid ini dibina berhampiran dengan laut, manakala Masjid Putra dikelilingi oleh tasik.",
    "source_musolla_id": "MY-16-WPJ-00001",
    "provision": "AUDITORIUM\r\nMasjid Putra dilengkapi dengan sebuah Auditorium yang boleh memuatkan sehingga 380 orang. Ia digunakan untuk program/aktiviti anjuran Masjid Putra sendiri mahupun agensi luar sepanjang tahun. Ia turut digunakan sebagai tempat penyampaian taklimat/maklumat berkaitan Masjid Putra kepada tetamu Masjid yang membuat permohonan lawatan secara rasmi. Ia dibuka untuk sewaan dengan kadar harga RM170.00 sejam atau RM1,200.00 sehari (8 jam) dengan disertakan kemudahan penghawa dingin dan peralatan P.A. System. \r\n\r\nBILIK KULIAH\r\nMasjid Putra dilengkapi dengan dua buah Bilik Kuliah yang boleh memuatkan sehingga 70-80 orang dalam satu-satu masa bagi setiap bilik. Ia digunakan untuk program-program pengajian Masjid Putra sepanjang tahun yang berjalan sama ada pada waktu siang ataupun malam setiap hari termasuk hujung minggu. Selain itu, ia turut digunakan untuk aktiviti perbincangan secara rasmi ataupun tidak rasmi terutamanya jika melibatkan penggunaan LCD kerana Bilik Kuliah tersebut dilengkapi dengan kemudahan LCD dan P.A. System. Ia dibuka untuk sewaan dengan kadar harga RM35.00 sejam atau RM240.00 sehari (8 jam) dengan disertakan kemudahan penghawa dingin, peralatan P.A. System dan kerusi meja. \r\n\r\nDEWAN MAKAN\r\nMasjid Putra dilengkapi dengan sebuah Dewan Makan yang boleh memuatkan sehingga 230 orang. Ia digunakan untuk jamuan makan bagi program/aktiviti anjuran Masjid Putra sendiri mahupun agensi luar sepanjang tahun.\r\n\r\nDEWAN SOLAT UTAMA\r\nDewan Solat Utama Masjid Putra mempunyai ciri-ciri reka bentuk yang ringkas dan menarik. Ia amat luas dan tidak mempunyai dinding dalaman, sebaliknya ia mempunyai 12 tiang seri. Dewan Solat Utama yang berada di Aras G boleh memuatkan sehingga 8,000 jemaah lelaki manakala di Aras 1 pula boleh memuatkan sehingga 2,000 jemaah wanita dalam satu-satu masa. Selain digunakan untuk aktiviti solat berjemaah lima waktu, Dewan Solat Utama (Aras G) juga turut digunakan untuk aktiviti-aktiviti lain anjuran Masjid Putra mahupun agensi luar seperti Solat Sunat Hajat, Majlis Bacaan Yasin, Tahlil dan Doa Selamat, Tazkirah/kuliah agama, majlis pernikahan dan sebagainya yang bersesuaian dengan konsep masjid sebagaisebuah tempat ibadah\r\n\r\nPERPUSTAKAAN\r\nPerpustakaan Masjid Putra sehingga kini mempunyai sejumlah 10,193 naskhah buku yang sesuai untuk setiap peringkat umur daripada kanak-kanak pra-sekolah, pelajar sekolah rendah dan menengah, belia/pelajar universiti/kolej, pegawai dan kakitangan kerajaan hinggalah kejemaah Masjid Putra sendiri.\r\n\r\nSetakat ini ia hanya menawarkan perkhidmatan bacaan dan rujukan kepada umum manakala pinjaman hanya dibuka kepada kakitangan Masjid Putra sahaja. Pinjaman hanya akan dibuka kepada umum setelah sistem perpustakaan yang bersesuaian dan berkesan diperolehi."
  }
}