{
  "w2829g3y2h": {
    "address": "Putrajaya, Wilayah Persekutuan, Malaysia 62000",
    "contact": "0388804300",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 2.91934,
      "longitude": 101.680875
    },
    "name": "MASJID TUANKU MIZAN ZAINAL ABIDIN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "ea1faf81-42d8-48fd-b7c1-50b35dc1a7f5",
    "geohash": "w2829g3y2h",
    "remarks": "Masjid Tuanku Mizan Zainal Abidin muncul sebagai satu mercu tanda baru di Putrajaya. Masjid ini mula dibina oleh Perbadanan Putrajaya pada tahun 2004 Masihi di satu kawasan seluas 4.04 hektar berhampiran Tasik Putrajaya di Presint 3, Putrajaya dan siap pada bulan September 2009 Masihi.\r\n\r\nMasjid yang berkonsepkan kontemporari dan reka bentuk moden\r\nini dibina menggunakan 70 peratus (kira-kira 6,000 tan) besi keluli.\r\nBahan konkrit hanya digunakan untuk membina ruang letak kereta dan\r\nlaluan pejalan kaki yang terletak bersebelahan masjid. Selebihnya ialah\r\nkawasan lantai jubin, keemasan arkitektural luaran besi tahan karat,\r\naluminium, crystalised glass, grannite, dan spray grannite.ILHAM PENUBUHANNYA JUGA ADALAH DARIPADA PUCUK PIMPINAN NEGARA YANG SENTIASA MENGAMBIL BERAT BERKAITAN HAL EHWAL AGAM ISLAM.",
    "source_musolla_id": "MY-16-WPJ-00002",
    "provision": "Selain kompleks masjid yang berkapasiti 12,000 jemaah di dewan solat utama dan 8,000 di ruangan sahn, ia turut dilengkapi pelbagai kemudahan lain termasuk tiga unit kuarters dua tingkat, 10 unit kedai serta dewan serbaguna berkapasiti 250 orang. Bilik jenazah, ruang pejabat, bilik kawalan televisyen dan radio serta 620 petak letak kereta dan 100 petak letak motosikal turut disediakan bagi kemudahan pengunjung.  \r\n\r\nPengunjung juga pasti teruja apabila melalui Laluan Kiblat (Kiblat\r\nWalk) yang menghubungkan Kompleks Perbadanan Putrajaya dengan\r\nmasjid. Ia berkeluasan 13,639 meter persegi, memudahkan kakitangan\r\ndi pejabat-pejabat yang berdekatan berjalan kaki ke masjid untuk\r\nmenunaikan ibadah. \r\n\r\nMasjid bertaraf dunia yang menggabungkan kesenian Jerman dan\r\nCHina ini bernilai kira-kira RM200 juta. Ia telah diserah secara rasmi oleh\r\nPerbadanan Putrajaya kepada Jakim untuk diurustadbir pada 20 Ogos\r\n2009 Masihi bersamaan 29 Sya’ban 1430H. Tarikh itu juga terpahat satu\r\nsejarah apabila ia mula digunakan dengan Solat Asar berjemaah yang\r\ndiimamkan oleh Imam Besarnya, Ustaz Haji Mohd Ali Sarbini. Sembahyang\r\nlima waktu dan sembahyang Tarawih bermula pada 21 Ogos 2009 Masihi\r\nmanakala solat Jumaat mula didirikan pada 4 September 2009 Masihi."
  }
}