{
  "w282evpzgh": {
    "address": "UKM, Bangi, Selangor, Malaysia 43600",
    "contact": "03-89215404",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 2.929211,
      "longitude": 101.777138
    },
    "name": "MASJID UKM",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "91a052ff-512b-400b-916a-4fa757e755c7",
    "geohash": "w282evpzgh",
    "remarks": "Masjid UKM telah dibina di atas tapak seluas dua hektar yang terletak di hadapan pintu masuk utama Universiti Kebangsaan Malaysia. Pembinaannya dimulakan pada 16 Mac 1979 dengan kos berjumlah RM 5.1 juta. Ia telah diserahkan secara rasmi kepada pihak Universiti Kebangsaan Malaysia pada hari Rabu 14 April 1982. Usaha pengimarahan masjid ini bermula  pada hari Jumaat 16 April 1982.\r\nReka bentuk Masjid UKM adalah hasil ilham Encik Abdullah Bakri, bekas Pengarah Unit Pembangunan, UKM.  Bangunan Masjid ini dikelilingi oleh enam menara dan sebuah menara besar setinggi 6,666 sentimeter yang diilhamkan oleh Tun  Syed Nasir, bekas Pro Canselor UKM.",
    "source_musolla_id": "MY-10-HL-00031",
    "provision": "Bangunan Masjid mempunyai tiga paras, dengan keluasan 25,713.41 meter persegi. \r\n\r\nParas Satu Masjid mempunyai sebuah dewan sembahyang, dua tempat wuduk (lelaki dan perempuan), dua tandas (lelaki dan perempuan), pejabat pentadbiran Pusat Islam, tiga buah bilik seminar, sebuah bilik mesyuarat dan sebuah bilik mandian jenazah.\r\n\r\nParas Dua Masjid mempunyai sebuah dewan sembahyang, sebuah kutub khanah, sebuah bilik rehat Imam dan Bilal dan sebuah bilik tetamu (VIP).\r\n\r\nParas Tiga mempunyai dewan sembahyang Muslimat, bilik studio dan dua tempat wudu'. Persekitaran masjid mempunyai enam buah pondok wakaf, sebuah dapur (termasuk bilik mandi dan tandas) serta terdapat lebih kurang 300 lot tempat letak kereta.",
    "directions": "Masjid ini terletak hanya beberapa kilometer dari tol Bangi yang menghubungkan lebuhraya PLUS. Ia juga berada di antara Pekan Lama Bangi dan Bandar Baru Bangi. Masjid ini mempunyai lampu isyarat yang terus ke university dan masjid ini sendiri sebagai tanda lokasi masjid ini."
  }
}