{
  "w283fjk6nb": {
    "address": "Pusat Bandaraya, Kuala Lumpur, Wilayah Persekutuan, Malaysia 50000",
    "contact": "03-26912829",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.149301,
      "longitude": 101.695587
    },
    "name": "MASJID JAMEK sultan Abdul samad",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "102ab8aa-6d3e-4db2-93c8-6af64298577b",
    "geohash": "w283fjk6nb",
    "remarks": "Masjid Jamek ini terletak di Jalan Tun Perak, Kuala Lumpur. Ia telah dibuka dengan rasminya oleh Sultan Selangor, Sultan Alauddin Sulaiman Shah. Masjid yang tertua di Wilayah Persekutuan ini mendapat tumpuan orang ramai di sekitar pusat bandar. Sejak tahun 1979 Masihi, kerja-kerja pemulihan dan pembesarannya telah dijalankan sehingga 10 Mei 1983 Masihi yang melibatkan pembesaran masjid ke peringkat optimum tanpa mengubah reka bentuk asalnya.\r\n\r\nPembinaan masjid ini hanya mengambil masa selama sembilan bulan dan kosnya telah dibiayai oleh kerajaan dan sumbangan orang ramai. Memandangkan ia menjadi tumpuan ramai, beberapa tahun kemudian pihak kerajaan telah membesarkan ruang masjid ini serta dilengkapi dengan permaidani dan lampu-lampu hiasan. Kerja-kerja pembesaran masjid ini dilakukan pada tahun 1979 Masihi. Kemudian sekali lagi masjid ini diperbaiki pada tahun 1993 Masihi akibat keruntuhan salah sebuah kubahnya. Pada tanggal 23 jun 2017 dengan rasminya masjid ini telah ditukarkan nama dengan nama baru iaitu masjid jamek sultan abdul samad kuala lumpur yang telah dimashurkan oleh kebawah duli yang maha mulia tuanku syarifuddin SHAH ibni almarhum sultan abdul aziz shah sultan selangor.\r\nReka",
    "source_musolla_id": "MY-14-WKL-00051",
    "provision": "1. tEMPAT WUDUK YANG BERSIH DAN TANDAS YANG SELESA.  \r\n2. GALERI YANG MENEMPATKAN GAMBAR-GAMBAR DAN BERITA MENGENAI MASJID SULTAN ABDUL SAMAD.\r\n3. BERDEKATAN DENGAN PERHENTIAN LRT DAN DATARAN MERDEKA. \r\n4. MEMPUNYAI JAMBATAN YANG MERENTASI SUNGAI GOMBAK DARI MASJID KE DATARAN MERDEKA."
  },
  "w283fjugyr": {
    "address": "Pusat Bandaraya, Kuala Lumpur, Wilayah Persekutuan, Malaysia 50000",
    "contact": "03-26921009",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.152386,
      "longitude": 101.696252
    },
    "name": "MASJID INDIA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "ea8c7132-81be-41bc-b465-01cccd6173be",
    "geohash": "w283fjugyr",
    "remarks": "Masjid India pula sangat popular di kalangan peniaga India Muslim di Jalan Masjid India. Masjid ini dibina pada 3 Jamadillawal 1382 bersamaan 10 September 1964 Masihi. Pada mulanya ia dikenali dengan nama Masjid India Selatan. Masjid ini tidak putus-putus dikunjungi oleh masyarakat muslim di ibu kota dan juga musafir.\r\n\r\nSeperti Masjid Jamek juga, Masjid India memainkan peranan penting sebagai pusat ibadah di tengah-tengah kesibukan pusat perniagaan terkenal ini. Masjid ini akan sesak dengan jemaah apabila waktu solat Jumaat. Oleh kerana masjid ini digunakan oleh berbagai-bagai bangsa yang menganut agama Islam, khutbah Jumaat dibacakan di dalam tiga bahasa, iaitu bahasa Urdu, bahasa Inggeris dan bahasa Melayu.",
    "source_musolla_id": "MY-14-WKL-00009"
  }
}