{
  "w283bqge5g": {
    "address": "Pinggir Taman Tun Dr. Ismail, Kuala Lumpur, Wilayah Persekutuan, Malaysia 60000",
    "contact": "03-77282127",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.157731,
      "longitude": 101.617525
    },
    "name": "MASJID AL-GHUFRAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "3d588ddf-7b05-4b2f-a482-36131e722de4",
    "geohash": "w283bqge5g",
    "remarks": "Masjid Al-Ghufran telah didaftarkan dengan nama Surau Balai Islam di bawah pengawasan Jabatan Agama Islam Wilayah Persekutuan (JAWI) pada 6 April 1993. Hasil sumbangan orang ramai dan golongan korporat, bermula tahun 1998, surau Balai aIslam telah diubahsuai selaras dengan peningkatan peranannya. Ianya berfungsi bukan sahaja sebagai tempat solat malah lengkap dengan kemudahan seperti Sekolah Rendah Agama Balai Islam (SERAMBI), kamar musafir, dewan konferen, pejabat pentadbiran, bilik mesyuarat serta cafe. Pada 4 April 2000, Surau Balai Islam telah dinaik taraf menjadi masjid dan diberi nama Masjid Al-Ghufran. \"Al-Ghufran\" bermaksud \"KEAMPUNAN\" adalah nama yang diberikan oleh YBhg Datuk Mohd Hashim bin Yahaya, Mufti Wilayah Persekutuan ketika itu.",
    "source_musolla_id": "MY-14-WKL-00036",
    "provision": "Kemudaha yang terdapat dimasjid ini ialah kamar musafir (ala hotel), dewan solat, dewan jamuan, dewan cafe al-ghufran, bilik Balqis, dewan konferen dan bilik mesyuarat.",
    "directions": "Lokasi kompleks ini di Pinggiran Taman Tun Dr.Ismail amat strategik kerana terletak di atas bukit menghadap Lebuhraya Damansara - Puchong (LDP) dan bersempadan antara Kuala Lumpur - Petaling Jaya. Ia juga berhampiran dengan Sri Pentas TV3, kompleks membeli belah One Utama, IKEA, The Curve dan pusat pengajian tinggi seperti Universiti Malaya, Kolej Bandar Utama, Kolej MAHSA juga beberapa pusat perubatan seperti Hospital Universiti, Damansara Specialist Centre dan Hospital Selayang. Perjalanan dari Masjid Al-Ghufran ke Lapangan Terbang Subang hanya mengambil masa 10 minit, KLIA hanya 45 minit dan pusat bandaraya Kuala Lumpur hanya 20 minit."
  }
}