{
  "w283c9g06m": {
    "address": "Bangsar Baru, 59100 Kuala Lumpur, Wilayah Persekutuan, Malaysia 59100",
    "contact": "03-22833707",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.129803,
      "longitude": 101.671704
    },
    "name": "MASJID SAIDINA ABU BAKAR AS-SIDDIQ",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "e8b2ab69-a8ee-470e-ba81-3b93fbd6282f",
    "geohash": "w283c9g06m",
    "remarks": "Projek pembinaan masjid yang terletak di Bangsar ini telah dimulakan pada 18 Julai 1980. Majlis penentuan arah kiblatnya pula telah dilaksanakan pada 24 Ogos 1980 oleh Tan Sri Sheikh Abdul Mohsein bin Haji Salleh, Mufti Wilayah Persekutuan. Peletakan batu asas masjid disempurnakan oleh Datuk Amar Haji Abdul Taib bin Mahmud, Menteri Wilayah Persekutuan pada 23 November 1980. Bangunan masjid ini siap sepenuhnya pada bulan Mac 1982.",
    "source_musolla_id": "MY-14-WKL-00006",
    "provision": "Masjid ini mempunyai dewan solat yang selesa, sekolah agama dan parkir."
  },
  "w283cvp2m2": {
    "address": "Tasik Perdana, Kuala Lumpur, Wilayah Persekutuan, Malaysia 50480",
    "contact": "03-22740525",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.147626,
      "longitude": 101.688653
    },
    "name": "MASJID BUKIT AMAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "38c39358-b6a7-4d94-aff2-a4b61339144f",
    "geohash": "w283cvp2m2",
    "remarks": "Idea untuk mendirikan masjid ini timbul kira-kira tiga tahun yang lalu, di dalam satu majlis berbuka puasa di Surau Bukit Aman, di mana ketika itu hujan sedang turun dengan lebatnya. Tan Sri Samsuri Arshad (bekas Timbalan Ketua Polis Negara dan beberapa orang pegawai kanan sedang berbual-bual selepas berbuka puasa. Perbualan mereka telah terhenti seketika apabila titisan air hujan jatuh di atas meja di hadapan mereka. Pegawai-pegawai yang hadir seterusnya mengusulkan cadangan supaya sebuah surau baru dibina di ibu pejabat Polis Bukit Aman. Idea pembinaan surau yang sempurna ini telah dibawa ke pengetahuan Ketua Polis Negara. Ketua Polis Negara telahg memperakui betapa perlunya surau baru Bukit Aman dibina memandangkan surau yang sedia ada kecil dan usang. Pada 13 Jun 1995, Ketua Polis Negara telah berjumpa YAB Dato' Seri Dr. Mahathir Mohamad, Perdana Menteri di pejabat beliau, di Jabatan Perdana Menteri dan menerangkan betapa perlunya sebuah surau baru dibina di Bukit Aman. Perdana Menteri telah bersetuju dengan cadangan tersebut dan meluluskan bantuan kerajaan di dalam bentuk \"outright grant\" sebanyak RM4 juta. Seterusnya beliau menyarankan supaya surau tersebut dinaikkan tarafnya menjadi sebuah masjid.",
    "source_musolla_id": "MY-14-WKL-00055",
    "provision": "Kemudahan yang terdapat di masjid ini ialah Dewan Besar, Kelas Komputer, Kelas Pra-Sekolah, Kelas Agama, Pentas, Perpustakaan."
  },
  "w283cjqzne": {
    "address": "Bukit Damansara, Kuala Lumpur, Wilayah Persekutuan, Malaysia 50490",
    "contact": "03-20954457",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.150179,
      "longitude": 101.655066
    },
    "name": "MASJID SAIDINA UMAR AL-KHATTAB",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "409a4647-f1ab-42ba-8338-77bbaa6e14b7",
    "geohash": "w283cjqzne",
    "source_musolla_id": "MY-14-WKL-00028",
    "provision": "Mempunyai deretan rumah untuk kakitangan masjid, beserta tapak niaga pada hari jumaat bagi umat islam berniaga dan kawasan TEMPAT LETAK KERETA yang luas. MASJID INI JUGA ADA MENYEDIAKAN PERKHIDMATAN SEWAAN PENGINAPAN (6 UNIT), DEWAN SERBAGUNA (KENDURI KAHWIN/PROGRAM)DAN MELAYARI INTERNET SECARA PERCUMA OLEH TM."
  }
}