{
  "w283f5cwkh": {
    "address": "Tasik Perdana, Kuala Lumpur, Wilayah Persekutuan, Malaysia 50480",
    "contact": "03-26937784",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.141812,
      "longitude": 101.691695
    },
    "name": "MASJID NEGARA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "22c6c01c-47e0-462e-837f-b90acfca1374",
    "geohash": "w283f5cwkh",
    "remarks": "Masjid Negara dibina sebagai tanda kesyukuran pemimpin dan rakyat atas kemerdekaan Tanah Melayu yang telah dicapai tanpa peperangan. Pembinaan masjid ini adalah atas cadangan Almarhum YTM Tunku Abdul Rahman Putra Al-Haj, Perdana Menteri Malaysia yang pertama. Ia menjadi lambang semangat perpaduan dan toleransi rakyat kerana melibatkan semua kaum pada ketika itu. Ini kerana selain daripada peruntukan wang kerajaan, kos pembiayaan membina Masjid Negara disumbangkan oleh rakyat jelata tanpa mengira kaum, agama dan bangsa. Nama masjid ini telah diberikan oleh YTM Tunku Abdul Rahman. Beliau tidak bersetuju masjid ini dinamakan dengan nama beliau seperti yang telah dicadangkan oleh banyak pihak.\r\n\r\nMasjid Negara telah siap dibina pada 27 Ogos 1965 dan menjadi lambang keagongan Islam di Malaysia. Ia boleh menampung seramai 15,000 jemaah.",
    "source_musolla_id": "MY-14-WKL-00001",
    "provision": "Ruang anjung dan serambi yang luas di masjid ini dapat menampung kebanjiran para jemaah pada masa solat Jumaat dan solat hari raya. Selain itu ia turut digunakan untuk acara-acara lain seperti pameran majlis berbuka puasa dan sebagainya. Terdapat juga kemudahan lain di masjid ini seperti bangunan pentadbiran, perpustakaan, pejabat imam dan bilal, bilik orang kenamaan, dewan syarahan dan juga Makam Pahlawan.\r\n\r\nMendekati konsep seni bina Islam, Masjid Negara turut dilengkapi dengan pokok-pokok hijau dan beberapa kolam air dan air pancutan yang bertujuan mengimbangi udara di persekitaran dan mengindahkan kawasan masjid.\r\n\r\nFungsi masjid tidak bertumpu kepada ibadah solat semata-mata. Kegiatan-kegiatan lain seperti pendidikan, ceramah dan muzakarah diadakan untuk semua lapisan masyarakat. Menurut pegawai masjid ini ada antara mereka yang pernah melawat masjid ini mendapat hidayah daripada Allah lalu memeluk Islam setelah teruja dengan keindahannya.",
    "directions": "Masjid Negara ini dibina di atas sebidang tanah berkeluasan 5.46 hektar. Kedudukannya bertentangan dengan stesen keretapi Kuala Lumpur. Berhampiran dengan bangunan ini juga, terdiri Kompleks Pusat Islam dan Muzium Kesenian Islam. Lokasinya sangat strategik dilengkapi dengan berbagai-bagai kemudahan dan berdekatan pula dengan stesen pengangkutan awam."
  }
}