{
  "w283cvp2m2": {
    "address": "Tasik Perdana, Kuala Lumpur, Wilayah Persekutuan, Malaysia 50480",
    "contact": "03-22740525",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.147626,
      "longitude": 101.688653
    },
    "name": "MASJID BUKIT AMAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "38c39358-b6a7-4d94-aff2-a4b61339144f",
    "geohash": "w283cvp2m2",
    "remarks": "Idea untuk mendirikan masjid ini timbul kira-kira tiga tahun yang lalu, di dalam satu majlis berbuka puasa di Surau Bukit Aman, di mana ketika itu hujan sedang turun dengan lebatnya. Tan Sri Samsuri Arshad (bekas Timbalan Ketua Polis Negara dan beberapa orang pegawai kanan sedang berbual-bual selepas berbuka puasa. Perbualan mereka telah terhenti seketika apabila titisan air hujan jatuh di atas meja di hadapan mereka. Pegawai-pegawai yang hadir seterusnya mengusulkan cadangan supaya sebuah surau baru dibina di ibu pejabat Polis Bukit Aman. Idea pembinaan surau yang sempurna ini telah dibawa ke pengetahuan Ketua Polis Negara. Ketua Polis Negara telahg memperakui betapa perlunya surau baru Bukit Aman dibina memandangkan surau yang sedia ada kecil dan usang. Pada 13 Jun 1995, Ketua Polis Negara telah berjumpa YAB Dato' Seri Dr. Mahathir Mohamad, Perdana Menteri di pejabat beliau, di Jabatan Perdana Menteri dan menerangkan betapa perlunya sebuah surau baru dibina di Bukit Aman. Perdana Menteri telah bersetuju dengan cadangan tersebut dan meluluskan bantuan kerajaan di dalam bentuk \"outright grant\" sebanyak RM4 juta. Seterusnya beliau menyarankan supaya surau tersebut dinaikkan tarafnya menjadi sebuah masjid.",
    "source_musolla_id": "MY-14-WKL-00055",
    "provision": "Kemudahan yang terdapat di masjid ini ialah Dewan Besar, Kelas Komputer, Kelas Pra-Sekolah, Kelas Agama, Pentas, Perpustakaan.",
    "directions": "Masjid ini berada Pengawal Pintu A IbuPejabat Polis Bukit Aman Kuala Lumpur dengan Pusat Rekreasi Taman Tasik Perdana, Bandaraya Kuala Lumpur."
  }
}