{
  "w283drcumw": {
    "address": "Salak Selatan, Kuala Lumpur, Wilayah Persekutuan, Malaysia 57100",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.119506,
      "longitude": 101.703081
    },
    "name": "MASJID PANGKALAN TUDM SUBANG",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "1f466cdf-130b-4918-9afd-2d5db3288a76",
    "geohash": "w283drcumw",
    "remarks": "Masjid ini asalnya adalah Madrasah dan dinaiktaraf menjadi Masjid. Ia dibina semula bagi mencatikkan dan membaik pulih. Masjid ini merupakan masjid utama untuk kakitangan TUDM menunaikan Solat Jumaat.",
    "source_musolla_id": "MY-10-PTG-00284",
    "provision": "Kemudahan yang terdapat pada masjid ini ialah tempat letak kereta, masjid yang berhawa dingin dan permaidani yang ditempah khas dari pereka tempatan."
  },
  "w283dwyq8c": {
    "address": "Taman Ikhsan, Cheras (Kuala Lumpur), Wilayah Persekutuan, Malaysia 56000",
    "contact": "03-9715381",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.114377,
      "longitude": 101.720048
    },
    "name": "MASJID AZ-ZUBAIR IBNU AWWAM",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "c3d9fec4-98e2-40ee-a09a-bdf776a2f20c",
    "geohash": "w283dwyq8c",
    "remarks": "Cetusan idea untuk mengujudkan sebuah masjid bagi kegunaan penduduk disini hasil dari perbincangan dikalangan penduduk digelanggang badminton pada tahun 1973. Peristiwa banjir besar yang dihadapi oleh penduduk disini dan keperluan untuk mengadakan masjid bagi keperluan penduduk setempat memberikan semangat yang kuat kepada mereka untuk berusaha membina sebuh masjid. Hasil dari muafakat masyarakat dan usaha gigih mereka, maka terbinalah sebuah madrasah yang dikenali sebagai Madrasah Muhammadiah. Kemudian ianya telah diubahsuai untuk dijadikan masjid yang dikenali sebagai Masjid Jamik Batu3 Jalan Cheras dan kini masjid ini telah bertukar nama kepada MASJID AZ-ZUBAIR IBNU AWWAM.",
    "source_musolla_id": "MY-14-WKL-00005",
    "provision": "Sebagai menepati kehendak sebuah masjid serba guna, beberapa kemudahan disediakan seperti tandas, dewan serbaguna, dewan kuliah dan perpustakaan kecil. Ruang solatnya dua tingkat membolehkan lebih ramai Jemaah yang boleh ditampung. Masjid ini juga mempunyai pejabat pentadbiran dan kelas TADIKA.  Bangsal memasak, bilik urusan jenazah dan dua buah van jenazah menonjolkan kepelbagaian kemudahan di masjid ini."
  },
  "w283dduf22": {
    "address": "Bandar Tun Razak, Cheras (Kuala Lumpur), Wilayah Persekutuan, Malaysia 56000",
    "contact": "03-91734728",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.091665,
      "longitude": 101.717967
    },
    "name": "MASJID SAIDINA OTHMAN IBNU AFFAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "24d33946-ea3c-4dc0-8b05-085936e2bbd6",
    "geohash": "w283dduf22",
    "remarks": "Masjid Saidina Othman Ibnu Affan telah mula dibina pada tahun 1984 dan siap dibina sepenuhnya pada tahun 1987. Masjid ini dibina adalah untuk menggantikan Surau Jumaat Hidayatul Islamiah yang mempunyai ruang solat  terhad serta tidak mampu untuk menampung jumlah jemaah yang hadir untuk solat berjemaah terutamanya ketika Solat Fardhu Jumaat dan Solat Sunat Hari Raya. Maka atas dasar keperluan itulah Masjid Saidina Othman Ibnu Affan ini dibina. Majoriti penduduk di kawasan kariah Masjid ialah kaum Melayu dan selebihnya adalah dari kaum Cina dan India.",
    "source_musolla_id": "MY-14-WKL-00016",
    "provision": "Antara kemudahan terdapat di masjid ini seperti Ruang dapur untuk urusan sajian dan dewan makan kepada orang ramai. Dewan Syarahan yang berhawa dingin boleh menampung seramai 300 orang peserta kursus/seminar. Dewan ini juga digunakan untuk Majlis Kebesaran Islam,majlis-majlis keraian \n                                       seperti kenduri kahwin, doa selamat dan lain-lain.\n\t\nSelain itu,ia juga mempunyai tapak pengurusan qurban dan bilik pengurusan jenazah yang lengkap di samping mempunyai tapak letak kereta yang luas serta bilik mesyuarat. Van masjid juga disediakan untuk urusan logistik dan penghantaran jenazah."
  },
  "w283ds046y": {
    "address": "Bandar Sri Permaisuri, 56000 Cheras (Kuala Lumpur), Wilayah Persekutuan, Malaysia 56000",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.098564,
      "longitude": 101.711551
    },
    "name": "MASJID AL-NAJIHIN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "a237d78b-bc49-4728-a0a9-9d01a8299e30",
    "geohash": "w283ds046y",
    "source_musolla_id": "MY-14-WKL-00057",
    "provision": "Antara kemudahan yang terdapat ialah ruang parkir, dewan dan ruang solat tiga tingkat yang selesa."
  },
  "w283d3rhdf": {
    "address": "Desa Petaling, Kuala Lumpur, Wilayah Persekutuan, Malaysia 57100",
    "contact": "03-90563851",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.083823,
      "longitude": 101.710178
    },
    "name": "MASJID AL-KHASYI'IN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "c8c5a3bb-dc86-4f7e-bdc7-077d9690c869",
    "geohash": "w283d3rhdf",
    "source_musolla_id": "MY-14-WKL-00040",
    "provision": "Antara kemudahan yang terdapat di masjid ini ialah ruang solat yang selesa untuk lelaki dan wanita, tempat wuduk, tempat letak kereta, stor,van jenazah,bilik mandi jenazah,dewan,pejabat,bilik mesyuarat,pondok pengawal di pintu masuk masjid dan masjid ini juga di lengkapi dengan kamera litar tertutup (CCTV )."
  }
}