{
  "w283f5cwkh": {
    "address": "Tasik Perdana, Kuala Lumpur, Wilayah Persekutuan, Malaysia 50480",
    "contact": "03-26937784",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.141812,
      "longitude": 101.691695
    },
    "name": "MASJID NEGARA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "22c6c01c-47e0-462e-837f-b90acfca1374",
    "geohash": "w283f5cwkh",
    "remarks": "Masjid Negara dibina sebagai tanda kesyukuran pemimpin dan rakyat atas kemerdekaan Tanah Melayu yang telah dicapai tanpa peperangan. Pembinaan masjid ini adalah atas cadangan Almarhum YTM Tunku Abdul Rahman Putra Al-Haj, Perdana Menteri Malaysia yang pertama. Ia menjadi lambang semangat perpaduan dan toleransi rakyat kerana melibatkan semua kaum pada ketika itu. Ini kerana selain daripada peruntukan wang kerajaan, kos pembiayaan membina Masjid Negara disumbangkan oleh rakyat jelata tanpa mengira kaum, agama dan bangsa. Nama masjid ini telah diberikan oleh YTM Tunku Abdul Rahman. Beliau tidak bersetuju masjid ini dinamakan dengan nama beliau seperti yang telah dicadangkan oleh banyak pihak.\r\n\r\nMasjid Negara telah siap dibina pada 27 Ogos 1965 dan menjadi lambang keagongan Islam di Malaysia. Ia boleh menampung seramai 15,000 jemaah.",
    "source_musolla_id": "MY-14-WKL-00001",
    "provision": "Ruang anjung dan serambi yang luas di masjid ini dapat menampung kebanjiran para jemaah pada masa solat Jumaat dan solat hari raya. Selain itu ia turut digunakan untuk acara-acara lain seperti pameran majlis berbuka puasa dan sebagainya. Terdapat juga kemudahan lain di masjid ini seperti bangunan pentadbiran, perpustakaan, pejabat imam dan bilal, bilik orang kenamaan, dewan syarahan dan juga Makam Pahlawan.\r\n\r\nMendekati konsep seni bina Islam, Masjid Negara turut dilengkapi dengan pokok-pokok hijau dan beberapa kolam air dan air pancutan yang bertujuan mengimbangi udara di persekitaran dan mengindahkan kawasan masjid.\r\n\r\nFungsi masjid tidak bertumpu kepada ibadah solat semata-mata. Kegiatan-kegiatan lain seperti pendidikan, ceramah dan muzakarah diadakan untuk semua lapisan masyarakat. Menurut pegawai masjid ini ada antara mereka yang pernah melawat masjid ini mendapat hidayah daripada Allah lalu memeluk Islam setelah teruja dengan keindahannya."
  },
  "w283fjk6nb": {
    "address": "Pusat Bandaraya, Kuala Lumpur, Wilayah Persekutuan, Malaysia 50000",
    "contact": "03-26912829",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.149301,
      "longitude": 101.695587
    },
    "name": "MASJID JAMEK sultan Abdul samad",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "102ab8aa-6d3e-4db2-93c8-6af64298577b",
    "geohash": "w283fjk6nb",
    "remarks": "Masjid Jamek ini terletak di Jalan Tun Perak, Kuala Lumpur. Ia telah dibuka dengan rasminya oleh Sultan Selangor, Sultan Alauddin Sulaiman Shah. Masjid yang tertua di Wilayah Persekutuan ini mendapat tumpuan orang ramai di sekitar pusat bandar. Sejak tahun 1979 Masihi, kerja-kerja pemulihan dan pembesarannya telah dijalankan sehingga 10 Mei 1983 Masihi yang melibatkan pembesaran masjid ke peringkat optimum tanpa mengubah reka bentuk asalnya.\r\n\r\nPembinaan masjid ini hanya mengambil masa selama sembilan bulan dan kosnya telah dibiayai oleh kerajaan dan sumbangan orang ramai. Memandangkan ia menjadi tumpuan ramai, beberapa tahun kemudian pihak kerajaan telah membesarkan ruang masjid ini serta dilengkapi dengan permaidani dan lampu-lampu hiasan. Kerja-kerja pembesaran masjid ini dilakukan pada tahun 1979 Masihi. Kemudian sekali lagi masjid ini diperbaiki pada tahun 1993 Masihi akibat keruntuhan salah sebuah kubahnya. Pada tanggal 23 jun 2017 dengan rasminya masjid ini telah ditukarkan nama dengan nama baru iaitu masjid jamek sultan abdul samad kuala lumpur yang telah dimashurkan oleh kebawah duli yang maha mulia tuanku syarifuddin SHAH ibni almarhum sultan abdul aziz shah sultan selangor.\r\nReka",
    "source_musolla_id": "MY-14-WKL-00051",
    "provision": "1. tEMPAT WUDUK YANG BERSIH DAN TANDAS YANG SELESA.  \r\n2. GALERI YANG MENEMPATKAN GAMBAR-GAMBAR DAN BERITA MENGENAI MASJID SULTAN ABDUL SAMAD.\r\n3. BERDEKATAN DENGAN PERHENTIAN LRT DAN DATARAN MERDEKA. \r\n4. MEMPUNYAI JAMBATAN YANG MERENTASI SUNGAI GOMBAK DARI MASJID KE DATARAN MERDEKA."
  },
  "w2839rssxf": {
    "address": "Taman Bukit Pantai, Kuala Lumpur, Wilayah Persekutuan, Malaysia 59800",
    "contact": "03-79317786",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.118158,
      "longitude": 101.663016
    },
    "name": "MASJID AR-RAHMAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "228cd9d1-f113-4a71-90bb-ba4c8f5bfc44",
    "geohash": "w2839rssxf",
    "remarks": "Cadangan Tengku Abdul Rahman Perdana Menteri Malaysia dikala itu agar kerajaan membina sebuah masjid di Universiti Malaya untuk mahasiswa mengerjakan ibadat, terutamanya solat jumaat telah menjadi kenyataan. Kini ianya bukan saja digunakan oleh mahasiswa Universiti Malaya, tetapi menjadi tumpuan masyarakat sekitarnya, umpamanya Kampong Kerinchi, warga kerja Telekom, dll.",
    "source_musolla_id": "MY-14-WKL-00030",
    "provision": "Antara kemudahan yang terdapat dimasjid ini ialah ruang parkir dan solat yang selesa."
  },
  "w283927y7e": {
    "address": "Jalan Taman Seri Sentosa, Taman Seri Sentosa, 58200 Kuala Lumpur, Wilayah Persekutuan, Malaysia 58200",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.078638,
      "longitude": 101.661801
    },
    "name": "MASJID JAMEK PETALING",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "62cd6837-4aaa-42a2-99bb-29099fc05b46",
    "geohash": "w283927y7e",
    "remarks": "Masjid ini telah lama dibina dikawasan perumahan ini diatas tanah yang diwakafkan. masjid pertama yang dibina disini tidak beroperasi dari 1996 hingga 2006.  tetapi kembali beroperasi pada February 2005.",
    "source_musolla_id": "MY-14-WKL-00042",
    "provision": "Antara kemudahan yang terdapat ialah ruang solat yang berhawa dingin dan  ruangan dapur."
  },
  "w283h1xvun": {
    "address": "Kajang, Selangor, Malaysia 43000",
    "contact": "013-7228082",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 2.997541,
      "longitude": 101.788168
    },
    "name": "MASJID JAMEK PEKAN KAJANG",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "f377191e-4c1e-47bb-ba98-f524fef3ecfd",
    "geohash": "w283h1xvun",
    "remarks": "Masjid ini adalah dibina pada tahun 60an apabila ujudnya bandar Kajang dan keperluan ibadah bagi masyarakat Kajang. Masjid ini telah dirasmikan oleh  DYMM Sultan Sallehuddin Abd Aziz Shah Alhaj pada tanggal 14 May 1971.",
    "source_musolla_id": "MY-10-HL-00035",
    "provision": "Antara kemudahan yang terdapat ialah  ruang parking yang luas,  van jenazah,  ruangan solat yang selesa untuk sembahyang, perpustakaan, rumah pegawai , deretan kedai  dan khidmat insuran."
  },
  "w28394esv1": {
    "address": "Seksyen 3, Petaling Jaya, Selangor, Malaysia 46000",
    "contact": "0192213907",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.090729,
      "longitude": 101.650539
    },
    "name": "MASJID JAMEK SULTAN ABDUL AZIZ",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "8b649ada-f7e3-4958-832d-c83d9eafc0fe",
    "geohash": "w28394esv1",
    "source_musolla_id": "MY-10-PTG-00264",
    "provision": "Antara kemudahan yang terdapat ialah ruang parkir, pejabat , dewan dan ruang solat yang selesa."
  },
  "w28305ukwh": {
    "address": "Taman Puchong Indah, Puchong, Selangor, Malaysia 47150",
    "contact": "0193567133",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.009675,
      "longitude": 101.607666
    },
    "name": "MASJID AS-SALAM",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "3b8d3b30-adef-4bfb-b136-966995a7ba9b",
    "geohash": "w28305ukwh",
    "remarks": "Masjid ini terletak di Taman Puchong Perdana, Puchong. Masjid ini telah dirasmikan oleh Yang Teramat Mulia Sultan Sarafuddin Idris Shah Al-Haj ibni Al-Marhum Sultan Salahuddin Abdul Aziz Shah Al-Haj Sultan Selangor pada 17 Zulkaedah 1427 Hijri bersamaan 8 Disember 2006 Masihi.",
    "source_musolla_id": "MY-10-PTG-00375",
    "provision": "Terdapat pelbagai kemudahan disediakan seperti dewan solat lelaki di tingkat bawah dan dewan solat wanita di tingkat atas, tempat berwudhuk dan pejabat untuk kakitangan masjid bertugas."
  },
  "w2838h2v5u": {
    "address": "SS 5C, Taman Seaport, Petaling Jaya, Selangor, Malaysia 47301",
    "contact": "03-78760550",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.100399,
      "longitude": 101.602764
    },
    "name": "MASJID NURUL YAQIN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "4cfde093-194b-4eb5-8f19-46c98e7299e1",
    "geohash": "w2838h2v5u",
    "source_musolla_id": "MY-10-PTG-00363",
    "provision": "Antara kemudahan yang terdapat ialah kemudahan Bank Islam, ruang solat yang luas dan berhawa dingin,van jenazah,pejabat,ruang mesyuarat,bilik iman dan bilik bilal serta kemudahan lain."
  },
  "w2838wxfb1": {
    "address": "Seksyen 13, Petaling Jaya, Selangor, Malaysia 46200",
    "contact": "0192409933",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.112359,
      "longitude": 101.634183
    },
    "name": "MASJID TUN ABD. AZIZ",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "ae282d49-3311-4401-b1de-79fdc489f6f9",
    "geohash": "w2838wxfb1",
    "remarks": "Masjid ini terletak di Seksyen 14, daerah Petaling Jaya. Ia dibina pada 7 Rabiulawal 1397 Hijri bersamaan 25 Februari 1977 Masihi. Masjid ini agak popular sejak ia dibuka sehinggalah ke hari ini. Reka bentuknya yang unik dan berbentuk bulat ini menjadikan ia terkenal dengan gelaran Masjid Bulat Seksyen 14. Lokasinya yang terletak berhampiran kawasan perumahan, perniagaan dan industri memberi kemudahan kepada warga Islam menunaikan solat dan terlibat dengan aktiviti masjid.",
    "source_musolla_id": "MY-10-PTG-00265",
    "provision": "Antara kemudahan yang disediakan oleh masjid ini selain dewan solat lelaki dan wanita, ialah dewan untuk melaksanakan aktiviti masjid selain ruang untuk pendidikan peringkat tadika, pengajian fardu ain dan program-program keagamaan."
  },
  "w283drcumw": {
    "address": "Salak Selatan, Kuala Lumpur, Wilayah Persekutuan, Malaysia 57100",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.119506,
      "longitude": 101.703081
    },
    "name": "MASJID PANGKALAN TUDM SUBANG",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "1f466cdf-130b-4918-9afd-2d5db3288a76",
    "geohash": "w283drcumw",
    "remarks": "Masjid ini asalnya adalah Madrasah dan dinaiktaraf menjadi Masjid. Ia dibina semula bagi mencatikkan dan membaik pulih. Masjid ini merupakan masjid utama untuk kakitangan TUDM menunaikan Solat Jumaat.",
    "source_musolla_id": "MY-10-PTG-00284",
    "provision": "Kemudahan yang terdapat pada masjid ini ialah tempat letak kereta, masjid yang berhawa dingin dan permaidani yang ditempah khas dari pereka tempatan."
  },
  "w2836rtmqs": {
    "address": "Bandar Tasik Selatan, 57000 Kuala Lumpur, Wilayah Persekutuan, Malaysia 57000",
    "contact": "03-90585390",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.074352,
      "longitude": 101.707935
    },
    "name": "MASJID JAMEK IBNU KHALDUN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "cff54731-ad68-45d2-b303-1f6debd057b4",
    "geohash": "w2836rtmqs",
    "source_musolla_id": "MY-14-WKL-00033",
    "provision": "Antara kemudahannya ialah ruang solat yang selesa dan tempat wudhuk"
  },
  "w2838hsdj9": {
    "address": "SS 3, Taman Sentosa, Petaling Jaya, Selangor, Malaysia 47300",
    "contact": "0123735671",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.101244,
      "longitude": 101.607988
    },
    "name": "MASJID AL - HIDAYAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "a350dcd0-416c-4ffc-8709-3d1b2ea5022b",
    "geohash": "w2838hsdj9",
    "source_musolla_id": "MY-10-PTG-00273",
    "provision": "Antara kemudahan yang terdapat ialah ruang solat atas dan bawah, pejabat, dewan al hidayah, van jenazah, bilik iman dan bilal."
  },
  "w283c9g06m": {
    "address": "Bangsar Baru, 59100 Kuala Lumpur, Wilayah Persekutuan, Malaysia 59100",
    "contact": "03-22833707",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.129803,
      "longitude": 101.671704
    },
    "name": "MASJID SAIDINA ABU BAKAR AS-SIDDIQ",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "e8b2ab69-a8ee-470e-ba81-3b93fbd6282f",
    "geohash": "w283c9g06m",
    "remarks": "Projek pembinaan masjid yang terletak di Bangsar ini telah dimulakan pada 18 Julai 1980. Majlis penentuan arah kiblatnya pula telah dilaksanakan pada 24 Ogos 1980 oleh Tan Sri Sheikh Abdul Mohsein bin Haji Salleh, Mufti Wilayah Persekutuan. Peletakan batu asas masjid disempurnakan oleh Datuk Amar Haji Abdul Taib bin Mahmud, Menteri Wilayah Persekutuan pada 23 November 1980. Bangunan masjid ini siap sepenuhnya pada bulan Mac 1982.",
    "source_musolla_id": "MY-14-WKL-00006",
    "provision": "Masjid ini mempunyai dewan solat yang selesa, sekolah agama dan parkir."
  },
  "w283fwgkmc": {
    "address": "KLCC, Kuala Lumpur, Wilayah Persekutuan, Malaysia 50450",
    "contact": "03-23801293",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.157935,
      "longitude": 101.716143
    },
    "name": "MASJID ASY-SYAKIRIN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "45fffebf-9cba-4ea1-bbcd-2b70132bc866",
    "geohash": "w283fwgkmc",
    "remarks": "Masjid Dalam Taman\r\n\r\nMasjid ini dibina pada tahun 1996 Masihi, dan menjadi antara mercu tanda di Kuala Lumpur Conference Centre (KLCC) selain daripada menara berkembarnya. Ia dibina di atas tapak berkeluasan kira-kira seratus ekar. Masjid ini dibina dan diselenggarakan oleh pihak pengurusan KLCC, manakala pengurusan aktiviti dan pengajian di masjid diselia oleh Jabatan Agama Islam Wilayah Persekutuan.",
    "source_musolla_id": "MY-14-WKL-00023",
    "provision": "1. TANDAS DAN TEMPAT WUDUK YANG LUAS DAN SELESA BERTARAF 5 BINTANG.\r\n2. RUANG SOLAT UTAMA BERHAWA DINGIN DAPAT MENAMPUNG 16 RIBU JEMAAH.\r\n3. SKRIM MAKLUMAT LED.\r\n4. PEJABAT DAN BILIK MESYUARAT YANG SELESA.\r\n5. DEWAN SERBAGUNA."
  },
  "w283f7ek2y": {
    "address": "Pusat Bandaraya, Kuala Lumpur, Wilayah Persekutuan, Malaysia 50000",
    "contact": "019-8362993",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.140109,
      "longitude": 101.704942
    },
    "name": "MASJID AL-BUKHARY",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "794dd9eb-021a-49c9-903f-1f557ab41044",
    "geohash": "w283f7ek2y",
    "remarks": "Pembangunan masjid ini adalah untuk menggantikan Surau Babul Jannah yang telah berusia 147 tahun dan telah pun dimakan usia. Masjid ini kemudian telah dinamakan sebagai Masjid AlBukhary mengambil sempena nama keluarga Pengasas Yayasan AlBukhary. Masjid ini dibina di atas tapak seluas 1 ekar di Lot 192, Seksyen 56, Mukim Bandar Kuala Lumpur. Asalnya adalah tanah surau lama dan sebahagiannya tapak perkuburan Islam yang diwakafkan oleh DYMM Sultan Selangor iaitu Almarhum Sultan Abdul Samad pada tahun 1860. Almarhum Baginda Sultan telah mengamanahkan Allahyarham Syed Lal Shah Albukhary untuk membangunkan serta menjaga surau ini yang telah diberi nama Babul Jannah.",
    "source_musolla_id": "MY-14-WKL-00038"
  },
  "w283fjugyr": {
    "address": "Pusat Bandaraya, Kuala Lumpur, Wilayah Persekutuan, Malaysia 50000",
    "contact": "03-26921009",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.152386,
      "longitude": 101.696252
    },
    "name": "MASJID INDIA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "ea8c7132-81be-41bc-b465-01cccd6173be",
    "geohash": "w283fjugyr",
    "remarks": "Masjid India pula sangat popular di kalangan peniaga India Muslim di Jalan Masjid India. Masjid ini dibina pada 3 Jamadillawal 1382 bersamaan 10 September 1964 Masihi. Pada mulanya ia dikenali dengan nama Masjid India Selatan. Masjid ini tidak putus-putus dikunjungi oleh masyarakat muslim di ibu kota dan juga musafir.\r\n\r\nSeperti Masjid Jamek juga, Masjid India memainkan peranan penting sebagai pusat ibadah di tengah-tengah kesibukan pusat perniagaan terkenal ini. Masjid ini akan sesak dengan jemaah apabila waktu solat Jumaat. Oleh kerana masjid ini digunakan oleh berbagai-bagai bangsa yang menganut agama Islam, khutbah Jumaat dibacakan di dalam tiga bahasa, iaitu bahasa Urdu, bahasa Inggeris dan bahasa Melayu.",
    "source_musolla_id": "MY-14-WKL-00009"
  },
  "w283ghe49c": {
    "address": "Desa Pandan, Kuala Lumpur, Wilayah Persekutuan, Malaysia 55100",
    "contact": "03-92841013",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.145273,
      "longitude": 101.737601
    },
    "name": "MASJID AR-RAHIMAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "2ecec10e-fee0-4bd5-a06a-0d1f945a71db",
    "geohash": "w283ghe49c",
    "source_musolla_id": "MY-14-WKL-00048",
    "provision": "1. ruang parkir dan solat yang SELESA.\r\n2. wATERCOOLER.\r\n3.bILIK wUIDUK oku.\r\n4.bILIK NIKAH.\r\n5. BILIK SEMINAR."
  },
  "w283cvp2m2": {
    "address": "Tasik Perdana, Kuala Lumpur, Wilayah Persekutuan, Malaysia 50480",
    "contact": "03-22740525",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.147626,
      "longitude": 101.688653
    },
    "name": "MASJID BUKIT AMAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "38c39358-b6a7-4d94-aff2-a4b61339144f",
    "geohash": "w283cvp2m2",
    "remarks": "Idea untuk mendirikan masjid ini timbul kira-kira tiga tahun yang lalu, di dalam satu majlis berbuka puasa di Surau Bukit Aman, di mana ketika itu hujan sedang turun dengan lebatnya. Tan Sri Samsuri Arshad (bekas Timbalan Ketua Polis Negara dan beberapa orang pegawai kanan sedang berbual-bual selepas berbuka puasa. Perbualan mereka telah terhenti seketika apabila titisan air hujan jatuh di atas meja di hadapan mereka. Pegawai-pegawai yang hadir seterusnya mengusulkan cadangan supaya sebuah surau baru dibina di ibu pejabat Polis Bukit Aman. Idea pembinaan surau yang sempurna ini telah dibawa ke pengetahuan Ketua Polis Negara. Ketua Polis Negara telahg memperakui betapa perlunya surau baru Bukit Aman dibina memandangkan surau yang sedia ada kecil dan usang. Pada 13 Jun 1995, Ketua Polis Negara telah berjumpa YAB Dato' Seri Dr. Mahathir Mohamad, Perdana Menteri di pejabat beliau, di Jabatan Perdana Menteri dan menerangkan betapa perlunya sebuah surau baru dibina di Bukit Aman. Perdana Menteri telah bersetuju dengan cadangan tersebut dan meluluskan bantuan kerajaan di dalam bentuk \"outright grant\" sebanyak RM4 juta. Seterusnya beliau menyarankan supaya surau tersebut dinaikkan tarafnya menjadi sebuah masjid.",
    "source_musolla_id": "MY-14-WKL-00055",
    "provision": "Kemudahan yang terdapat di masjid ini ialah Dewan Besar, Kelas Komputer, Kelas Pra-Sekolah, Kelas Agama, Pentas, Perpustakaan."
  },
  "w2839mxze9": {
    "address": "Taman Desa Kerinchi, Kuala Lumpur, Wilayah Persekutuan, Malaysia 59200",
    "contact": "03-22828912",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.107681,
      "longitude": 101.667296
    },
    "name": "MASJID AL-IKHLASIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "690eb9ba-2154-4255-b3d1-f75dadbd4b64",
    "geohash": "w2839mxze9",
    "remarks": "Masjid Al-Ikhlasiah ini pada asalnya hanya sebuah surau kecil yang didirikan pada tahun 1819 oleh sekumpulan peneroka rakyat Indonesia dari Kerinchi, Sumatera sebagai tempat solat dan beribadat. Berdasarkan cerita orang tua, surau ini dibina dekat pintu gerbang; sempadan Kuala Lumpur-Selangor, kemudian ia dipindahkan ke kawasan ladang getah, tidak jauh dari tapak masjid sekarang bagi memberi laluan kepada pembinaan jalan. Selepas kerajaan mengambil tanah kawasan itu pada tahun 1915, surau ini sekali lagi dipindahkan ke tapak sekarang (masjid). Sebagaimana masa pantas berlalu meninggalkan kita, begitu juga dengan kehidupan manusia; berubah serta bertambah dari hari ke hari yang menuntut ahli jawatankuasa surau berbuat sesuatu agar surau yang sedia ada menjadi lebih luas dan selesa untuk menampung keperluan jemaah. Lantaran itu, pada tahun 1984 dengan hasil usaha Datok Empat iaitu Ketua Kampung di situ atau nama sebenarnya Hj. Akasah b. Ahad, bangunan surau itu telah diubahsuai dan diperbesarkan menjadi sebuah madrasah manakala setahun selepas itu, ia diberi tauliah oleh Majlis Agama Islam Wilayah Persekutuan sebagai tempat bersolat Jumaat. Pada 6hb Disember 1994, permohonan untuk pembinaan masjid di atas tapak Madrasah Al-Ikhlasiah telah diluluskan oleh Majlis Agama Islam Wilayah Persekutuan. Ekoran daripada itu, tanggal 27hb Ogos 2001 madrasah yang selama ini dimakmur dan dibangun sendiri oleh penduduk setempat akhirnya telah diroboh bagi mendirikan sebuah masjid dengan dibiayai sepenuhnya oleh pihak kerajaan.",
    "source_musolla_id": "MY-14-WKL-00037"
  },
  "w2838q8gdy": {
    "address": "SS 2, Petaling Jaya, Selangor, Malaysia 46300",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.112514,
      "longitude": 101.613707
    },
    "name": "MASJID AMINAH AL - MUHAIRI",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "47e549ad-fd34-44fa-93d5-086579032e47",
    "geohash": "w2838q8gdy",
    "remarks": "Masjid ini dibina pada tahun 1978 hasil dari sumbangan orang ramai dan sebahagian besarnya adalah dibiayai oleh Syeikh Said al-Khutaibi, Menteri dari Abu Dhabi. Ianya telah dirasmikan oleh Tuan Syeikh Said al-Khutaibi pada 11 April 1980.  jais.",
    "source_musolla_id": "MY-10-PTG-00275",
    "provision": "Antara kemudahan ialah perpustakaan, bilik mesyuarat, rumah imam, bilik kuliah dan bilik pengurusan jenazah."
  },
  "w2830m8z62": {
    "address": "Taman Perindustrian Utama, Puchong, Selangor, Malaysia 47100",
    "contact": "0122009467",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.01974,
      "longitude": 101.613683
    },
    "name": "MASJID BATU 12 PUCHONG",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "f852c25a-3aa1-4f63-91e9-0c1b6373cc65",
    "geohash": "w2830m8z62",
    "source_musolla_id": "MY-10-PTG-00293",
    "provision": "Masjid ini menyediakan air-cond bagi keselesaan jemaah ketika beribadat. Kuliah-kuliah masjid diadakan pada hari-hari yang tertentu."
  },
  "w283090cfg": {
    "address": "Kampung Baru Puchong, Puchong, Selangor, Malaysia 47100",
    "contact": "0193576326",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 2.994091,
      "longitude": 101.62469
    },
    "name": "MASJID JAMEK BATU 14 PUCHONG",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "f7b92f79-ec61-43d1-ad4f-5a195691fc3a",
    "geohash": "w283090cfg",
    "source_musolla_id": "MY-10-PTG-00292",
    "provision": "Antara kemudahan yang terdapat ialah ruang solat,ruang wuduk, parking,bilik bilal dan lain lain."
  },
  "w2838mj310": {
    "address": "SS 1, Kampung Tunku, Petaling Jaya, Selangor, Malaysia 47300",
    "contact": "012-4991448",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.103814,
      "longitude": 101.619806
    },
    "name": "MASJID AR -RAHMAN KG. TUNKU",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "7802f37d-f503-4b00-aef7-b832ee4a7713",
    "geohash": "w2838mj310",
    "remarks": "Sebelum pembinaan masjid,penduduk menggunakan balai islam untuk solat iaitu pada tahun 1977. Pembinaan masjid ini 100 meter dari balai islam.dibina di atas tanah koperasipengawai kerajaan yang diwakafkan.telah diserahkan secara rasmi kepada JAIS pada julai 2003.",
    "source_musolla_id": "MY-10-PTG-00276",
    "provision": "Kemudahan yang terdapat ialah gymnasium,meja ping pong, bilik ceramah, bilik mesyuarat, kedai runcit, dewan serbaguna, stor, perpustakaan, quarters dan bilik urus jenazah."
  },
  "w28388ex9d": {
    "address": "PJS 2, Taman Sri Medan, Petaling Jaya, Selangor, Malaysia 46000",
    "contact": "0173863896",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.080219,
      "longitude": 101.628414
    },
    "name": "MASJID NURUL EHSAN TAMAN MEDAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "b2d46417-6b75-4f60-9968-e4edd6a213e1",
    "geohash": "w28388ex9d",
    "source_musolla_id": "MY-10-PTG-00268",
    "provision": "Antara kemudahan ialah ruang solat berhawa dingin, ruang wuduk,kediaman iman,bilik bilal,bilik pengurusan jenazah, van jenazah,bilik mesyuarat,dapur dan sebagainya."
  },
  "w2832fr6x3": {
    "address": "Seksyen 5, Bandar Kinrara, Puchong, Selangor, Malaysia 47180",
    "contact": "0126664952",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.045025,
      "longitude": 101.644791
    },
    "name": "MASJID AL - EHSAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "b787c8a9-5707-4b03-8042-df88923e8a40",
    "geohash": "w2832fr6x3",
    "source_musolla_id": "MY-10-PTG-00294",
    "provision": "Antara kemudahan yang terdapat disini ialah dean, ruang parkir dan ruang solat yang selesa."
  },
  "w28384ch6f": {
    "address": "SS 7, Petaling Jaya, Selangor, Malaysia 47300",
    "contact": "0192254510",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.09202,
      "longitude": 101.603064
    },
    "name": "MASJID NURUL YAQIN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "b0a22ebf-e995-4568-b84d-a41f5f750947",
    "geohash": "w28384ch6f",
    "source_musolla_id": "MY-10-PTG-00260"
  },
  "w28307kbpn": {
    "address": "Kampung Bunga Melor, Batu 14, Puchong, Selangor, Malaysia 47100",
    "contact": "0192117899",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.006168,
      "longitude": 101.619377
    },
    "name": "MASJID DARUSSALAM",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "8d690ca6-0967-43e6-956d-56b2050cc923",
    "geohash": "w28307kbpn",
    "source_musolla_id": "MY-10-PTG-00385"
  },
  "w2832pu1dz": {
    "address": "PJS 10, Taman Seri Subang, Petaling Jaya, Selangor, Malaysia 46150",
    "contact": "0193016394",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.075095,
      "longitude": 101.607183
    },
    "name": "MASJID AL -HUSNA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "28c30cc3-8814-42cb-8677-3ba170bb8636",
    "geohash": "w2832pu1dz",
    "remarks": "Perancangan pembinaan masjid ini diluluskan pada tahun 1999. Masjid ini dibina di atas tanah rizab di kawasan zon 24, Petaling Jaya Selatan.  Ianya dirasmikan oleh DYMM Sultan Sharafuddin Idris Shah pada 26/10/2004.",
    "source_musolla_id": "MY-10-PTG-00259",
    "provision": "Antara kemudahan yang terdapat ialah dewan syarahan, ruang solat, perpustakaaan, bilik pengurusan jenazah,HPA halal mart, ruang makan terbuka dan landskap."
  },
  "w2834ds09m": {
    "address": "Seri Kembangan, Selangor, Malaysia 43300",
    "contact": "0172686842",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.002127,
      "longitude": 101.71698
    },
    "name": "MASJID JAMEK QARYAH SERDANG (MASJID UPM)",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "f978235b-b9b0-4341-a94c-4f8f2f6fda2a",
    "geohash": "w2834ds09m",
    "source_musolla_id": "MY-10-PTG-00290",
    "provision": "Parkir masjid amat luas. Kuliah-kuliah agama diadakan pada hari-hari- yang tertentu oleh pihak berkuasa masjid."
  },
  "w283gkd8vq": {
    "address": "Kampung Pandan Dalam, Ampang, Selangor, Malaysia 68000",
    "contact": "013-3639167",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.145,
      "longitude": 101.74805
    },
    "name": "MASJID NURUL HIDAYAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "4b6f6232-ebfd-4e4d-97af-804878fbadfe",
    "geohash": "w283gkd8vq",
    "remarks": "Pada asalnya ia merupakan sebuah surau kampong Pandan Dalam dan tarikh pembukaan surau ini pada tahun 1960-an. Kos pembinaan masjid ini adalah sebanyak RM 1,947,937.70. Kos pembinaan masjid ini dibiayai oleh kerajaan negeri Selangor dan sumbangan orang ramai. Masjid ini dapat menampung kapisiti jemaah sebanyak 3275 orang dalam satu masa.",
    "source_musolla_id": "MY-10-HL-00006",
    "provision": "Antara kemudahan yang terdapat pada masjid ini ialah kemudahan internet percuma,projector dan skrin untuk paparan, rumah iman dan bilal, kemudahan mesin air mineral, kemudahan cuci kereta, badan khairat kematian, kemudahan van jenazah dan juga bilik pengurusan jenazah"
  },
  "w283gd2epy": {
    "address": "Pandan Indah, Selangor, Malaysia 55100",
    "contact": "019-3557986",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.133024,
      "longitude": 101.7564
    },
    "name": "MASJID AL - AZIM",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "81efeb70-347a-4a3f-b0f4-3269be1b83fa",
    "geohash": "w283gd2epy",
    "remarks": "Pada awalnya ia merupakan tapak bekas lombong dan dimiliki oleh Majlis Agama Islam Selangor.Ianya dibuka pada tahun 2001 dan dapat menampung kapasiti jemaah seramai 5000 orang dalam satu masa.",
    "source_musolla_id": "MY-10-HL-00011",
    "provision": "Antara kemudahan yang terdapat pada masjid ini ialah dewan solat lelaki dan perempuan, tandas,kemudahan internet percuma, sistem penghawa dingin,kelas pengajian pondok,bilik mesyuarat, bazaar untuk disewa,badan khairat kematian, van jenazah,pejabat dan kelas serta dewan pengajian"
  },
  "w283gyqcdr": {
    "address": "Bukit Indah, Ampang, Selangor, Malaysia 68000",
    "contact": "0342911923",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.154749,
      "longitude": 101.775731
    },
    "name": "MASJID BUKIT INDAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "769b07df-fedb-459c-b9cb-08cd75e2ddb1",
    "geohash": "w283gyqcdr",
    "remarks": "Masjid ini telah dirasmikan oleh DYMM Sultan Selangor pada 18 april 2008",
    "source_musolla_id": "MY-10-GBK-00066",
    "provision": "Antara kemudahan yang terdapat di masjid ini ialah ruang solat yang selesa untuk lelaki dan wanita, tempat wuduk, tempat letak kereta, stor,rumah  imam dan bilal, bilik kuliah, CCTV, sudut bacaan, van jenazah,gelanggang silat, dapur serta bilik jenazah."
  },
  "w283ffw19u": {
    "address": "Jalan Perkasa, Taman Maluri, 55100 Kuala Lumpur, Wilayah Persekutuan, Malaysia 55100",
    "contact": "03-92812472",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.134131,
      "longitude": 101.730734
    },
    "name": "MASJID AL-IMAM ASH-SHAFIE",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "efeb086a-440f-4cc5-b202-7ea63debc238",
    "geohash": "w283ffw19u",
    "remarks": "Bangunan utama masjid serta bangunan-bangunan annexnya dibina atas Lot No. P.T. 1674 Jalan Perkasa, Taman Maluri, Kuala Lumpur yang luasnya kira-kira 1.9 ekar. Pembinaan masjid ini  dimulakan pada tahun 1987 dan siap serta boleh digunakan pada bulan Oktober, 1993",
    "source_musolla_id": "MY-14-WKL-00004",
    "provision": "Terdapat pelbagai kemudahan disediakan oleh pihak masjid seperti kuarters, Dewan Seri Perkasa,bilik kuliah dan perpustakaan. Tandas, tempat berwuduk, bilik pengurusan jenazah, bilik mesyuarat dan dapur juga disediakan untuk kegunaan ramai."
  },
  "w2838c4hm5": {
    "address": "Taman Dato Harun, Petaling Jaya, Selangor, Malaysia 46150",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.082416,
      "longitude": 101.637492
    },
    "name": "MASJID JUMHURIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "76708e37-1e26-4a36-9a7b-bd06e7c1b72a",
    "geohash": "w2838c4hm5",
    "source_musolla_id": "MY-10-PTG-00267",
    "provision": "Antara kemudahan yang terdapat di masjid ini ialah ruang solat yang selesa untuk lelaki dan wanita, tempat wuduk, tempat letak kereta, stor,van jenazah, mandi jenazah,bilik kuliah, pejabat dan juga bilik mesyuarat. Terdapat juga sebuah kedai runcit di dalam kawasan masjid."
  },
  "w2835neegw": {
    "address": "Taman Taming Jaya, Balakong, Selangor, Malaysia 43300",
    "contact": "012-2846156",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.024666,
      "longitude": 101.738364
    },
    "name": "MASJID TAMING JAYA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "75d1f637-5337-4871-940e-8d6f0f548d02",
    "geohash": "w2835neegw",
    "source_musolla_id": "MY-10-HL-00023",
    "provision": "Antara kemudahan yang terdapat ialah  ruang parkir yang luas,  landskap yang cantik dan  ruangan solat yang luas.,"
  },
  "w283b9tvk2": {
    "address": "Seksyen 17A, Petaling Jaya, Selangor, Malaysia 46400",
    "contact": "0136794181",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.12926,
      "longitude": 101.631616
    },
    "name": "MASJID AR - RAHMAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "678a728d-71cd-4b63-a89c-5cb9362735cf",
    "geohash": "w283b9tvk2",
    "source_musolla_id": "MY-10-PTG-00271",
    "provision": "Antara kemudahan yang terdapat ialah ruang solat,bilik bilal,dapur,stor,ruang wuduk dan lain-lain"
  },
  "w283bqge5g": {
    "address": "Pinggir Taman Tun Dr. Ismail, Kuala Lumpur, Wilayah Persekutuan, Malaysia 60000",
    "contact": "03-77282127",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.157731,
      "longitude": 101.617525
    },
    "name": "MASJID AL-GHUFRAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "3d588ddf-7b05-4b2f-a482-36131e722de4",
    "geohash": "w283bqge5g",
    "remarks": "Masjid Al-Ghufran telah didaftarkan dengan nama Surau Balai Islam di bawah pengawasan Jabatan Agama Islam Wilayah Persekutuan (JAWI) pada 6 April 1993. Hasil sumbangan orang ramai dan golongan korporat, bermula tahun 1998, surau Balai aIslam telah diubahsuai selaras dengan peningkatan peranannya. Ianya berfungsi bukan sahaja sebagai tempat solat malah lengkap dengan kemudahan seperti Sekolah Rendah Agama Balai Islam (SERAMBI), kamar musafir, dewan konferen, pejabat pentadbiran, bilik mesyuarat serta cafe. Pada 4 April 2000, Surau Balai Islam telah dinaik taraf menjadi masjid dan diberi nama Masjid Al-Ghufran. \"Al-Ghufran\" bermaksud \"KEAMPUNAN\" adalah nama yang diberikan oleh YBhg Datuk Mohd Hashim bin Yahaya, Mufti Wilayah Persekutuan ketika itu.",
    "source_musolla_id": "MY-14-WKL-00036",
    "provision": "Kemudaha yang terdapat dimasjid ini ialah kamar musafir (ala hotel), dewan solat, dewan jamuan, dewan cafe al-ghufran, bilik Balqis, dewan konferen dan bilik mesyuarat."
  },
  "w283bsu86n": {
    "address": "Taman Tun Dr. Ismail, Kuala Lumpur, Wilayah Persekutuan, Malaysia 60000",
    "contact": "03-77293710",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.14629,
      "longitude": 101.62981
    },
    "name": "MASJID AT-TAQWA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "eab858e1-bcc8-4d0b-a1cf-eee3f5f2eea4",
    "geohash": "w283bsu86n",
    "remarks": "Pada asalnya tahun 80an, sebuah surau didirikan dikawasan perumahan Taman Tun Dr. Ismail untuk kegunaan penduduk mengerjakan ibadah dan sembahyang jumaat. Setelah Taman Tun mengalami perubahan yang hebat dimana banyak kawasan perumahan baru telah dibuka dan pejabat-pejabat telah diadakan disini, maka pihak pengurusan surau telah membina sebuah masjid yang letaknya 1000m daripada surau ini yang indah ini.",
    "source_musolla_id": "MY-14-WKL-00007",
    "provision": "Mempunyai bangunan khas sebagai pusat perniagaan dimana terdapat 2 tingkat bangunan yang dipenuhi dengan deretan kedai untuk umat islam berniaga. Di bangunan yang sama juga terdapat kafe tempat para jemaah untuk bersantai setelah beribadah. Masjid ini juga menyediakan tempat parkir yang luas."
  },
  "w2839ecjph": {
    "address": "Pantai Dalam, Kuala Lumpur, Wilayah Persekutuan, Malaysia 59200",
    "contact": "03-22834592",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.097654,
      "longitude": 101.669163
    },
    "name": "MASJID JAMEK AL-KHADIJIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "c845b94c-9ed1-4b09-97cc-477e80777f9d",
    "geohash": "w2839ecjph",
    "source_musolla_id": "MY-14-WKL-00018",
    "provision": "Kemudahan yang terdapat di masjid ini ialah deretan rumah kedai memudahkan umat islam untuk menjamu selera setelah menunaikan solat terutamanya solat jumaat bagi kaum lelaki yang bekerja. Juga terdapat deretan pejabat-pejabat di sebelah kanan masjid."
  },
  "w283cjqzne": {
    "address": "Bukit Damansara, Kuala Lumpur, Wilayah Persekutuan, Malaysia 50490",
    "contact": "03-20954457",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.150179,
      "longitude": 101.655066
    },
    "name": "MASJID SAIDINA UMAR AL-KHATTAB",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "409a4647-f1ab-42ba-8338-77bbaa6e14b7",
    "geohash": "w283cjqzne",
    "source_musolla_id": "MY-14-WKL-00028",
    "provision": "Mempunyai deretan rumah untuk kakitangan masjid, beserta tapak niaga pada hari jumaat bagi umat islam berniaga dan kawasan TEMPAT LETAK KERETA yang luas. MASJID INI JUGA ADA MENYEDIAKAN PERKHIDMATAN SEWAAN PENGINAPAN (6 UNIT), DEWAN SERBAGUNA (KENDURI KAHWIN/PROGRAM)DAN MELAYARI INTERNET SECARA PERCUMA OLEH TM."
  },
  "w2839vpmpk": {
    "address": "Taman Desa, Kuala Lumpur, Wilayah Persekutuan, Malaysia 58100",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.104521,
      "longitude": 101.688741
    },
    "name": "MASJID AL-MUHSININ",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "672ca16f-e6ff-459a-bef2-f17aaa009bdc",
    "geohash": "w2839vpmpk",
    "source_musolla_id": "MY-14-WKL-00039",
    "provision": "Masjid ini mempunyai Sekolah Rendah Agama Almuhsinin serta rumah bagi kakitangan masjid.  Ruang letak kereta sebanyak 30 buah kereta.Masjid ini juga menyediakan WIFI kepada pengunjungnya.\n\nPihak masjid juga menyediakan dewan serbaguna yang boleh dijadikan majlis perkahwinan dan majlis lain yang berkenaan usaha murni kominiti setempat."
  },
  "w2838jv6n9": {
    "address": "SS 4A, Petaling Jaya, Selangor, Malaysia 47301",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.10811,
      "longitude": 101.609053
    },
    "name": "MASJID AL - EHSAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "aec8bdc3-56d3-4e57-aedf-29101a74bc85",
    "geohash": "w2838jv6n9",
    "remarks": "Pada asalnya,ia hanya adalah sebuah surau yang dibina dari papan.Kemudian ianya berpindah ke tempat baru untuk dibina masjid. Masjid ini telah dibina hasil dari sumbangan kerajaan negeri dan sumbangan orang ramai. Pembinaannya bermula pada 1984 dan telah siap digunakan pada tahun 1986. Bersesuaian dengan keperluan semasa maka ianya telah dinaiktaraf untuk dijadikan masjid untuk solat jumaat pada tahun 2002.",
    "source_musolla_id": "MY-10-PTG-00274",
    "provision": "Kemudahan yang terdapat di masjid ini ialah bilik serbaguna,bilik imam,perpustakaan, CCTV,ruang makan dan computer. Ruang solatnya dilengkapi alat penghawa dingin untuk keselesaan pengunjungnya."
  },
  "w28383g6j2": {
    "address": "SS 9, Petaling Jaya, Selangor, Malaysia 47300",
    "contact": "0126676917",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.086129,
      "longitude": 101.617248
    },
    "name": "MASJID AR - RAHMAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "f782341a-e65c-4597-8de9-15d9008f026e",
    "geohash": "w28383g6j2",
    "source_musolla_id": "MY-10-PTG-00263",
    "provision": "Antara kemudahan yang terdapat ialah ruang parkir, dewan, pejabat dan ruang solat yang selesa."
  },
  "w2832rfkw6": {
    "address": "PJS 6, Kg. Lindungan, Petaling Jaya, Selangor, Malaysia 46150",
    "contact": "0192753538",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.075584,
      "longitude": 101.615915
    },
    "name": "MASJID AL - ISLAMIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "09d4b6c9-be37-4110-9626-e8bbe6abc734",
    "geohash": "w2832rfkw6",
    "remarks": "Pada asalnya adalah sebuah surau yang dibina pada tahun 1987 dan telah dinaik taraf sebagai masjid pada tahun 1998. Kini, masjid ini sedang diperbesarkan dan masih lagi dalam peringkat pembinaan.",
    "source_musolla_id": "MY-10-PTG-00262",
    "provision": "Antara kemudahan ialah penghawa dingin,van jenazah,ruang solat dan tempat wuduk."
  },
  "w28386eexd": {
    "address": "SS 9A, Petaling Jaya, Selangor, Malaysia 47300",
    "contact": "0192336296",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.090519,
      "longitude": 101.617687
    },
    "name": "MASJID AL-RIDHWANI",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "15e2bb6a-4926-4494-8b8d-96bd2a6158c5",
    "geohash": "w28386eexd",
    "source_musolla_id": "MY-10-PTG-00272",
    "provision": "Antara kemudahan yang terdapat ialah ruang dsolat berhawa dingin, ruang wuduk,van jenazah,bilik iman dan bilal dan sebagainya."
  },
  "w2838bqf1z": {
    "address": "PJS 15, Taman Petaling Utama, Petaling Jaya, Selangor, Malaysia 46000",
    "contact": "0133016325",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.077931,
      "longitude": 101.643874
    },
    "name": "MASJID AS-SALAM",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "d3f9b9cb-c470-4d4d-9c4c-72b97f956a9f",
    "geohash": "w2838bqf1z",
    "source_musolla_id": "MY-10-PTG-00376"
  },
  "w283b68puz": {
    "address": "Kampung Sungai Kayu Ara, Petaling Jaya, Selangor, Malaysia 47400",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.135221,
      "longitude": 101.612763
    },
    "name": "MASJID AL - MAKMURIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "cbb3adad-c9ba-4296-a4ac-aad10fd0f4b9",
    "geohash": "w283b68puz",
    "source_musolla_id": "MY-10-PTG-00278",
    "provision": "Antara kemudahan yang terdapat dimasjid ini ialah dewan, ruang parkir dan ruang solat yang selesa."
  },
  "w2834k5ysu": {
    "address": "Seri Kembangan, Selangor, Malaysia 43300",
    "contact": "0132607446",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.011393,
      "longitude": 101.705795
    },
    "name": "MASJID RIADHUS SOLIHIN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "5e7981a0-6b44-4fa1-97b7-db6a2856b6bc",
    "geohash": "w2834k5ysu",
    "source_musolla_id": "MY-10-PTG-00301",
    "provision": "Antara kemudahan yang terdapat di masjid ini menpuyai kemudahan asas seperti masjid-masjid lain seperti ruang solat,ruang wuduk,ruang parking,bilik bilal,tandas dan sebagainya."
  },
  "w2838e6kqv": {
    "address": "Kampung Baiduri, 46100 Petaling Jaya, Selangor, Malaysia 46100",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.094785,
      "longitude": 101.626917
    },
    "name": "MASJID DATO' KAMARUDDIN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "169b1fc0-af02-43d8-b534-4b737f18d252",
    "geohash": "w2838e6kqv",
    "source_musolla_id": "MY-10-PTG-00266",
    "provision": "Antara kemudahan ialah ruang parkir, pejabat dan ruang solat yang selesa."
  },
  "w2838zv4r9": {
    "address": "Petaling Jaya, Selangor, Malaysia 46200",
    "contact": "0123307028",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.119136,
      "longitude": 101.64172
    },
    "name": "MASJID KOLEJ ISLAM",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "159f5d95-fe85-4def-b492-d6c19e5a7a95",
    "geohash": "w2838zv4r9",
    "source_musolla_id": "MY-10-PTG-00269",
    "provision": "Antara kemudahan yang terdapat ialaha bilik iman dan bilal,ruang solat,tempat wuduk,bilik mesyuarat,dapur,stor,bilik seminar dan sebagainya."
  },
  "w28363fnvy": {
    "address": "Seri Kembangan, Selangor, Malaysia 43300",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.043031,
      "longitude": 101.703435
    },
    "name": "MASJID AL - ISLAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "fa55180a-4e91-4c67-851b-3579408d7c99",
    "geohash": "w28363fnvy",
    "source_musolla_id": "MY-10-PTG-00300",
    "provision": "Antara kemudahan yang terdapat disini ialah kawasan parkir yang luas dan ruang solat yang selesa."
  },
  "w28325745r": {
    "address": "Jalan Industri USJ 1/10, Taman Perindustrian USJ 1, 47600 Subang Jaya, Selangor, Malaysia 47600",
    "contact": "0122407550",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.050464,
      "longitude": 101.605827
    },
    "name": "MASJID AL-IRSYAD",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "6c1cb981-f751-44c4-968d-c297e84e9c5b",
    "geohash": "w28325745r",
    "remarks": "Masjid ini merupakan masjid pertama di USJ 1. Ia dibina untuk menampung jemaah yang pesat bertambah berikutan dari surau yang sedia ada tidak dapat menampung kapasiti penduduk.",
    "source_musolla_id": "MY-10-PTG-00383",
    "provision": "Masjid ini mempunyai ruang yang luas, bilik mandi, bilik tetamu dan juga ruang pejabat."
  },
  "w28396jcq9": {
    "address": "Taman Gasing Indah, Kuala Lumpur, Wilayah Persekutuan, Malaysia 46000",
    "contact": "03-77701171",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.08738,
      "longitude": 101.664677
    },
    "name": "MASJID ABDUL RAHMAN BIN AUF",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "df3da540-66af-43d1-ac9f-c78599aa7275",
    "geohash": "w28396jcq9",
    "source_musolla_id": "MY-14-WKL-00020",
    "provision": "Antara kemudahan yang terdapat dimasjid ini ialah dewan serbaguna yang besar, ruang parkir khas untuk OKU, pengurusan jenazah dan Sekolah Rendah Agama Al-ihsaniah.\r\n\r\nProgram pengajian dan tazkirah harian  juga diatur rapi untuk ahli jemaah"
  },
  "w2835vythm": {
    "address": "Cheras, Selangor, Malaysia 43200",
    "contact": "012-6863103",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.020757,
      "longitude": 101.775476
    },
    "name": "MASJID KARIAH SG. SEKAMAT",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "67fbff71-0dbc-429e-962d-e4c2be214584",
    "geohash": "w2835vythm",
    "remarks": "Masjid ini telah dibina pada 1965 dan dibaik pulih serta diperbesarkan lebih kurang 10 tahun yang lepas.",
    "source_musolla_id": "MY-10-HL-00020",
    "provision": "Masjid ini mempunyai tandas dan tempat berwuduk untuk kaum lelaki dan perempuan. Ia juga mempunyai tempat meletak motosikal berbumbung."
  },
  "w283e8948e": {
    "address": "Cheras, Selangor, Malaysia 43200",
    "contact": "019-2358044",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.079369,
      "longitude": 101.756771
    },
    "name": "MASJID AL - AMIN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "a1ea5c78-40ea-4869-91eb-606b5759aa24",
    "geohash": "w283e8948e",
    "remarks": "Hasrat untuk membina sebuah masjid di Markas Briged Tengah Pasukan Gerakan Am (PGA) sebenarnya telah dirancang sejak bermulanya perpindahan Markas Briged Tengah dari Jalan Pekeliling (Jalan Tun Razak ) ke tempat penempatan tetap Markas Briged di Batu 7, Cheras iaitu pada 1981. Keinginan bagi memiliki sebuah masjid di markas ini telah timbul sekian lama oleh warga kem PGA, setelah Batalion dari ibu pejabat selesai berpindah ke kem baru ini pada tahun 1983.\n\nKetika itu, untuk menunaikan solat dan mengerjakan ibadat dan melaksanakan aktiviti keagamaan briged terpaksa menggunakan ruang tingkat bawah blok kuarters anggota yang dijadikan surau sementara Briged Tengah. Kapasiti ruang di blok sementara itu agak terhad untuk menampung bilangan Jemaah yang ramai.\n\nHasil usaha semua pihak, akhirnya pada penghujung 1995 barulah projek pembinaannya mula dapat dilaksanaknan. Pembinaan masjid ini yang menelan belanja RM2.4 juta siap sepenuhnya dan diserahkan kepada Briged  ini pada 28Mei1997 dan telah digunakan bermula pada 26 Jun 1997. Masjid ini telah didaftarkan dengan Jabatan Agama Islam Selangor pada 28 Jun 1997.",
    "source_musolla_id": "MY-10-HL-00022",
    "provision": "Bilik Pengurusan Jenazah berhawa dingin, dewan serbaguna, lot tempat letak kenderaan."
  },
  "w283s6u49j": {
    "address": "Kampung Sungai Serai, Hulu Langat, Selangor, Malaysia 43100",
    "contact": "019-6315808",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.091737,
      "longitude": 101.793871
    },
    "name": "MASJID AL - EHSAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "d56f6c8f-4451-4b89-b352-ba6d38b32712",
    "geohash": "w283s6u49j",
    "remarks": "PEMBINAAN MASJID INI DILAKUKAN OLEH J.K.R. KAJANG PADA SEKITAR TAHUN 60-AN. ATAS USAHA YB. DATO ABD JALIL(ADUN) DUSUN TUA MASJID INI DIPERBAIKI  TAHUN DEMI TAHUN BEBERAPA PERUBAHAN TELAH DILAKUKAN BERSESUAIAN DENGAN KAPASITI JEMAAH KAMPUNG YANG SEMAKIN RAMAI. MASJID INI TELAH DILANDA BANJIR SEJAK TAHUN 80-AN HINGGA SEKARANG. DALAM TAHUN 2011, SEBANYAK 3 KALI BANJIR TELAH MELANDA MASJID INI SETINGGI 1 METER DAN MENGAKIBATKAN PERMAIDANI TELAH DIGANTI BEBERAPA KALI.",
    "source_musolla_id": "MY-10-HL-00014",
    "provision": "MASJID INI MEMPUNYAI KEMUDAHAN :\n1)\tBEKALAN ELEKTRIK\n2)\tBEKALAN AIR\n3)\tPENGHAWA DINGIN\n4)\tTEMPAT MANDI JENAZAH\n5)\tTEMPAT KULIAH"
  },
  "w283u5rq67": {
    "address": "34 Jalan 10, Kampung Lembah Jaya, 68000 Ampang, Selangor, Malaysia 68000",
    "contact": "016-6030430",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.139059,
      "longitude": 101.787402
    },
    "name": "MASJID AL - AMAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "c2227cdf-caa5-45a6-923b-42079a2f8c06",
    "geohash": "w283u5rq67",
    "source_musolla_id": "MY-10-HL-00009",
    "provision": "Masjid ini mengadakan kuliah agama pada hari yang tertentu. Selain itu, ruang parkir masjid luas bagi memudah orang ramai untuk meletakkan kereta."
  },
  "w283gtuk6j": {
    "address": "Kampung Melayu Ampang, Ampang, Selangor, Malaysia 68000",
    "contact": "017-2087755",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.152461,
      "longitude": 101.761304
    },
    "name": "MASJID JAMI'IL HUDA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "5272afd8-795e-49b7-9322-ffd6785354e9",
    "geohash": "w283gtuk6j",
    "remarks": "Masjid ini dirasmikan oleh DYMM Sultan Salahudin Abdul Aziz Shah Alhaj pada 13 Januari 1984.",
    "source_musolla_id": "MY-10-HL-00008",
    "provision": "Antara kemudahan masjid ini ialah dewan solat lelaki dan perempuan, bilik iman dan bilal, bilik mesyuarat dan pejabat, dewan makan dan dapur, tandas lelaki dan wanita, rumah iman, bilik pengurusan jenazah dan van jenazah serta lot kedai di kawasan masjid."
  },
  "w283k0s9bx": {
    "address": "Cheras, Selangor, Malaysia 43200",
    "contact": "019-2136033",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.035315,
      "longitude": 101.78355
    },
    "name": "MASJID TAMAN RAKAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "ccc468c8-92b9-4300-9a06-a0be3c36b5e9",
    "geohash": "w283k0s9bx",
    "remarks": "Bermula dengan sumbangan orang ramai mendirikan sebuah surau dan selepas itu memohon kepada JAIS untuk jadikan surau solat jumaat. Pada  tahun 2006 dapat kelulusan dari ICU/JPM peruntukan untuk membina masjid.",
    "source_musolla_id": "MY-10-HL-00033",
    "provision": "Antara kemudahan ialah penghawa dingin,ruang solat,stor dan kemudahan wifi."
  },
  "w283gbgc2z": {
    "address": "Pandan Indah, Selangor, Malaysia 55100",
    "contact": "019-2864301",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.12449,
      "longitude": 101.771542
    },
    "name": "MASJID AL - UBUDIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "dae9bea8-d900-48ec-a4be-c4b050d04d1f",
    "geohash": "w283gbgc2z",
    "remarks": "Masjid ini dibina pada tahun 1984 dan telah dirasmikan pada 16 oktober 1987 oleh DYMM Sultan Selangor.",
    "source_musolla_id": "MY-10-HL-00007",
    "provision": "Antara kemudahan yang terdapat di masjid ini ialah tempat letak kereta, sistem hawa dingin, bilik mesyuarat, 3 unit rumah kedai untuk disewa,kemudahan tandas, dapur untuk memasak, kemudahan CCTV, van jenazah dan skrin putih serta projector."
  },
  "w283s6u49e": {
    "address": "Kampung Sungai Serai, Hulu Langat, Selangor, Malaysia 43100",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.091724,
      "longitude": 101.793893
    },
    "name": "MASJID JAMEK SG. SERAI KUANG",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "e92fdcd6-acb2-4793-b049-3f4445f9535f",
    "geohash": "w283s6u49e",
    "remarks": "Masjid ini dibina bersebelahan dengan surau lama sungai serai. Ia dibina kerana surau lama tidak lagi dapat menampung kapasiti jemaah penduduk kampung.",
    "source_musolla_id": "MY-10-GBK-00045",
    "provision": "Antara kemudahan yang terdapat di masjid ini ialah ruang solat yang berhawa dingin, ruang letak kereta, stor, bilik bilal serta dewan utama untuk penduduk kampung."
  },
  "w283eqndw5": {
    "address": "Pandan Indah, Selangor, Malaysia 55100",
    "contact": "013-2823079",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.10958,
      "longitude": 101.753571
    },
    "name": "MASJID NURUSAADAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "adab3d77-3a01-4ad6-9246-839eaa99726e",
    "geohash": "w283eqndw5",
    "remarks": "Masjid ini adalah masjid moden yang dibina untuk masyarakat Taman Cheras Baru dan penduduk disekitarnya pada tahun 80an seawal penempatan penduduk disini . Masjid ini telah dirasmikan oleh DYMM Sultan Sallehuddin Abd Azizi Ahah Alhaj pada tanggal 30 Oktober 1987.",
    "source_musolla_id": "MY-10-HL-00010",
    "provision": "Antara kemudahan yang terdapat ialah  ruang parking yang luas,  van jenazah,  ruangan solat yang selesa untuk sembahyang, rumah pegawai , perpustakaan desa dan gelanggang badminton."
  },
  "w2837jwrkg": {
    "address": "Taman Alam Damai, Cheras (Kuala Lumpur), Wilayah Persekutuan, Malaysia 56000",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.063703,
      "longitude": 101.742193
    },
    "name": "MASJID AL-MUKHLISIN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "3aa3ea7b-896a-4bad-9645-9abbaeadafc2",
    "geohash": "w2837jwrkg",
    "remarks": "Masjid Al-Mukhlisin telah dirasmikan pada 27 Ogos 2010 oleh Yang di-Pertuan Agong, Tuanku Sultan Mizan Zainal Abidin. Turut hadir ialah Menteri di Jabatan Perdana Menteri, Datuk Seri Jamil Khir Baharom.",
    "source_musolla_id": "MY-14-WKL-00058",
    "provision": "Antara kemudahan yang terdapat ialah  ruang parkir yang luas,  van jenazah dan urusan jenazah dan  ruangan solat yang luas, rumah pegawai dan pondok keselamatan."
  },
  "w2833pey9k": {
    "address": "PJS 3, Taman Sri Manja, 46000 Petaling Jaya, Selangor, Malaysia 46000",
    "contact": "019-3037197",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.074567,
      "longitude": 101.650718
    },
    "name": "MASJID AL-IMAM AT-TIRMIZI",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "80ec4fe9-9816-4d9d-bd5c-9cbcbff6d543",
    "geohash": "w2833pey9k",
    "remarks": "Masjid ini telah dibina pada awal tahun 2005 dan dibawah kelolaan Jabatan Agama Islam Wilayah Persekutuan (JAWI).",
    "source_musolla_id": "MY-14-WKL-00044",
    "provision": "Antara kemudahan yang terdapat ialah  ruang parkir yang luas,  van jenazah dan urusan jenazah dan  ruangan solat yang luas dan rumah pegawai masjid."
  },
  "w2832u9w19": {
    "address": "Jalan Puchong, Taman Bukit Kuchai, 47190 Puchong, Selangor, Malaysia 47190",
    "contact": "0122122635",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.057985,
      "longitude": 101.636656
    },
    "name": "MASJID AL - AMIN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "0b37d385-3204-4ac3-b975-a3f31d80a06a",
    "geohash": "w2832u9w19",
    "source_musolla_id": "MY-10-PTG-00297",
    "provision": "Antara kemudahan yang terdapat ialah alat penghawa dingin dan  ruangan solat yang selesa."
  },
  "w2837y6m69": {
    "address": "Cheras, Selangor, Malaysia 43200",
    "contact": "019-2457296",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.067466,
      "longitude": 101.769565
    },
    "name": "MASJID UBUDIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "1fb505fe-2da7-4dec-a521-60ce3e135ab4",
    "geohash": "w2837y6m69",
    "remarks": "Masjid ini dibina pada tahun 60an dan dirasmikan oleh DYTM Tengku Idris Shah, Pemangku Raja Selangor pada tanggal 27/12/1974.",
    "source_musolla_id": "MY-10-HL-00018",
    "provision": "Antara kemudahan yang terdapat ialah  ruang parkir, bilik perpustakaan dan dewan pelbagai guna."
  },
  "w283dwyq8c": {
    "address": "Taman Ikhsan, Cheras (Kuala Lumpur), Wilayah Persekutuan, Malaysia 56000",
    "contact": "03-9715381",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.114377,
      "longitude": 101.720048
    },
    "name": "MASJID AZ-ZUBAIR IBNU AWWAM",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "c3d9fec4-98e2-40ee-a09a-bdf776a2f20c",
    "geohash": "w283dwyq8c",
    "remarks": "Cetusan idea untuk mengujudkan sebuah masjid bagi kegunaan penduduk disini hasil dari perbincangan dikalangan penduduk digelanggang badminton pada tahun 1973. Peristiwa banjir besar yang dihadapi oleh penduduk disini dan keperluan untuk mengadakan masjid bagi keperluan penduduk setempat memberikan semangat yang kuat kepada mereka untuk berusaha membina sebuh masjid. Hasil dari muafakat masyarakat dan usaha gigih mereka, maka terbinalah sebuah madrasah yang dikenali sebagai Madrasah Muhammadiah. Kemudian ianya telah diubahsuai untuk dijadikan masjid yang dikenali sebagai Masjid Jamik Batu3 Jalan Cheras dan kini masjid ini telah bertukar nama kepada MASJID AZ-ZUBAIR IBNU AWWAM.",
    "source_musolla_id": "MY-14-WKL-00005",
    "provision": "Sebagai menepati kehendak sebuah masjid serba guna, beberapa kemudahan disediakan seperti tandas, dewan serbaguna, dewan kuliah dan perpustakaan kecil. Ruang solatnya dua tingkat membolehkan lebih ramai Jemaah yang boleh ditampung. Masjid ini juga mempunyai pejabat pentadbiran dan kelas TADIKA.  Bangsal memasak, bilik urusan jenazah dan dua buah van jenazah menonjolkan kepelbagaian kemudahan di masjid ini."
  },
  "w283dduf22": {
    "address": "Bandar Tun Razak, Cheras (Kuala Lumpur), Wilayah Persekutuan, Malaysia 56000",
    "contact": "03-91734728",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.091665,
      "longitude": 101.717967
    },
    "name": "MASJID SAIDINA OTHMAN IBNU AFFAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "24d33946-ea3c-4dc0-8b05-085936e2bbd6",
    "geohash": "w283dduf22",
    "remarks": "Masjid Saidina Othman Ibnu Affan telah mula dibina pada tahun 1984 dan siap dibina sepenuhnya pada tahun 1987. Masjid ini dibina adalah untuk menggantikan Surau Jumaat Hidayatul Islamiah yang mempunyai ruang solat  terhad serta tidak mampu untuk menampung jumlah jemaah yang hadir untuk solat berjemaah terutamanya ketika Solat Fardhu Jumaat dan Solat Sunat Hari Raya. Maka atas dasar keperluan itulah Masjid Saidina Othman Ibnu Affan ini dibina. Majoriti penduduk di kawasan kariah Masjid ialah kaum Melayu dan selebihnya adalah dari kaum Cina dan India.",
    "source_musolla_id": "MY-14-WKL-00016",
    "provision": "Antara kemudahan terdapat di masjid ini seperti Ruang dapur untuk urusan sajian dan dewan makan kepada orang ramai. Dewan Syarahan yang berhawa dingin boleh menampung seramai 300 orang peserta kursus/seminar. Dewan ini juga digunakan untuk Majlis Kebesaran Islam,majlis-majlis keraian \n                                       seperti kenduri kahwin, doa selamat dan lain-lain.\n\t\nSelain itu,ia juga mempunyai tapak pengurusan qurban dan bilik pengurusan jenazah yang lengkap di samping mempunyai tapak letak kereta yang luas serta bilik mesyuarat. Van masjid juga disediakan untuk urusan logistik dan penghantaran jenazah."
  },
  "w283ds046y": {
    "address": "Bandar Sri Permaisuri, 56000 Cheras (Kuala Lumpur), Wilayah Persekutuan, Malaysia 56000",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.098564,
      "longitude": 101.711551
    },
    "name": "MASJID AL-NAJIHIN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "a237d78b-bc49-4728-a0a9-9d01a8299e30",
    "geohash": "w283ds046y",
    "source_musolla_id": "MY-14-WKL-00057",
    "provision": "Antara kemudahan yang terdapat ialah ruang parkir, dewan dan ruang solat tiga tingkat yang selesa."
  },
  "w283b7mu8m": {
    "address": "SS 21, Damansara Utama, Petaling Jaya, Selangor, Malaysia 47400",
    "contact": "0377280120",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.13877,
      "longitude": 101.620464
    },
    "name": "MASJID AL - MUJAHIDEEN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "aa69d0de-33af-4840-b3bb-3158a61a5f56",
    "geohash": "w283b7mu8m",
    "remarks": "Pada asalnya adalah dibina sebuah surau oleh penduduk tempatan. Kemudiannya surau itu telah diperbesarkan pembinaannya dan dijadikan masjid dengan menggunakan sumber dana yang dikumpulkan oleh penduduk setempat. Masjid ini telah diambilalih oleh kerajaan negeri Selangor selama 9 tahun dan dipulangkan semula kepada ahli qaryah.",
    "source_musolla_id": "MY-10-PTG-00270",
    "provision": "Antara kemudahan-kemudahan yang terdapat pada masjid ini adalah ruang solat yang berhawa dingin, kemudahan internet, bilik mandi jenazah,ruang solat,projector dan skrin serta pejabat dan bilik mesyuarat."
  },
  "w28376c15u": {
    "address": "Cheras, Selangor, Malaysia 43200",
    "contact": "012-2917885",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.047526,
      "longitude": 101.745924
    },
    "name": "MASJID AL - IKHWANIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "f9029d93-b428-4758-8eef-53e761810398",
    "geohash": "w28376c15u",
    "remarks": "Sejarah masjid ini ringkas sahaja kerana ia baru sahaja dibina atas keperluan setempat pada tahun 2004.",
    "source_musolla_id": "MY-10-HL-00034",
    "provision": "Antara kemudahan yang disediakan seperti tandas yang bersih,tempat mengambil wuduk serta bilik mandi yang luas.\n\nMasjid ini juga mempunyai sebuah van jenazah dan bilik pengurusan jenazah dan memiliki ruang solat yang selesa"
  },
  "w2833yz8jf": {
    "address": "Bandar Baru Sri Petaling, Kuala Lumpur, Wilayah Persekutuan, Malaysia 57000",
    "contact": "03-90570162",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.069317,
      "longitude": 101.68902
    },
    "name": "MASJID JAMEK BANDAR BARU SERI PETALING",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "5b5608ea-5f47-450a-a47a-ca1b888fd584",
    "geohash": "w2833yz8jf",
    "source_musolla_id": "MY-14-WKL-00011",
    "provision": "Antara kemudahan yang terdapat di masjid ini ialah ruang solat yang selesa untuk lelaki dan wanita, tempat wuduk, tempat letak kereta, stor,bilik kariah ,pejabat ,bilik mesyuarat,mandi jenazah,van jenazah dan terdapat juga lot-lot kedai didalam kawasan masjid."
  },
  "w283d3rhdf": {
    "address": "Desa Petaling, Kuala Lumpur, Wilayah Persekutuan, Malaysia 57100",
    "contact": "03-90563851",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.083823,
      "longitude": 101.710178
    },
    "name": "MASJID AL-KHASYI'IN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "c8c5a3bb-dc86-4f7e-bdc7-077d9690c869",
    "geohash": "w283d3rhdf",
    "source_musolla_id": "MY-14-WKL-00040",
    "provision": "Antara kemudahan yang terdapat di masjid ini ialah ruang solat yang selesa untuk lelaki dan wanita, tempat wuduk, tempat letak kereta, stor,van jenazah,bilik mandi jenazah,dewan,pejabat,bilik mesyuarat,pondok pengawal di pintu masuk masjid dan masjid ini juga di lengkapi dengan kamera litar tertutup (CCTV )."
  },
  "w2836xtxgb": {
    "address": "Bandar Tasik Selatan, 57000 Kuala Lumpur, Wilayah Persekutuan, Malaysia 57000",
    "contact": "03-91725357",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.074759,
      "longitude": 101.719147
    },
    "name": "MASJID AL-MUQARRABIN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "6947cfef-8d86-4c7c-ada9-8eb47df41591",
    "geohash": "w2836xtxgb",
    "remarks": "Masjid ini dibina apabila terbinanya penempatan baru Bandar Tasek Selatan untuk kemudahan umat islam disini mengerjakan ibadah.",
    "source_musolla_id": "MY-14-WKL-00041",
    "provision": "Masjid ini mempunyai 3 aras dewan solat utama untuk lelaki dan perempuan serta dewan solat tambahan di sebelah luarnya . Selain itu , terdapat juga bilik imam/bilal , bilik stor , pejabat , bilik mesyuarat , dapur , 2 van jenazah,mandi jenazah,tandas vvip,wakaf tempat wudhuk lelaki dan wanita .\n\nDi bahagian luar masjid terdapat beberapa ruang letak kereta khas pegawai masjid berbumbung serta garaj untuk motosikal dan basikal . Ruang letak kereta terbuka pula mampu meletakkan lebih 20 kereta dalam satu-satu masa dalam kawasan masjid sahaja."
  },
  "w283fdv18b": {
    "address": "Pudu, Kuala Lumpur, Wilayah Persekutuan, Malaysia 55100",
    "contact": "03-92848584",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.135482,
      "longitude": 101.718332
    },
    "name": "MASJID JAMEK ALAM SHAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "195cc608-1227-4b0f-b392-67919b51ca6e",
    "geohash": "w283fdv18b",
    "remarks": "Masjid ini adalah sebuah masjid yang agak lama dibina di Kuala Lumpur. Masjid ini pernah dilawat oleh Yang Mulia Sultan Brunai sewaktu rombongan diraja datang ke Malaysia untuk menyaksikan sambutan hari kemerdekaan. Rombongan diraja ini juga telah datang untuk menunaikan solat Jumaat di masjid ini.",
    "source_musolla_id": "MY-14-WKL-00056",
    "provision": "Masjid ini mempunyai dewan solat utama untuk lelaki dan perempuan serta dewan solat tambahan di sebelah luarnya . Kitab suci Al-Quran diletakkan di setiap sudut .\r\n\r\nSelain itu , terdapat juga bilik imam/bilal , bilik stor , pejabat , bilik mesyuarat , dapur ,van jenazah ,mandijenazah  dan tempat wudhuk lelaki dan wanita .. \r\n\r\nDi bahagian luar masjid terdapat beberapa ruang letak kereta khas pegawai masjid berbumbung serta garaj untuk motosikal dan basikal"
  },
  "w283fqg2tt": {
    "address": "KLCC, Kuala Lumpur, Wilayah Persekutuan, Malaysia 50450",
    "contact": "03-77277401",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.157314,
      "longitude": 101.705147
    },
    "name": "MASJID JAMEK TG. ABD. AZIZ SHAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "eb0aa137-2a0a-43b5-a886-9171b154819e",
    "geohash": "w283fqg2tt",
    "source_musolla_id": "MY-14-WKL-00021"
  },
  "w283enej9f": {
    "address": "Kampung Bukit, 56000 Cheras (Kuala Lumpur), Wilayah Persekutuan, Malaysia 56000",
    "contact": "03-22422255",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.112834,
      "longitude": 101.737601
    },
    "name": "MASJID AR-RAHAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "6e81a0ba-ea2c-4fb6-9dbb-35753f312d44",
    "geohash": "w283enej9f",
    "source_musolla_id": "MY-14-WKL-00059"
  }
}