{
  "w283f5cwkh": {
    "address": "Tasik Perdana, Kuala Lumpur, Wilayah Persekutuan, Malaysia 50480",
    "contact": "03-26937784",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.141812,
      "longitude": 101.691695
    },
    "name": "MASJID NEGARA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "22c6c01c-47e0-462e-837f-b90acfca1374",
    "geohash": "w283f5cwkh",
    "remarks": "Masjid Negara dibina sebagai tanda kesyukuran pemimpin dan rakyat atas kemerdekaan Tanah Melayu yang telah dicapai tanpa peperangan. Pembinaan masjid ini adalah atas cadangan Almarhum YTM Tunku Abdul Rahman Putra Al-Haj, Perdana Menteri Malaysia yang pertama. Ia menjadi lambang semangat perpaduan dan toleransi rakyat kerana melibatkan semua kaum pada ketika itu. Ini kerana selain daripada peruntukan wang kerajaan, kos pembiayaan membina Masjid Negara disumbangkan oleh rakyat jelata tanpa mengira kaum, agama dan bangsa. Nama masjid ini telah diberikan oleh YTM Tunku Abdul Rahman. Beliau tidak bersetuju masjid ini dinamakan dengan nama beliau seperti yang telah dicadangkan oleh banyak pihak.\r\n\r\nMasjid Negara telah siap dibina pada 27 Ogos 1965 dan menjadi lambang keagongan Islam di Malaysia. Ia boleh menampung seramai 15,000 jemaah.",
    "source_musolla_id": "MY-14-WKL-00001",
    "provision": "Ruang anjung dan serambi yang luas di masjid ini dapat menampung kebanjiran para jemaah pada masa solat Jumaat dan solat hari raya. Selain itu ia turut digunakan untuk acara-acara lain seperti pameran majlis berbuka puasa dan sebagainya. Terdapat juga kemudahan lain di masjid ini seperti bangunan pentadbiran, perpustakaan, pejabat imam dan bilal, bilik orang kenamaan, dewan syarahan dan juga Makam Pahlawan.\r\n\r\nMendekati konsep seni bina Islam, Masjid Negara turut dilengkapi dengan pokok-pokok hijau dan beberapa kolam air dan air pancutan yang bertujuan mengimbangi udara di persekitaran dan mengindahkan kawasan masjid.\r\n\r\nFungsi masjid tidak bertumpu kepada ibadah solat semata-mata. Kegiatan-kegiatan lain seperti pendidikan, ceramah dan muzakarah diadakan untuk semua lapisan masyarakat. Menurut pegawai masjid ini ada antara mereka yang pernah melawat masjid ini mendapat hidayah daripada Allah lalu memeluk Islam setelah teruja dengan keindahannya.",
    "directions": "Masjid Negara ini dibina di atas sebidang tanah berkeluasan 5.46 hektar. Kedudukannya bertentangan dengan stesen keretapi Kuala Lumpur. Berhampiran dengan bangunan ini juga, terdiri Kompleks Pusat Islam dan Muzium Kesenian Islam. Lokasinya sangat strategik dilengkapi dengan berbagai-bagai kemudahan dan berdekatan pula dengan stesen pengangkutan awam."
  },
  "w283fjk6nb": {
    "address": "Pusat Bandaraya, Kuala Lumpur, Wilayah Persekutuan, Malaysia 50000",
    "contact": "03-26912829",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.149301,
      "longitude": 101.695587
    },
    "name": "MASJID JAMEK sultan Abdul samad",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "102ab8aa-6d3e-4db2-93c8-6af64298577b",
    "geohash": "w283fjk6nb",
    "remarks": "Masjid Jamek ini terletak di Jalan Tun Perak, Kuala Lumpur. Ia telah dibuka dengan rasminya oleh Sultan Selangor, Sultan Alauddin Sulaiman Shah. Masjid yang tertua di Wilayah Persekutuan ini mendapat tumpuan orang ramai di sekitar pusat bandar. Sejak tahun 1979 Masihi, kerja-kerja pemulihan dan pembesarannya telah dijalankan sehingga 10 Mei 1983 Masihi yang melibatkan pembesaran masjid ke peringkat optimum tanpa mengubah reka bentuk asalnya.\r\n\r\nPembinaan masjid ini hanya mengambil masa selama sembilan bulan dan kosnya telah dibiayai oleh kerajaan dan sumbangan orang ramai. Memandangkan ia menjadi tumpuan ramai, beberapa tahun kemudian pihak kerajaan telah membesarkan ruang masjid ini serta dilengkapi dengan permaidani dan lampu-lampu hiasan. Kerja-kerja pembesaran masjid ini dilakukan pada tahun 1979 Masihi. Kemudian sekali lagi masjid ini diperbaiki pada tahun 1993 Masihi akibat keruntuhan salah sebuah kubahnya. Pada tanggal 23 jun 2017 dengan rasminya masjid ini telah ditukarkan nama dengan nama baru iaitu masjid jamek sultan abdul samad kuala lumpur yang telah dimashurkan oleh kebawah duli yang maha mulia tuanku syarifuddin SHAH ibni almarhum sultan abdul aziz shah sultan selangor.\r\nReka",
    "source_musolla_id": "MY-14-WKL-00051",
    "provision": "1. tEMPAT WUDUK YANG BERSIH DAN TANDAS YANG SELESA.  \r\n2. GALERI YANG MENEMPATKAN GAMBAR-GAMBAR DAN BERITA MENGENAI MASJID SULTAN ABDUL SAMAD.\r\n3. BERDEKATAN DENGAN PERHENTIAN LRT DAN DATARAN MERDEKA. \r\n4. MEMPUNYAI JAMBATAN YANG MERENTASI SUNGAI GOMBAK DARI MASJID KE DATARAN MERDEKA.",
    "directions": "DI TENGAH-TENGAH BANDAR KUALA LUMPUR DAN BERDEKATAN DENGAN DATARAN MERDEKA."
  },
  "w283fwgkmc": {
    "address": "KLCC, Kuala Lumpur, Wilayah Persekutuan, Malaysia 50450",
    "contact": "03-23801293",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.157935,
      "longitude": 101.716143
    },
    "name": "MASJID ASY-SYAKIRIN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "45fffebf-9cba-4ea1-bbcd-2b70132bc866",
    "geohash": "w283fwgkmc",
    "remarks": "Masjid Dalam Taman\r\n\r\nMasjid ini dibina pada tahun 1996 Masihi, dan menjadi antara mercu tanda di Kuala Lumpur Conference Centre (KLCC) selain daripada menara berkembarnya. Ia dibina di atas tapak berkeluasan kira-kira seratus ekar. Masjid ini dibina dan diselenggarakan oleh pihak pengurusan KLCC, manakala pengurusan aktiviti dan pengajian di masjid diselia oleh Jabatan Agama Islam Wilayah Persekutuan.",
    "source_musolla_id": "MY-14-WKL-00023",
    "provision": "1. TANDAS DAN TEMPAT WUDUK YANG LUAS DAN SELESA BERTARAF 5 BINTANG.\r\n2. RUANG SOLAT UTAMA BERHAWA DINGIN DAPAT MENAMPUNG 16 RIBU JEMAAH.\r\n3. SKRIM MAKLUMAT LED.\r\n4. PEJABAT DAN BILIK MESYUARAT YANG SELESA.\r\n5. DEWAN SERBAGUNA.",
    "directions": "1. BERDEKATAN DENGAN BANGUNAN KLCC DAN BERADA DITENGAH-TENGAH BANDAR KUALA LUMPUR.\r\n2. BERSEBELAHAN DENGAN PERHENTIAN MRT DAN PUSAT MEMBELIBELAH TERKEMUKA DI KUALA LUMPUR."
  },
  "w283f7ek2y": {
    "address": "Pusat Bandaraya, Kuala Lumpur, Wilayah Persekutuan, Malaysia 50000",
    "contact": "019-8362993",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.140109,
      "longitude": 101.704942
    },
    "name": "MASJID AL-BUKHARY",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "794dd9eb-021a-49c9-903f-1f557ab41044",
    "geohash": "w283f7ek2y",
    "remarks": "Pembangunan masjid ini adalah untuk menggantikan Surau Babul Jannah yang telah berusia 147 tahun dan telah pun dimakan usia. Masjid ini kemudian telah dinamakan sebagai Masjid AlBukhary mengambil sempena nama keluarga Pengasas Yayasan AlBukhary. Masjid ini dibina di atas tapak seluas 1 ekar di Lot 192, Seksyen 56, Mukim Bandar Kuala Lumpur. Asalnya adalah tanah surau lama dan sebahagiannya tapak perkuburan Islam yang diwakafkan oleh DYMM Sultan Selangor iaitu Almarhum Sultan Abdul Samad pada tahun 1860. Almarhum Baginda Sultan telah mengamanahkan Allahyarham Syed Lal Shah Albukhary untuk membangunkan serta menjaga surau ini yang telah diberi nama Babul Jannah.",
    "source_musolla_id": "MY-14-WKL-00038",
    "directions": "Berada di Jalan Hang Tuah dan berdekatan Stesen RapidKL Hang Tuah, Stesen Monorail Hang Tuah, Ibu Pejabat Polis Kontijen Kuala Lumpur, Times Square dan Penjara Pudu."
  },
  "w283fjugyr": {
    "address": "Pusat Bandaraya, Kuala Lumpur, Wilayah Persekutuan, Malaysia 50000",
    "contact": "03-26921009",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.152386,
      "longitude": 101.696252
    },
    "name": "MASJID INDIA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "ea8c7132-81be-41bc-b465-01cccd6173be",
    "geohash": "w283fjugyr",
    "remarks": "Masjid India pula sangat popular di kalangan peniaga India Muslim di Jalan Masjid India. Masjid ini dibina pada 3 Jamadillawal 1382 bersamaan 10 September 1964 Masihi. Pada mulanya ia dikenali dengan nama Masjid India Selatan. Masjid ini tidak putus-putus dikunjungi oleh masyarakat muslim di ibu kota dan juga musafir.\r\n\r\nSeperti Masjid Jamek juga, Masjid India memainkan peranan penting sebagai pusat ibadah di tengah-tengah kesibukan pusat perniagaan terkenal ini. Masjid ini akan sesak dengan jemaah apabila waktu solat Jumaat. Oleh kerana masjid ini digunakan oleh berbagai-bagai bangsa yang menganut agama Islam, khutbah Jumaat dibacakan di dalam tiga bahasa, iaitu bahasa Urdu, bahasa Inggeris dan bahasa Melayu.",
    "source_musolla_id": "MY-14-WKL-00009",
    "directions": "1. Masjid ini terletak berhampiran dengan Sungai Klang dan Jalan Tuanku Abd Rahman.\r\n2. TERLETAK DITENGAH-TENGAH BANDAR KUALA  LUMPUR DIKELILINGI PUSAT MEMBELI BELAH."
  },
  "w283ffw19u": {
    "address": "Jalan Perkasa, Taman Maluri, 55100 Kuala Lumpur, Wilayah Persekutuan, Malaysia 55100",
    "contact": "03-92812472",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.134131,
      "longitude": 101.730734
    },
    "name": "MASJID AL-IMAM ASH-SHAFIE",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "efeb086a-440f-4cc5-b202-7ea63debc238",
    "geohash": "w283ffw19u",
    "remarks": "Bangunan utama masjid serta bangunan-bangunan annexnya dibina atas Lot No. P.T. 1674 Jalan Perkasa, Taman Maluri, Kuala Lumpur yang luasnya kira-kira 1.9 ekar. Pembinaan masjid ini  dimulakan pada tahun 1987 dan siap serta boleh digunakan pada bulan Oktober, 1993",
    "source_musolla_id": "MY-14-WKL-00004",
    "provision": "Terdapat pelbagai kemudahan disediakan oleh pihak masjid seperti kuarters, Dewan Seri Perkasa,bilik kuliah dan perpustakaan. Tandas, tempat berwuduk, bilik pengurusan jenazah, bilik mesyuarat dan dapur juga disediakan untuk kegunaan ramai.",
    "directions": "Lokasinya cukup strategik kerana berada di tepi Jalan Perkasa yang merupakan antara laluan utama ke pusat Bandar.Ia memudahkan orang ramai untuk singgah bersembahyang. Berhampirannya ialah bangunan Baitulmal dan SPRM yang menjadi sebagai penanda untuk menuju ke masjid ini."
  },
  "w283fdv18b": {
    "address": "Pudu, Kuala Lumpur, Wilayah Persekutuan, Malaysia 55100",
    "contact": "03-92848584",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.135482,
      "longitude": 101.718332
    },
    "name": "MASJID JAMEK ALAM SHAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "195cc608-1227-4b0f-b392-67919b51ca6e",
    "geohash": "w283fdv18b",
    "remarks": "Masjid ini adalah sebuah masjid yang agak lama dibina di Kuala Lumpur. Masjid ini pernah dilawat oleh Yang Mulia Sultan Brunai sewaktu rombongan diraja datang ke Malaysia untuk menyaksikan sambutan hari kemerdekaan. Rombongan diraja ini juga telah datang untuk menunaikan solat Jumaat di masjid ini.",
    "source_musolla_id": "MY-14-WKL-00056",
    "provision": "Masjid ini mempunyai dewan solat utama untuk lelaki dan perempuan serta dewan solat tambahan di sebelah luarnya . Kitab suci Al-Quran diletakkan di setiap sudut .\r\n\r\nSelain itu , terdapat juga bilik imam/bilal , bilik stor , pejabat , bilik mesyuarat , dapur ,van jenazah ,mandijenazah  dan tempat wudhuk lelaki dan wanita .. \r\n\r\nDi bahagian luar masjid terdapat beberapa ruang letak kereta khas pegawai masjid berbumbung serta garaj untuk motosikal dan basikal",
    "directions": "Masjid Jamek Alam Shah yang terletak di persimpangan antara Jalan Pasar, Jalan Tun Razak dan Jalan Cochrane"
  },
  "w283fqg2tt": {
    "address": "KLCC, Kuala Lumpur, Wilayah Persekutuan, Malaysia 50450",
    "contact": "03-77277401",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.157314,
      "longitude": 101.705147
    },
    "name": "MASJID JAMEK TG. ABD. AZIZ SHAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "eb0aa137-2a0a-43b5-a886-9171b154819e",
    "geohash": "w283fqg2tt",
    "source_musolla_id": "MY-14-WKL-00021",
    "directions": "Berada di sekitar perumahan dan deretan kedai makan di Sg.Penchala."
  }
}