{
  "w2863knznm": {
    "address": "Kuala Lumpur, Wilayah Persekutuan, Malaysia 50050",
    "contact": "03-61370607",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.231209,
      "longitude": 101.666034
    },
    "name": "MASJID ANAS BIN MALIK",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "41badcbc-fbe5-4a7a-9c82-3506b1bd7a99",
    "geohash": "w2863knznm",
    "remarks": "Kg. Selayang Lama asalnya diduduki oleh Puak Menedeling pada tahun 1888. Berdasarkan dakta sejarah Kuala Lumpur pada tahun 1868, seorang peniaga bernama Sultan Pusa dari Puak Mendeling telah membuka perniagaan di Kuala Lumpur dan melalui pengaruh yang dimiliki oleh beliau, Puak Mendeling dapat membuka tanah masjid ini. Di daerah Mukim Batu ini terbahagi kepada dua bagahian iaitu aliran Sungai Gombak dan Sungai Batu yang mana Puak Mendeling terlebih dahulu menerokai daerah Sungai Batu dan Puak Minangkabaupula  di daerah Sungai Gombak. Ketika itu, hanya terdapat 4 buah masjid sahaja di daerah Mukim Batu di mana imam Masjid Jamek Kg. Selayang Lama menjadi ketua imam di daerah Mukim Batu dan selaku Ketua Kg. Selayang Lama ketika itu ialah Ja'Parkas Bin Pakay (berasal dari Indonesia yang berhijrah ke Malaysia dan menetap di Malaysia dan menjadi ketua Kg. Selayang Lama ketika itu). Rekod sejarah pembukaan masjid pertama di bawah Kerajaan British ketika itu ialah pada tahun 1905. Kawasan masjid ini kawasan rizab melayu seperti yang diwartakan pada tahun 1905. Kawasan masjid ini ialah kawasan rizab melayu seperti yang diwartakan dalam rekod Geran Mukim (gm) 1787 di tanah masjid dan didaftarkan pada 3hb Mac 1987. Pembinaan pertama dibina pada awal tahun 1905 di atas lot 2049 yang terletak di dalam lot 2050. Masjid pertama telah dibina atas usaha orang kampung yang meneroka pembukaan tanah di sini dengan peruntukan sebanyak RM2650 dan RM 500 dari sumbangan Kerajaan British. Pembinaan demi pembinaan telah dibuat dan pembinaan kedua pula pada sekitar tahun 1922 yang telah dipantau oleh seorang pegawai British mewakili Kerajaan British. Pada 29hb April 1929 tanah bernombor lot 2050 ini telah diwakafkan oleh Kerajaan British kepada Majlis Ugama Islam Selangor (MUIS) dan Adat Istiadat Melayu Selangor (AIMS). Pembinaan terakhir iaitu pembinaan ketiga masjid ini adalah pada tahun 1961 sumbangan penuh oleh Kerajaan Persekutuan Tanah Melayu sebanyak RM50,000.00. Pentadbiran masjid ini telah ditadbir Kerajaan Selangor pada tahun 1972 sehingga tahun 1974. Apabila Kuala Lumpur diserahkan kepada Kerajaan Malaysia, masjid telah ditadbbir sepenuh ol;eh Kerajaan Wilayah Persekutuan dan kesemua masjid-masjid, surau-surau, madrasah, dan tanah wakaf adalah hak milik Majlis Agama Islam Wilayah Persekutuan (MAIWP) dan seperti yang tertulis dalam Perlembagaan Persekutuan mengikut akta 505 telah diluluskan oleh parlimen.",
    "source_musolla_id": "MY-14-WKL-00010",
    "directions": "Masjid ini terletak dikawasan perkampongan di Kampong Selayang Lama."
  }
}