{
  "w2863mejb6": {
    "address": "Taman Wilayah Selayang, 68100 Kuala Lumpur, Wilayah Persekutuan, Malaysia 68100",
    "contact": "03-61370018",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.239218,
      "longitude": 101.660632
    },
    "name": "MASJID AL-ZAKIRIN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "6840200f-1884-4429-aa11-8d2e5703815e",
    "geohash": "w2863mejb6",
    "source_musolla_id": "MY-14-WKL-00045"
  },
  "w2863cz612": {
    "address": "Taman Perindustrian IKS Mukim Batu, Kuala Lumpur, Wilayah Persekutuan, Malaysia 56000",
    "contact": "03-62575227",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.217966,
      "longitude": 101.688484
    },
    "name": "MASJID SAIDINA HAMZAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "f7b16580-803a-49b0-b16d-ccf00ead9108",
    "geohash": "w2863cz612",
    "remarks": "Penduduk kariah Kampung Batu Muda sebelum pembinaan Masjid Saidina Hamzah bersolat Jumaat di Surau Ibrahimmiyah. Setelah berkembang pesat dan pertambahan penduduk Kampung Batu Muda, anak-anak kariah merasakan perlu mempunyai sebuah masjid sendiri bagi melaksanakn ibadat dan aktiviti kemasyarakatan. Pada 21 September 1986, Pejabat Tanah dan Galian Kuala Lumpur telah meluluskan tapak tanah seluas 2.5 ekar untuk pembinaan masjid baru.Pada 16 Ogos 1986 tanah tersebut telah diwakafkan kepada Majlis Agama Islam Wilayah Persekutuan (MAIWP) dan sejumlah RM 7.6 juta diperuntukkan untuk membina masjid ini. Pada awalnya masjid ini dinamakan Masjid Jamek Kampung Batu akan tetapi setelah setahun masjid ini beroperasi JAWI telah membuat penjenamaan semula kepada Masjid Saidina Hamzah dan diletakkan di bawah pentadbiran Pajabat Pusat Zon 1 Bahagian Pengurusan Kariah, JAWI.",
    "source_musolla_id": "MY-14-WKL-00017",
    "provision": "Kemudahan-kemudahan yang disediakan ialah Sekolah Rendah Agama ( SRA ), 4 unit kuarters, dewan serbaguna, sebuah bilik mesyuarat dan tempat meletak kereta."
  },
  "w2863tj58g": {
    "address": "Batu Caves, Selangor, Malaysia 68100",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.236094,
      "longitude": 101.674388
    },
    "name": "MASJID JAMEK AL - AMANIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "fd7957b2-5026-462f-820d-8c0db56362af",
    "geohash": "w2863tj58g",
    "source_musolla_id": "MY-10-GBK-00043",
    "provision": "Antara kemudahan yang terdapat ialah ruang solat untuk lelaki dan perempuan, bilik pejabat  dan ruang parkir yang besar."
  },
  "w2863knznm": {
    "address": "Kuala Lumpur, Wilayah Persekutuan, Malaysia 50050",
    "contact": "03-61370607",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.231209,
      "longitude": 101.666034
    },
    "name": "MASJID ANAS BIN MALIK",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "41badcbc-fbe5-4a7a-9c82-3506b1bd7a99",
    "geohash": "w2863knznm",
    "remarks": "Kg. Selayang Lama asalnya diduduki oleh Puak Menedeling pada tahun 1888. Berdasarkan dakta sejarah Kuala Lumpur pada tahun 1868, seorang peniaga bernama Sultan Pusa dari Puak Mendeling telah membuka perniagaan di Kuala Lumpur dan melalui pengaruh yang dimiliki oleh beliau, Puak Mendeling dapat membuka tanah masjid ini. Di daerah Mukim Batu ini terbahagi kepada dua bagahian iaitu aliran Sungai Gombak dan Sungai Batu yang mana Puak Mendeling terlebih dahulu menerokai daerah Sungai Batu dan Puak Minangkabaupula  di daerah Sungai Gombak. Ketika itu, hanya terdapat 4 buah masjid sahaja di daerah Mukim Batu di mana imam Masjid Jamek Kg. Selayang Lama menjadi ketua imam di daerah Mukim Batu dan selaku Ketua Kg. Selayang Lama ketika itu ialah Ja'Parkas Bin Pakay (berasal dari Indonesia yang berhijrah ke Malaysia dan menetap di Malaysia dan menjadi ketua Kg. Selayang Lama ketika itu). Rekod sejarah pembukaan masjid pertama di bawah Kerajaan British ketika itu ialah pada tahun 1905. Kawasan masjid ini kawasan rizab melayu seperti yang diwartakan pada tahun 1905. Kawasan masjid ini ialah kawasan rizab melayu seperti yang diwartakan dalam rekod Geran Mukim (gm) 1787 di tanah masjid dan didaftarkan pada 3hb Mac 1987. Pembinaan pertama dibina pada awal tahun 1905 di atas lot 2049 yang terletak di dalam lot 2050. Masjid pertama telah dibina atas usaha orang kampung yang meneroka pembukaan tanah di sini dengan peruntukan sebanyak RM2650 dan RM 500 dari sumbangan Kerajaan British. Pembinaan demi pembinaan telah dibuat dan pembinaan kedua pula pada sekitar tahun 1922 yang telah dipantau oleh seorang pegawai British mewakili Kerajaan British. Pada 29hb April 1929 tanah bernombor lot 2050 ini telah diwakafkan oleh Kerajaan British kepada Majlis Ugama Islam Selangor (MUIS) dan Adat Istiadat Melayu Selangor (AIMS). Pembinaan terakhir iaitu pembinaan ketiga masjid ini adalah pada tahun 1961 sumbangan penuh oleh Kerajaan Persekutuan Tanah Melayu sebanyak RM50,000.00. Pentadbiran masjid ini telah ditadbir Kerajaan Selangor pada tahun 1972 sehingga tahun 1974. Apabila Kuala Lumpur diserahkan kepada Kerajaan Malaysia, masjid telah ditadbbir sepenuh ol;eh Kerajaan Wilayah Persekutuan dan kesemua masjid-masjid, surau-surau, madrasah, dan tanah wakaf adalah hak milik Majlis Agama Islam Wilayah Persekutuan (MAIWP) dan seperti yang tertulis dalam Perlembagaan Persekutuan mengikut akta 505 telah diluluskan oleh parlimen.",
    "source_musolla_id": "MY-14-WKL-00010"
  },
  "w2863zw8zm": {
    "address": "Batu Caves, Selangor, Malaysia 68100",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.249365,
      "longitude": 101.687709
    },
    "name": "MASJID ANNUR",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "1e38580c-cb4a-477c-86f7-05266be2bcb7",
    "geohash": "w2863zw8zm",
    "source_musolla_id": "MY-10-GBK-00379",
    "provision": "Antara kemudahan yang terdapat ialah  ruang parkir dan  ruangan solat yang selesa."
  },
  "w2863x3xhs": {
    "address": "Batu Caves, Selangor, Malaysia 68100",
    "contact": "03-61367012",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.249057,
      "longitude": 101.669741
    },
    "name": "MASJID AT -TAQWA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "c9636bfd-44f4-4221-b879-650d4b3d3fe9",
    "geohash": "w2863x3xhs",
    "source_musolla_id": "MY-10-GBK-00056",
    "provision": "Antara kemudahan yang terdapat di masjid ini ialah ruang solat yang selesa untuk lelaki dan wanita, tempat wuduk, tempat letak kereta, stor, ruang jamuan, dewan kuliah serta seminar, van jenazah, tempat pengurusan jenazah, Sekolah Agama Rakyat Nurul Iman, tangga khas untuk orang kurang upaya dan bilik imam serta bilal."
  },
  "w2863xxm5g": {
    "address": "Jalan Nakhoda Tengah, Kampung Nakhoda, 68100 Batu Caves, Selangor, Malaysia 68100",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.250083,
      "longitude": 101.6776
    },
    "name": "MASJID JAMEK KG. NAKHODA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "77010300-1ea5-4433-bf7a-4bbd228dfab0",
    "geohash": "w2863xxm5g",
    "source_musolla_id": "MY-10-GBK-00047",
    "provision": "Antara kemudahan yang terdapat ialah  ruang parkir, penghawa dingin, van jenazah dan urusan jenazah dan  ruangan solat yang luas.,"
  },
  "w2863jvpe4": {
    "address": "Batu Caves, Selangor, Malaysia 68100",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.240892,
      "longitude": 101.652513
    },
    "name": "MASJID SERI MELATI",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "5b00119e-7faa-44e8-8230-7d2b0118f007",
    "geohash": "w2863jvpe4",
    "source_musolla_id": "MY-10-GBK-00065",
    "provision": "Masjid ini mempunyai dewan solat utama untuk lelaki dan perempuan serta dewan solat tambahan di sebelah luarnya. Selain itu , terdapat juga bilik imam/bilal , bilik stor , pejabat , bilik mesyuarat , dapur ,dewan,van jenazah,mandi jenazah dan  tempat wudhuk lelaki dan wanita .\r\n\r\nDi bahagian luar masjid terdapat beberapa ruang letak kereta khas pegawai masjid berbumbung serta garaj untuk motosikal dan basikal . Ruang letak kereta terbuka pula mampu meletakkan lebih 20 kereta dalam satu-satu masa dalam kawasan masjid sahaja."
  }
}