{
  "w28670rn7f": {
    "address": "Taman Wangsa Melawati, Setapak, Wilayah Persekutuan, Malaysia 53300",
    "contact": "0341497700",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.210466,
      "longitude": 101.743183
    },
    "name": "MASJID AL-MUTTAQIN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "3cef3a80-385e-458f-973d-ed087b5a4f1a",
    "geohash": "w28670rn7f",
    "remarks": "Pembinaan Masjid Al-Muttaqin telah bermula pada tahun 2000 dan siap dibina pada bulan Mei 2002. Masjid ini mula beroperasi pada 8 September 2002 bersamaan 1 Rejab 1423H. Pada awalnya, masjid ini dinamakan Masjid Wangsa Melawati, sehinggalah ia diberikan nama oleh pihak JAWI dengan nama AL-MUTTAQIN yang membawa maksud ORANG-ORANG BERTAKWA. Kariah masjid ini merangkumi beberapa buah taman perumahan sekitarnya iaitu Wangsa Perkasa, Wangsa Murni, Wangsa Ceria dan Wangsa Siaga dan lain-lain lagi. Sebelum kewujudan Masjid Usamah bin Zaid, semua urusan anak kariah Wangsa Maju dirujuk di Masjid ini.  \n\nPada awalnya, tapak masjid ini dirancang untuk dibina surau. Walaubagaimanapun, ia ditukar status untuk didirikan masjid disebabkan tapak asal Masjid Wilayah yang dirancang didirikan di Wangsa Maju telah dipindakan ke Jalan Duta.             \n\nIa juga dikenali sebagai sebuah Masjid Perlancongan. Terdapat dua buah surau yang terletak dibawah pentadbiran masjid ini iaitu Surau Wangsa Melawati dan Surau Al Kauthar, Wangsa Siaga.",
    "source_musolla_id": "MY-14-WKL-00047",
    "provision": "Kemudahan yang terdapat di masjid ini ialah:-\n1. Dewan Solat yang bersih. Dilengkapi 2 LCD dan papan layar.\n2. Sekolah Rendah Agama.\n3. 4 Unit Kuaters Kakitangan.\n4. Dewan Masjid berkapasiti 1200 orang.\n5. Bilik Pengurusan Jenazah dan Van Jenazah.\n6. Kemudahan Parkir Kereta yang luas.\n7. Ruang dapur masjid yang selesa dan lengkap.\n8. Bilik Imam/Bilal berhawa dingin."
  },
  "w28670rnev": {
    "address": "Taman Wangsa Melawati, Setapak, Wilayah Persekutuan, Malaysia 53300",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.210527,
      "longitude": 101.743175
    },
    "name": "MASJID AL - MUTTAQIN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "63c1deae-8002-420d-9aff-01f353ebcd0d",
    "geohash": "w28670rnev",
    "source_musolla_id": "MY-10-GBK-00063",
    "provision": "Antara kemudahan yang terdapat ialah  ruang parkir dan  ruangan solat yang selesa."
  }
}