{
  "w2864qckpv": {
    "address": "Kampung Sungai Merali, Setapak, Wilayah Persekutuan, Malaysia 53100",
    "contact": "03-40231598",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.201855,
      "longitude": 101.702496
    },
    "name": "MASJID JAMEK SAAD IBN WAQQAS",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "5230007b-1664-4b40-aa5c-64d2e76b8eed",
    "geohash": "w2864qckpv",
    "remarks": "Masjid ini telah mula dibina pada 10 April 1998 dan sia digunakan pada 1hb, Disember 1998 hasil dari sumbangan JAWI sebanyak RM2 juta dan Yayasan Fazlan Berhad sebanyak RM 500,000. Masjid ini dibina diatas tanah yang diwakafkan oleh Tuan Hj. Abd Kadir bin Hj Abd Majid.",
    "source_musolla_id": "MY-14-WKL-00031",
    "provision": "Antara kemudahan yang terdapat ialah ruang parkir, dewan dan ruang solat yang selesa."
  },
  "w2864bmn23": {
    "address": "Kampung Datuk Keramat, Kuala Lumpur, Wilayah Persekutuan, Malaysia 54000",
    "contact": "03-42570529",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.166516,
      "longitude": 101.729292
    },
    "name": "MASJID AL-AKRAM",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "6ee506ba-13e4-4ed4-b5ed-3aa4c011e486",
    "geohash": "w2864bmn23",
    "remarks": "Masjidul Akram Kampong Dato' Keramat mula dibina lebih kurang tiga bulan selepas peristiwa berdarah 13 Mei 1969. Hampir sebulan lamanya penduduk Kg. Dato' Keramat tidak dapat keluar menunaikan sembahyang Waktu dan sembahyang Jumaat di masjid lama yang terletak di antara Lorong Keramat 16 dan 17 kerana perintah berkurung ekoran daripada peristiwa 13 Mei itu. Setelah siap pembinaanya pada 31 Mei 1971, Masjidul Akram ini dikatakan sebagai masjid tercantik dan termoden di Kuala Lumpur pada masa itu. Pada bulan Ogos 1971, masjid baru itu mula digunakan sebagai tempat ibadah sempena bulan Ramadhan 1391 dengan peralatan-peralatan yang serba kekurangan yang dipindahkan dari masjid lama. Sejak awal tahun 1972 apabila tertubuh Ahli Jawatankuasa yang mula-mula sekali mentadbir Masjidul Akram yang diketuai oleh Encik Mohd Idris bin Ibrahim (sekarang Dato' Haji Idris bin Ibrahim) dan timbalannya Allahyarham Cikgu Haji Mohd Yasin b. Haji Salleh, berbagai usaha telah dibuat untuk mengadakan segala kemudahan bagi keselesaan para jemaah. Kemuncak pembangunan dan kejayaan Masjidul Akram ini bermula dari tahun 1985 apabila usaha-usaha untuk memakmur dan mengimarahkan masjid dipergiatkan lagi dari tahun ke setahun. Kejayaan dan pencapaian cemerlang AJK masjid dari berbagai aspek, diiktiraf oleh Jabatan Agama Islam Wilayah Persekutuan (JAWI) apabila Masjidul Akram ini dipilih sebagai \"Masjid Contoh\" di antara lebih 30 buah masjid di Wilayah Persekutuan sebanyak dua kali iaitu pada tahun 1990 dan 1994 dengan hadiah wang sebanyak RM 7,000.00. Kejayaan dan kemajuan tidak akan dapat dicapai tanpa sokongan dan kerjasama daripada para jemaah dan umat islam keseluruhannya. SOkongan yang berupa wang ringgit, tenaga dan buah fikiran meningkat dari tahun ke setahun. Hal ini menambah lagi semangat dan keazaman AJK yang ada sekarang untuk terus berusaha memakmurkan lagi masjid dalam segala bidang, InsyaAllah. Usaha menulis dan mencatat sejarah ringkas pembangunan Masjid Al-Akram sempena suku abad terdirinya masjid ini dibuat dengan tujuan sebagai mengenang jasa dan perngorbanan 'Orang-Orang Lama' yang kebanyakannya telahpun kembali ke Rahmatullah yang telah bersusah payah dan bertungkus lumus berusaha mendirikan Rumah Allah yang dimuliakan ini. Mudah-mudahan jasa dan pengorbanan mereka itu diterima Allah dan diberi sebaik-baik balasan. Disamping itu diharap buku kecil yang tidak sepertinya ini akan dijadikan bahan rujukan mengingati kembali seharah satu-satunya mercu yanda di Kg.Dato' Keramat ini.",
    "source_musolla_id": "MY-14-WKL-00003",
    "provision": "Kemudahan-kemudahan yang terdapat di masjid ialah:-\n1. Rumah Pangsa empat tingkat bagi menamping perbelanjaan penyelenggaraan masjid tiap-tiap bulan.\n2. Sekolah Rendah Agama Al-Akram\n3. Tanah Perkuburan Islam Dato' Keramat\n4. Taman Rekreasi \n5. Van jenazah"
  },
  "w28642f6e6": {
    "address": "Hospital Kuala Lumpur, Kuala Lumpur, Wilayah Persekutuan, Malaysia 50586",
    "contact": "03-26913954",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.168626,
      "longitude": 101.703674
    },
    "name": "MASJID JAMEK KG. BARU",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "b50a884d-1efa-4929-a1a0-3b431e3b7b86",
    "geohash": "w28642f6e6",
    "remarks": "Peletakan batu asas masjid ini telah disempurnakan oleh YTM Tunku Abdul Rahman Putra Al-Haj pada 14 Zulhijjah 1379 Hijri bersamaan 12 Julai 1957 Masihi. Arkitek yang mereka bentuk bangunan ini berbangsa Cina bernama Y.T.Lee, manakala kontraktor yang terbabit ialah Chan Khiew. Masjid ini menjadi lambang perpaduan dan penyatuan pelbagai etnik Melayu sejak awal merdeka sehingga kini. Masjid ini kerap dikunjungi orang ramai dan pelancong menjadi kebanggaan masyarakat Kampung Baru.\r\n\r\nIa tidak pernah sunyi daripada aktiviti dan sering mendapat kunjungan dan perhatian para pemimpin. Masjid ini menjadi lebih meriah apabila tibanya bulan Ramadan, Syawal dan Hari Raya Korban. Pada bulan Ramadan, lazimnya solat Tarawih diimamkan oleh imam yang dijemput khas dari Mekah. Yang menarik di sini ialah keenakan bubur lambuk yang diusahakan secara bergotong-royong pada setiap tahun dan diberikan secara percuma kepada penduduk kota untuk berbuka puasa.",
    "source_musolla_id": "MY-14-WKL-00027",
    "provision": "1. RUANG SOLAT YANG LUAS, BERSIH,SELESA DAN BERHAWA DINGIN.\r\n2. MEMPUNYAI PEJABAT YANG SELESA.\r\n3. DEWAN KULIAH YANG BERHAWA DINGIN."
  },
  "w2864djcsq": {
    "address": "Titiwangsa, Kuala Lumpur, Wilayah Persekutuan, Malaysia 53200",
    "contact": "03-26980133",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.175343,
      "longitude": 101.71951
    },
    "name": "MASJID SOLEHIN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "26a421a3-38e4-4740-90ee-f3305361b4b8",
    "geohash": "w2864djcsq",
    "source_musolla_id": "MY-14-WKL-00012"
  },
  "w2864vkdcr": {
    "address": "Taman Setapak Jaya, Setapak, Wilayah Persekutuan, Malaysia 53300",
    "contact": "03-40315860",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.193414,
      "longitude": 101.728648
    },
    "name": "MASJID ABU UBAIDAH AL-JARRAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "f4cbbce9-0185-4d7a-8fe7-6700f2e0a98a",
    "geohash": "w2864vkdcr",
    "remarks": "Projek pembinaan masjid ini adalah dikendalikan oleh Jabatan Kerjaraya Wilayah Persekutuan. Ia mula dibina pada 27hb Januari 1986 dan siap pada 24hb April 1987. Projek ini telah menelan belanja berjumlah  RM2,125,652.00. Masjid ini terletak di atas tapak seluas 3 ekar.",
    "source_musolla_id": "MY-14-WKL-00025",
    "provision": "Ia dapat menampung kira-kira 2500 jemaah sembahyang dan dilengkapi dengan kemudahan-kemudahan seperti Dewan Syarahan, Kelas Orang Kurang Upaya, Perpustakaan, Sekolah Agama dan Tadika, Pejabat, Bilik Jenazah dan rumah Kakitangan. Dengan adanya Masjid ini, kira-kira 50,000 oenduduk Islam di sekitar Jalan Genting Kelang telah mendapat perkhidmatan dan kemudahan yang disediakan dengan sebaik-baiknya."
  },
  "w28644yvht": {
    "address": "Bandar Baru Sentul, Kuala Lumpur, Wilayah Persekutuan, Malaysia 51000",
    "contact": "03-40449611",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.180056,
      "longitude": 101.698925
    },
    "name": "MASJID AMRU BIN AL-ASS",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "c92ff30f-fa52-47bf-bf56-439dc6fa2be9",
    "geohash": "w28644yvht",
    "remarks": "Masjid Amru Ibni Al Ass telah mula dibina pada 03 Mei 2995, siap pada 18 Ogos 1997 dengan harga pembinaan sebanyak RM4,546,482.19 dan diguna sepenuhnya pada awal tahun 1998. Sebelum ianya didaftarkan oleh Jabatan Agama Islam Wilayah Persekutuan, masjid ini dikenal dengan nama Masjid Bandar Baru Sentul. Hanya pada 12 Julai 1999 bersamaan 27 Rabiulawal 14200H masjid ini telah didaftarkan atas nama Masjid Amru Ibni Al Ass oleh Jabatan Agama Islam Wilayah Persekutuan Kuala Lumpur dengan No. Pendaftaran JAWI/5/034.\r\n\r\nPengurusan dan pentadbiran masjid ini adalah terletak di bawah tanggungjawab jawatankuasa yang dinamakan oleh Majlis Agama Islam Wilayah Persekutuan (MAWIP) kepada Duli Yang Maha Mulia Seri Paduka Baginda Yang Dipertuan Agung. Setiap Ahli Jawatankuasa yang dilantik akan memegang jawatan tersebut selama 2 tahun. Selepas 2 tahun mereka boleh ditamatkan atau menyambung tudas mereka sebagai Ahli Jawatankuasa menurut budibicara MAWIP. Struktur organisasi Jawatankuasa Pengurusan dan Pentadbiran Masjid Amru Ibni Al Ass terdiri daripada seorang Pengerusi, seorang Timbalan Pengerusi, seorang Setiausaha, seorang Bendahari dan tujuh orang Ahli Jawatankuasa.                      \r\n\r\nPegawai-pegawai dan kakitangan masjid adalah terdiri daripada:-\r\n\r\nPerlantikan JAWI: Seorang Imam / Ketua Amil dengan jawatan tetap Gred S41, dua orang Imam Ratib dicadang oleh Jawatankuasa Pengurusan & Pentadbiran Masjid dan dimajukan kepada Pentadbiran JAWI untuk kelulusan, seorang Bilal Ratib dicadang oleh Jawatankuasa Pengurusan 7 Pentadbiran Masjid kepada dan dimajukan Pentadbiran JAWI untuk kelulusan.",
    "source_musolla_id": "MY-14-WKL-00026",
    "provision": "Kemudahan-kemudahan yang terdapat di masjid ialah:-\r\n1. Menyediakan bilik kuliah dan kaunseling\r\n2. Bilik VVIP\r\n3. Bilik Jurunikah\r\n4. Bilik mandi jenazah \r\n5. van jenazah \r\n6. dewan makan\r\n7. bilik mesyuarat\r\n8. pejabat imam / bilal\r\n9. pejabat jawatankuasa masjid \r\n10.mesen atm bimb"
  },
  "w28645bcjb": {
    "address": "Sentul Boulevard, Kuala Lumpur, Wilayah Persekutuan, Malaysia 51000",
    "contact": "03-40451149",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.184834,
      "longitude": 101.690739
    },
    "name": "MASJID JAMEK PEKAN SENTUL",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "d72dcd98-86b5-468b-9856-86b7e6c4f138",
    "geohash": "w28645bcjb",
    "remarks": "MASJID  JAMEK SENTUL TELAH DIDIRIKAN PADA 16 JUN  1932 OLEH SEORANG YANG BERKETURUNAN INDIA (EN. ADAM  SAHIB BIN MOHAMAD ALI) YANG BERMAZHAB HANAFI. BELIAU ADALAH SEORANG ALIM DAN HAFIZ QURAN DISAMPING FASIH BERBAHASA URDU. BELIAU JUGA ADALAH MERANGKAP IMAM DAN BILAL MASJID INI. PADA SATU KETIKA BELIAU TELAH MEMBELI SEBIDANG TANAH NO . 10805 LOT NO 74 DARIPADA SEORANG YANG BERBANGSA CINA  DAN TELAH MEWAKAFKAN TANAH TERSEBUT MENGIKUT SEKSEN 84 ATAS NAMA MUSLIM MOSQUE SENTUL/MASJID JAMEK PEKAN SENTUL BAGI MENDIRIKAN MASJID INI. DAN TELAH MENJADI ANTARA MASJID YANG TERTUA DI MALAYSIA",
    "source_musolla_id": "MY-14-WKL-00019",
    "provision": "MASJID INI TERDAPAT KEMUDAHAN SEPERTI KEDAI MAKAN UNTUK PARA JEMAAH, BILIK TAMU DAN TEMPAT PAKIR AWAM"
  },
  "w28640xvgq": {
    "address": "42 Jalan Raja Muda Abdul Aziz, Chow Kit, 50300 Kuala Lumpur, Wilayah Persekutuan, Malaysia 50300",
    "contact": "03-42705240",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.167833,
      "longitude": 101.700243
    },
    "name": "MASJID JAMEK PAKISTAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "6720d062-1d88-4175-a993-d19175d7af06",
    "geohash": "w28640xvgq",
    "source_musolla_id": "MY-14-WKL-00034",
    "provision": "Antara kemudahan yang terdapat ialah  ruang parkir,  ruangan solat yang luas, kantin pakistan dan rumah pegawai masjid."
  },
  "w28646nptc": {
    "address": "Titiwangsa, Kuala Lumpur, Wilayah Persekutuan, Malaysia 53200",
    "contact": "03-40236897",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.176342,
      "longitude": 101.708936
    },
    "name": "MASJID IBNU SINA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "27185c88-8498-4573-af67-faa9263d4b0c",
    "geohash": "w28646nptc",
    "remarks": "Pada tahun 1985, penduduk sekitar Tasik Titiwangsa telah menyuarakan kepada Jabatan Agama Islam Wilayah Persekutuan (JAWI) untuk membina sebuah surau dengan persetujuan Masjid Jameul Ehsan, Setapak.    \n\nAhli Jawatankuasa Bertindak Sementara telah ditubuhkan pada tahun 1985 bagi tujuan menyelaras dan membina sebuah surau di atas tapak sedia ada. Proses untuk membina surau ini telah berlarutan sehingga tahun 1992 di mana dengan kerjasama Ahli Parlimen Titiwangsa masa itu iaitu YB. Drs. Sulaiman Mohamed yang juga Timbalan Menteri Jabatan Perdana Menteri telah mendapat peruntukan Wakil Rakyat sebanyak RM400,000.00 bagi pembinaan sebuah surau atas nama Surau Titiwangsa. Pembinaan Surau Titiwangsa telah dimulakan pada akhir tahun 1998 dan siap sepenuhnya pada tahun 2000. Ianya digunakan sepenuhnya oleh anak kariah pada 20 April 2000. Pentadbiran Surau telah dilantik di kalangan anak-anak kariah tiap-tiap sesi selama 2 tahun sekali. Dengan kerjasama yang erat dari semua anak kariah  bagi mengimarahkan surau, beberapa program dan aktiviti telah diadakan pada setiap masa. Pada 17 Ogos 2006, Mesyuarat Jawatankuasa Perundingan Hukum Syara' Wilayah Persekutuan kali ke-66 telah meluluskan permohonan Jawatankuasa Surau Titiwangsa untuk mendirikan Jumaat dan surau telah dinaik-taraf kepada Surau Jumaat pada 6 Oktober 2006 bersamaan 13 Ramadhan 1427H. Setelah surau dinaik-taraf untuk mendirikan solat Jumaat, Duli YMM Seri Paduka Baginda Yang Dipertuan Agong ke-12, iaitu DYMM Tuanku Syed Sirajuddin Ibni Al-Marhum Tuanku Syed Putra Jamalullail telah berangkat menunaikan solat sunat Jumaat Titiwangsa pada 3 November 2006. Selanjutnya, di Mesyuarat Jawatankuasa Perundingan Hukum Syara' Wilayah Persekutuan kali ke-72 pada 21 September 2008 bersamaan 21 Ramadhan 1429 H bersetuju menaik-taraf Surau Jumaat Titiwangsa kepada masjid sepenuhnya. Sempena kenaikan taraf kepada masjid, pada hari Jumaat 7 November 2008, YBhg. Dato' Sohibus Samahah Mufti Wilayah Persekutuan telah berkenan membaca Khutbah Khas dan lantas menamakan Masjid Titiwangsa kepada Masjid Ibnu Sina. Tuan    Buat masa ini, Masjid Ibnu Sina dapat memuat jemaah lebih kurang 900 orang. Justeru itu, bagi persediaan di mana anak-anak kariah bertambah dari masa ke semasa, maka pihak Ahli Jawatankuasa telah bersetuju untuk mendirikan sebuah bangunan masjid yang baru yang dilengkapi dengan segala kemudahan sebagaimana di dalam pelan bangunan yang telah disediakan oleh Arkitek ICB Sdn Bhd.",
    "source_musolla_id": "MY-14-WKL-00053",
    "provision": "Antara kemudahan yang terdapat ialah  ruang parkir yang kecil dan pejabat pentadbiran masjid.   ."
  }
}