{
  "w286196msq": {
    "address": "Kompleks Kerajaan, Kuala Lumpur, Wilayah Persekutuan, Malaysia 50480",
    "contact": "03-62018779",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.17191,
      "longitude": 101.67076
    },
    "name": "MASJID WILAYAH PERSEKUTUAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "b1996f17-67fb-4fdd-a2eb-248f07406986",
    "geohash": "w286196msq",
    "remarks": "Pembinaan Masjid Wilayah ini direalisasikan pada 25 Syawal 1416 Hijri bersamaan 15 Mac 1996 Masihi dan siap dibina pada 30 Ogos 2000 Masihi. Upacara serah milik kepada pihak Jabatan Agama Islam Wilayah (JAWI) pada September 2000 Masihi.\r\nMasjid Wilayah Persekutuan terletak di sebuah kawasan berbukit Jalan Duta, berhampiran susur masuk ke pusat bandaraya Kuala Lumpur. Tapak binaannya berkeluasan kira-kira 13.4 hektar, iaitu di atas tapak bekas mahkamah dan pejabat kerajaan. Cadangan pembangunan Masjid Wilayah ini diilhamkan oleh Tun Dr. Mahathir ketika menjadi Perdana Menteri keempat. Ia merupakan projek Jabatan Agama Islam Wilayah Persekutuan Kuala Lumpur (JAWI) dan diiktiraf berstatus Masjid Negeri.",
    "source_musolla_id": "MY-14-WKL-00002",
    "provision": "Masjid Wilayah ini dilengkapi dengan sekolah pendidikan Islam. Asrama, perpustakaan dan kemudahan bilik komputer turut disediakan. Selain kegiatan pembelajaran, aktiviti yang dilaksanakan ialah sambutan hari kebesaran Islam, ceramah, mesyuarat dan aktiviti kemasyarakatan yang disertai oleh semua golongan umat Islam. Masjid Wilayah ini menjadi antara tempat kunjungan wajib para pelancong dari dalam dan luar negara."
  },
  "w28614sqsz": {
    "address": "Bukit Segambut, Kuala Lumpur, Wilayah Persekutuan, Malaysia 51200",
    "contact": "03-62570533",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.178953,
      "longitude": 101.651552
    },
    "name": "MASJID UBUDIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "bc6ee0ef-4df5-4854-98cb-2c7830d045ff",
    "geohash": "w28614sqsz",
    "remarks": "Masjid ini telah dibina pada tahun 1964 diatas tanah wakaf lebih kurang suku ekar dan telah diubahsuai sebanyak dua kali. Ianya telah dirasmikan oleh DYMM Sultan Selangor pada 1/1/1970,",
    "source_musolla_id": "MY-14-WKL-00035",
    "provision": "Antara kemudahan yang terdapat ialah perpustakaan, dewan jamuan, bilik kuliah dan kaunselling dan ruang solat yang selesa."
  },
  "w2861m3wp6": {
    "address": "Kampung Sungai Udang, Kuala Lumpur, Wilayah Persekutuan, Malaysia 52000",
    "contact": "03-62595562",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.193947,
      "longitude": 101.658873
    },
    "name": "MASJID AL-QURTUBI",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "d4066b1a-b97d-4f7d-b493-c4a88dca8d6d",
    "geohash": "w2861m3wp6",
    "source_musolla_id": "MY-14-WKL-00043",
    "provision": "Masjid ini menyediakan Sekolah Agama dan mempunyai deretan rumah untuk kakitangan masjid."
  },
  "w2861xj89u": {
    "address": "Jalan Kepong Baru, Kampung Batu, 51200 Kuala Lumpur, Wilayah Persekutuan, Malaysia 51200",
    "contact": "03-62517711",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.202627,
      "longitude": 101.675116
    },
    "name": "MASJID ABU HURAIRAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "fd491f39-6a1c-4d8a-8415-3540160cbc2a",
    "geohash": "w2861xj89u",
    "remarks": "Sebelum adanya Masjid Abu Hurairah yang terkini, Kampung Batu mempunyai sebuah Masjid yang kecil terletak di tepi jalan yang berhampiran dengan Sungai Batu. Lokasinya ialah bersebelahan dengan bangunan Masjid Abu Hurairah yang sedia ada. Ianya dapat menampung anak-anak kariah sekitar kawasan Kg Batu ini yang tidak begitu ramai pada masa itu. Untuk tujuan Solat Jumaat, Masjid ini pada waktu itu dapat menampung ahli-ahli tentera dari Kem Batu Kentonmen dan kawasan setinggan Kg Stesyen yang kini sudah tidak wujud lagi. Dalam tahun-tahun tujuh puluhan, kawasan ini mula membangun dengan begitu pesat dan wujudnya Taman-Taman Perumahan seperti Kompleks Rumah Pangsa Jalan Kuching, Taman Sri Delima, Taman Beringin dll yang menyebabkan sebuah Masjid yang lebih besar amat ketara diperlukan. Lalu ditubuhkan sebuah Jawatankuasa Penaja Pembinaan Masjid Baru yang diketuai oleh bekas Senator Haji Ibrahim Yaacob (Allahyarham) Bermulalah satu kempen kutipan derma untuk pembinaan Masjid baru secara intensif dan meluas. Sumber sumbangan yang kedua ialah daripada pihak Kerajaan Negeri Selangor dibawah pimpinan Menteri Besar pada ketika itu iaitu Allahyarham Dato’ Haji Harun Idris. Ini kerana pada peringkat perancangan Masjid baru ini Wilayah Persekutuan Kuala Lumpur masih belum lagi wujud. Sumber sumbangan yang ketiga ialah daripada Kerajaan Pusat dibawah Perdana Menteri pada ketika itu iaitu Allahyarham Tun Haji Abd Razak bin Hussein. Hasil daripada kutipan ini dan sumbangan Kerajaan Negeri Selangor dan Kerajaan Pusat bermulalah kerja-kerja pembinaan pada tahun 1973. Tidak dapat maklumat kos sebenar pembinaan Masjid baru ini. Pembinaan Masjid baru ini dibuat di atas tapak tanah Kerajaan yang terletak bersebelahan dengan bangunan Masjid yang lama. Masjid yang telah siap dirasmikan oleh bekas Perdana Menteri Kedua Allahyarham Tun Haji Abd Razak bin Hussein pada 21 Mac 1975. Masjid baru ini diberi nama Masjid Jamek Kg Batu. Oleh kerana kebelakangan ini kebanyakan Masjid-Masjid dalam Wilayah Persekutuan Kuala Lumpur diberi nama-nama yang lebih khusus, maka mulai 1 Julai 2007 Masjid Jamek Kg Batu ditukar kepada Masjid Abu Hurairah.",
    "source_musolla_id": "MY-14-WKL-00015",
    "provision": "Kemudahan yang terdapat pada masjid ini ialah Khutbah Multimedia, Tadika, Tempat Letak Kereta, Kuaters, Tanah Perkuburan, Van Jenazah dan Pakej Pengurusan Jenazah."
  },
  "w2861s912b": {
    "address": "Kampung Segambut Luar, Kuala Lumpur, Wilayah Persekutuan, Malaysia 51200",
    "contact": "03-62577362",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.189001,
      "longitude": 101.668893
    },
    "name": "MASJID AL-FIRDAUS",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "1e7ff084-4c00-49df-96fb-df14fc45de68",
    "geohash": "w2861s912b",
    "remarks": "Di peringkat permulaannya, tapak Masjid Al-Firdaus adalah merupakan sebuah tapak madrasah dan pusat pengajian agama yang ditubuhkan di atas inisiatif para penduduk Kampong Segambut luar. Ia adalah bertujuan menjadikan madrasah ini sebagai tempat tumpuan khusus bagi para penduduk dan masyarakat sekitarnya untuk mendirikan solat jemaah serta menjalankan aktiviti keagamaan dan kemasyarakatan.\r\n\r\nMelalui daya usaha pengasas Masjid iaitu Allahyarham Tuan Haji Syed Bin Ibrahim, beliau telah bersetuju untuk mewakafkan dua bidang tanah. Salah satu darinya, diwakafkan untuk dijadikan tanah perkuburan Islam yang baru bagi menggantikan tanah perkuburan sedia ada di Batu 3 Jalan Ipoh yang tidak dapat menampung keperluan masyarakat sekitarnya. Manakala sebidang tanah telah diwakafkan untuk dijadikan tapak asal masjid serta medan letak kereta bagi kemudahan jemaah masjid.",
    "source_musolla_id": "MY-14-WKL-00008",
    "provision": "Kemudahan-kemudahan yang terdapat di masjid ini ialah:-\r\n1. Van jenazah\r\n2. Dewan kuliah\r\n3. Dewan serbaguna\r\n4. Kuaters\r\n5. Pusat Pentadbiran"
  }
}