{
  "w28644yvht": {
    "address": "Bandar Baru Sentul, Kuala Lumpur, Wilayah Persekutuan, Malaysia 51000",
    "contact": "03-40449611",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.180056,
      "longitude": 101.698925
    },
    "name": "MASJID AMRU BIN AL-ASS",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "c92ff30f-fa52-47bf-bf56-439dc6fa2be9",
    "geohash": "w28644yvht",
    "remarks": "Masjid Amru Ibni Al Ass telah mula dibina pada 03 Mei 2995, siap pada 18 Ogos 1997 dengan harga pembinaan sebanyak RM4,546,482.19 dan diguna sepenuhnya pada awal tahun 1998. Sebelum ianya didaftarkan oleh Jabatan Agama Islam Wilayah Persekutuan, masjid ini dikenal dengan nama Masjid Bandar Baru Sentul. Hanya pada 12 Julai 1999 bersamaan 27 Rabiulawal 14200H masjid ini telah didaftarkan atas nama Masjid Amru Ibni Al Ass oleh Jabatan Agama Islam Wilayah Persekutuan Kuala Lumpur dengan No. Pendaftaran JAWI/5/034.\r\n\r\nPengurusan dan pentadbiran masjid ini adalah terletak di bawah tanggungjawab jawatankuasa yang dinamakan oleh Majlis Agama Islam Wilayah Persekutuan (MAWIP) kepada Duli Yang Maha Mulia Seri Paduka Baginda Yang Dipertuan Agung. Setiap Ahli Jawatankuasa yang dilantik akan memegang jawatan tersebut selama 2 tahun. Selepas 2 tahun mereka boleh ditamatkan atau menyambung tudas mereka sebagai Ahli Jawatankuasa menurut budibicara MAWIP. Struktur organisasi Jawatankuasa Pengurusan dan Pentadbiran Masjid Amru Ibni Al Ass terdiri daripada seorang Pengerusi, seorang Timbalan Pengerusi, seorang Setiausaha, seorang Bendahari dan tujuh orang Ahli Jawatankuasa.                      \r\n\r\nPegawai-pegawai dan kakitangan masjid adalah terdiri daripada:-\r\n\r\nPerlantikan JAWI: Seorang Imam / Ketua Amil dengan jawatan tetap Gred S41, dua orang Imam Ratib dicadang oleh Jawatankuasa Pengurusan & Pentadbiran Masjid dan dimajukan kepada Pentadbiran JAWI untuk kelulusan, seorang Bilal Ratib dicadang oleh Jawatankuasa Pengurusan 7 Pentadbiran Masjid kepada dan dimajukan Pentadbiran JAWI untuk kelulusan.",
    "source_musolla_id": "MY-14-WKL-00026",
    "provision": "Kemudahan-kemudahan yang terdapat di masjid ialah:-\r\n1. Menyediakan bilik kuliah dan kaunseling\r\n2. Bilik VVIP\r\n3. Bilik Jurunikah\r\n4. Bilik mandi jenazah \r\n5. van jenazah \r\n6. dewan makan\r\n7. bilik mesyuarat\r\n8. pejabat imam / bilal\r\n9. pejabat jawatankuasa masjid \r\n10.mesen atm bimb"
  }
}