{
  "w2861xj89u": {
    "address": "Jalan Kepong Baru, Kampung Batu, 51200 Kuala Lumpur, Wilayah Persekutuan, Malaysia 51200",
    "contact": "03-62517711",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.202627,
      "longitude": 101.675116
    },
    "name": "MASJID ABU HURAIRAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "fd491f39-6a1c-4d8a-8415-3540160cbc2a",
    "geohash": "w2861xj89u",
    "remarks": "Sebelum adanya Masjid Abu Hurairah yang terkini, Kampung Batu mempunyai sebuah Masjid yang kecil terletak di tepi jalan yang berhampiran dengan Sungai Batu. Lokasinya ialah bersebelahan dengan bangunan Masjid Abu Hurairah yang sedia ada. Ianya dapat menampung anak-anak kariah sekitar kawasan Kg Batu ini yang tidak begitu ramai pada masa itu. Untuk tujuan Solat Jumaat, Masjid ini pada waktu itu dapat menampung ahli-ahli tentera dari Kem Batu Kentonmen dan kawasan setinggan Kg Stesyen yang kini sudah tidak wujud lagi. Dalam tahun-tahun tujuh puluhan, kawasan ini mula membangun dengan begitu pesat dan wujudnya Taman-Taman Perumahan seperti Kompleks Rumah Pangsa Jalan Kuching, Taman Sri Delima, Taman Beringin dll yang menyebabkan sebuah Masjid yang lebih besar amat ketara diperlukan. Lalu ditubuhkan sebuah Jawatankuasa Penaja Pembinaan Masjid Baru yang diketuai oleh bekas Senator Haji Ibrahim Yaacob (Allahyarham) Bermulalah satu kempen kutipan derma untuk pembinaan Masjid baru secara intensif dan meluas. Sumber sumbangan yang kedua ialah daripada pihak Kerajaan Negeri Selangor dibawah pimpinan Menteri Besar pada ketika itu iaitu Allahyarham Dato’ Haji Harun Idris. Ini kerana pada peringkat perancangan Masjid baru ini Wilayah Persekutuan Kuala Lumpur masih belum lagi wujud. Sumber sumbangan yang ketiga ialah daripada Kerajaan Pusat dibawah Perdana Menteri pada ketika itu iaitu Allahyarham Tun Haji Abd Razak bin Hussein. Hasil daripada kutipan ini dan sumbangan Kerajaan Negeri Selangor dan Kerajaan Pusat bermulalah kerja-kerja pembinaan pada tahun 1973. Tidak dapat maklumat kos sebenar pembinaan Masjid baru ini. Pembinaan Masjid baru ini dibuat di atas tapak tanah Kerajaan yang terletak bersebelahan dengan bangunan Masjid yang lama. Masjid yang telah siap dirasmikan oleh bekas Perdana Menteri Kedua Allahyarham Tun Haji Abd Razak bin Hussein pada 21 Mac 1975. Masjid baru ini diberi nama Masjid Jamek Kg Batu. Oleh kerana kebelakangan ini kebanyakan Masjid-Masjid dalam Wilayah Persekutuan Kuala Lumpur diberi nama-nama yang lebih khusus, maka mulai 1 Julai 2007 Masjid Jamek Kg Batu ditukar kepada Masjid Abu Hurairah.",
    "source_musolla_id": "MY-14-WKL-00015",
    "provision": "Kemudahan yang terdapat pada masjid ini ialah Khutbah Multimedia, Tadika, Tempat Letak Kereta, Kuaters, Tanah Perkuburan, Van Jenazah dan Pakej Pengurusan Jenazah.",
    "directions": "Masjid ini berada di kawasan perumahan Kampung Batu, Taman Batu Permai, Taman Mastiara dan PPR Pekan Batu."
  }
}