{
  "w2865wj0s4": {
    "address": "Ulu Kelang, Melawati, Selangor, Malaysia 68000",
    "contact": "03 -42516734",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.197121,
      "longitude": 101.762417
    },
    "name": "MASJID AL RIDHUAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "32325770-f421-4ac9-8e9c-68112923e917",
    "geohash": "w2865wj0s4",
    "remarks": "Masjid ini telah siap dibina pada tahun 1984 dan ianya masih lagi belum dirasmikan. Masjid ini sebenarnyan masih mengumpul dana untuk menaiktaraf prasarananya bagi menjadikannya sebagai sebuah masjid berkonsepkan Solat dan Rehat (S&R), iaiitu sebuah masjid yang selesa , moden dan bersih kepada pengunjung-pengunjung masjid .Projek yang akan menelan belanja melebihi RM 750 ribu ini akan dibina dalam beberapa fasa , dimulai dengan Fasa 1 dengan membina sebuah tandas awam baru yang moden dan bersih. Pembinaan tandas sekarang telah 50% siap dan dijangka siap sepenuhnya pada akhir Mei 2011. Fasa-fasa seterusnya merangkumi pembinaan ruang dan tempat seperti Ruang Rehat Umum, Ruang Menunggu dan Tempat Wudhu Muslimat, Pusat Khidmat Masjid, Kiosk Jualan , Foyer, Dewan Serbaguna dll. Dengan terbinanya prasarana di atas akan menjadikan MAR sebuah masjid yang memenuhi ciri pusat wahana transformasi ummah.",
    "source_musolla_id": "MY-10-GBK-00050",
    "provision": "Didalam masjid ini terdapat sebuah sekolah Maahad Tafizh Al-Ridhuan yang mana ianya dapat menempatkan dalam kira-kira 200 orang pelajar. Didalamnya juga terdapat sebuah kantin yang disediakan oleh pihak masjid utuk kegunaan pelajar-pelajar Maahad Tahfiz Al-ridhuan. \r\n\r\nPihak masjid juga menyediakan tempat parkir motor berbumbung dan juga parkir kereta yang boleh menempatkan lebih 20 buah kereta dalam satu masa,menyediakan gerai untuk jualan,wakaf untuk  berehat ,telefon awam dan masjid ini juga terdapat bilik perpustakaan yang boleh digunakan oleh para jemaah dan pelajar-pelajar tahfiz."
  }
}