{
  "w28646nptc": {
    "address": "Titiwangsa, Kuala Lumpur, Wilayah Persekutuan, Malaysia 53200",
    "contact": "03-40236897",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.176342,
      "longitude": 101.708936
    },
    "name": "MASJID IBNU SINA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "27185c88-8498-4573-af67-faa9263d4b0c",
    "geohash": "w28646nptc",
    "remarks": "Pada tahun 1985, penduduk sekitar Tasik Titiwangsa telah menyuarakan kepada Jabatan Agama Islam Wilayah Persekutuan (JAWI) untuk membina sebuah surau dengan persetujuan Masjid Jameul Ehsan, Setapak.    \n\nAhli Jawatankuasa Bertindak Sementara telah ditubuhkan pada tahun 1985 bagi tujuan menyelaras dan membina sebuah surau di atas tapak sedia ada. Proses untuk membina surau ini telah berlarutan sehingga tahun 1992 di mana dengan kerjasama Ahli Parlimen Titiwangsa masa itu iaitu YB. Drs. Sulaiman Mohamed yang juga Timbalan Menteri Jabatan Perdana Menteri telah mendapat peruntukan Wakil Rakyat sebanyak RM400,000.00 bagi pembinaan sebuah surau atas nama Surau Titiwangsa. Pembinaan Surau Titiwangsa telah dimulakan pada akhir tahun 1998 dan siap sepenuhnya pada tahun 2000. Ianya digunakan sepenuhnya oleh anak kariah pada 20 April 2000. Pentadbiran Surau telah dilantik di kalangan anak-anak kariah tiap-tiap sesi selama 2 tahun sekali. Dengan kerjasama yang erat dari semua anak kariah  bagi mengimarahkan surau, beberapa program dan aktiviti telah diadakan pada setiap masa. Pada 17 Ogos 2006, Mesyuarat Jawatankuasa Perundingan Hukum Syara' Wilayah Persekutuan kali ke-66 telah meluluskan permohonan Jawatankuasa Surau Titiwangsa untuk mendirikan Jumaat dan surau telah dinaik-taraf kepada Surau Jumaat pada 6 Oktober 2006 bersamaan 13 Ramadhan 1427H. Setelah surau dinaik-taraf untuk mendirikan solat Jumaat, Duli YMM Seri Paduka Baginda Yang Dipertuan Agong ke-12, iaitu DYMM Tuanku Syed Sirajuddin Ibni Al-Marhum Tuanku Syed Putra Jamalullail telah berangkat menunaikan solat sunat Jumaat Titiwangsa pada 3 November 2006. Selanjutnya, di Mesyuarat Jawatankuasa Perundingan Hukum Syara' Wilayah Persekutuan kali ke-72 pada 21 September 2008 bersamaan 21 Ramadhan 1429 H bersetuju menaik-taraf Surau Jumaat Titiwangsa kepada masjid sepenuhnya. Sempena kenaikan taraf kepada masjid, pada hari Jumaat 7 November 2008, YBhg. Dato' Sohibus Samahah Mufti Wilayah Persekutuan telah berkenan membaca Khutbah Khas dan lantas menamakan Masjid Titiwangsa kepada Masjid Ibnu Sina. Tuan    Buat masa ini, Masjid Ibnu Sina dapat memuat jemaah lebih kurang 900 orang. Justeru itu, bagi persediaan di mana anak-anak kariah bertambah dari masa ke semasa, maka pihak Ahli Jawatankuasa telah bersetuju untuk mendirikan sebuah bangunan masjid yang baru yang dilengkapi dengan segala kemudahan sebagaimana di dalam pelan bangunan yang telah disediakan oleh Arkitek ICB Sdn Bhd.",
    "source_musolla_id": "MY-14-WKL-00053",
    "provision": "Antara kemudahan yang terdapat ialah  ruang parkir yang kecil dan pejabat pentadbiran masjid.   .",
    "directions": "Masjid ini terletak berhampiran dengan TM Point dan 2km daripada Taman Tasik Titiwangsa."
  }
}