{
  "w286196msq": {
    "address": "Kompleks Kerajaan, Kuala Lumpur, Wilayah Persekutuan, Malaysia 50480",
    "contact": "03-62018779",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.17191,
      "longitude": 101.67076
    },
    "name": "MASJID WILAYAH PERSEKUTUAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "b1996f17-67fb-4fdd-a2eb-248f07406986",
    "geohash": "w286196msq",
    "remarks": "Pembinaan Masjid Wilayah ini direalisasikan pada 25 Syawal 1416 Hijri bersamaan 15 Mac 1996 Masihi dan siap dibina pada 30 Ogos 2000 Masihi. Upacara serah milik kepada pihak Jabatan Agama Islam Wilayah (JAWI) pada September 2000 Masihi.\r\nMasjid Wilayah Persekutuan terletak di sebuah kawasan berbukit Jalan Duta, berhampiran susur masuk ke pusat bandaraya Kuala Lumpur. Tapak binaannya berkeluasan kira-kira 13.4 hektar, iaitu di atas tapak bekas mahkamah dan pejabat kerajaan. Cadangan pembangunan Masjid Wilayah ini diilhamkan oleh Tun Dr. Mahathir ketika menjadi Perdana Menteri keempat. Ia merupakan projek Jabatan Agama Islam Wilayah Persekutuan Kuala Lumpur (JAWI) dan diiktiraf berstatus Masjid Negeri.",
    "source_musolla_id": "MY-14-WKL-00002",
    "provision": "Masjid Wilayah ini dilengkapi dengan sekolah pendidikan Islam. Asrama, perpustakaan dan kemudahan bilik komputer turut disediakan. Selain kegiatan pembelajaran, aktiviti yang dilaksanakan ialah sambutan hari kebesaran Islam, ceramah, mesyuarat dan aktiviti kemasyarakatan yang disertai oleh semua golongan umat Islam. Masjid Wilayah ini menjadi antara tempat kunjungan wajib para pelancong dari dalam dan luar negara."
  },
  "w2864qckpv": {
    "address": "Kampung Sungai Merali, Setapak, Wilayah Persekutuan, Malaysia 53100",
    "contact": "03-40231598",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.201855,
      "longitude": 101.702496
    },
    "name": "MASJID JAMEK SAAD IBN WAQQAS",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "5230007b-1664-4b40-aa5c-64d2e76b8eed",
    "geohash": "w2864qckpv",
    "remarks": "Masjid ini telah mula dibina pada 10 April 1998 dan sia digunakan pada 1hb, Disember 1998 hasil dari sumbangan JAWI sebanyak RM2 juta dan Yayasan Fazlan Berhad sebanyak RM 500,000. Masjid ini dibina diatas tanah yang diwakafkan oleh Tuan Hj. Abd Kadir bin Hj Abd Majid.",
    "source_musolla_id": "MY-14-WKL-00031",
    "provision": "Antara kemudahan yang terdapat ialah ruang parkir, dewan dan ruang solat yang selesa."
  },
  "w28602pd5g": {
    "address": "Kampung Sungai Penchala, Kuala Lumpur, Wilayah Persekutuan, Malaysia 60000",
    "contact": "03-77337306",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.164427,
      "longitude": 101.623013
    },
    "name": "MASJID AL-HIDAYAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "6d520ddb-9951-4662-9ca0-ae10a78f6ae4",
    "geohash": "w28602pd5g",
    "remarks": "Masjid ini dibina diaats tanah yang diwakafkan oleh Allahyarham Tuan Haji Sanusi. Ianya dibina bagi keperluan penduduk di Sungai penchala. Masjid ini telah dirasmikan oleh SPBYDPA Tuanku Mizan Zainal Abidin pada 10/12/2010.",
    "source_musolla_id": "MY-14-WKL-00050",
    "provision": "Antara kemudahannya ialah ruang parkir dan solat yang selesa."
  },
  "w28614sqsz": {
    "address": "Bukit Segambut, Kuala Lumpur, Wilayah Persekutuan, Malaysia 51200",
    "contact": "03-62570533",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.178953,
      "longitude": 101.651552
    },
    "name": "MASJID UBUDIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "bc6ee0ef-4df5-4854-98cb-2c7830d045ff",
    "geohash": "w28614sqsz",
    "remarks": "Masjid ini telah dibina pada tahun 1964 diatas tanah wakaf lebih kurang suku ekar dan telah diubahsuai sebanyak dua kali. Ianya telah dirasmikan oleh DYMM Sultan Selangor pada 1/1/1970,",
    "source_musolla_id": "MY-14-WKL-00035",
    "provision": "Antara kemudahan yang terdapat ialah perpustakaan, dewan jamuan, bilik kuliah dan kaunselling dan ruang solat yang selesa."
  },
  "w28662ez1y": {
    "address": "Kampung Sungai Mulia, Setapak, Wilayah Persekutuan, Malaysia 53000",
    "contact": "0126182750",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.211989,
      "longitude": 101.705672
    },
    "name": "MASJID ZAID BIN HARITSAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "19a0347c-b450-4d55-9c39-da8f43339c03",
    "geohash": "w28662ez1y",
    "source_musolla_id": "MY-14-WKL-00052"
  },
  "w2863mejb6": {
    "address": "Taman Wilayah Selayang, 68100 Kuala Lumpur, Wilayah Persekutuan, Malaysia 68100",
    "contact": "03-61370018",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.239218,
      "longitude": 101.660632
    },
    "name": "MASJID AL-ZAKIRIN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "6840200f-1884-4429-aa11-8d2e5703815e",
    "geohash": "w2863mejb6",
    "source_musolla_id": "MY-14-WKL-00045"
  },
  "w2864bmn23": {
    "address": "Kampung Datuk Keramat, Kuala Lumpur, Wilayah Persekutuan, Malaysia 54000",
    "contact": "03-42570529",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.166516,
      "longitude": 101.729292
    },
    "name": "MASJID AL-AKRAM",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "6ee506ba-13e4-4ed4-b5ed-3aa4c011e486",
    "geohash": "w2864bmn23",
    "remarks": "Masjidul Akram Kampong Dato' Keramat mula dibina lebih kurang tiga bulan selepas peristiwa berdarah 13 Mei 1969. Hampir sebulan lamanya penduduk Kg. Dato' Keramat tidak dapat keluar menunaikan sembahyang Waktu dan sembahyang Jumaat di masjid lama yang terletak di antara Lorong Keramat 16 dan 17 kerana perintah berkurung ekoran daripada peristiwa 13 Mei itu. Setelah siap pembinaanya pada 31 Mei 1971, Masjidul Akram ini dikatakan sebagai masjid tercantik dan termoden di Kuala Lumpur pada masa itu. Pada bulan Ogos 1971, masjid baru itu mula digunakan sebagai tempat ibadah sempena bulan Ramadhan 1391 dengan peralatan-peralatan yang serba kekurangan yang dipindahkan dari masjid lama. Sejak awal tahun 1972 apabila tertubuh Ahli Jawatankuasa yang mula-mula sekali mentadbir Masjidul Akram yang diketuai oleh Encik Mohd Idris bin Ibrahim (sekarang Dato' Haji Idris bin Ibrahim) dan timbalannya Allahyarham Cikgu Haji Mohd Yasin b. Haji Salleh, berbagai usaha telah dibuat untuk mengadakan segala kemudahan bagi keselesaan para jemaah. Kemuncak pembangunan dan kejayaan Masjidul Akram ini bermula dari tahun 1985 apabila usaha-usaha untuk memakmur dan mengimarahkan masjid dipergiatkan lagi dari tahun ke setahun. Kejayaan dan pencapaian cemerlang AJK masjid dari berbagai aspek, diiktiraf oleh Jabatan Agama Islam Wilayah Persekutuan (JAWI) apabila Masjidul Akram ini dipilih sebagai \"Masjid Contoh\" di antara lebih 30 buah masjid di Wilayah Persekutuan sebanyak dua kali iaitu pada tahun 1990 dan 1994 dengan hadiah wang sebanyak RM 7,000.00. Kejayaan dan kemajuan tidak akan dapat dicapai tanpa sokongan dan kerjasama daripada para jemaah dan umat islam keseluruhannya. SOkongan yang berupa wang ringgit, tenaga dan buah fikiran meningkat dari tahun ke setahun. Hal ini menambah lagi semangat dan keazaman AJK yang ada sekarang untuk terus berusaha memakmurkan lagi masjid dalam segala bidang, InsyaAllah. Usaha menulis dan mencatat sejarah ringkas pembangunan Masjid Al-Akram sempena suku abad terdirinya masjid ini dibuat dengan tujuan sebagai mengenang jasa dan perngorbanan 'Orang-Orang Lama' yang kebanyakannya telahpun kembali ke Rahmatullah yang telah bersusah payah dan bertungkus lumus berusaha mendirikan Rumah Allah yang dimuliakan ini. Mudah-mudahan jasa dan pengorbanan mereka itu diterima Allah dan diberi sebaik-baik balasan. Disamping itu diharap buku kecil yang tidak sepertinya ini akan dijadikan bahan rujukan mengingati kembali seharah satu-satunya mercu yanda di Kg.Dato' Keramat ini.",
    "source_musolla_id": "MY-14-WKL-00003",
    "provision": "Kemudahan-kemudahan yang terdapat di masjid ialah:-\n1. Rumah Pangsa empat tingkat bagi menamping perbelanjaan penyelenggaraan masjid tiap-tiap bulan.\n2. Sekolah Rendah Agama Al-Akram\n3. Tanah Perkuburan Islam Dato' Keramat\n4. Taman Rekreasi \n5. Van jenazah"
  },
  "w2861m3wp6": {
    "address": "Kampung Sungai Udang, Kuala Lumpur, Wilayah Persekutuan, Malaysia 52000",
    "contact": "03-62595562",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.193947,
      "longitude": 101.658873
    },
    "name": "MASJID AL-QURTUBI",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "d4066b1a-b97d-4f7d-b493-c4a88dca8d6d",
    "geohash": "w2861m3wp6",
    "source_musolla_id": "MY-14-WKL-00043",
    "provision": "Masjid ini menyediakan Sekolah Agama dan mempunyai deretan rumah untuk kakitangan masjid."
  },
  "w2860w578f": {
    "address": "Jalan Taman Bukit Maluri, Taman Bukit Maluri, 52100 Kuala Lumpur, Wilayah Persekutuan, Malaysia 52100",
    "contact": "03-62773424",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.197635,
      "longitude": 101.628035
    },
    "name": "MASJID AL-IMAM AL-GHAZALI",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "3749d91e-10b3-4578-9a50-07961598eb97",
    "geohash": "w2860w578f",
    "source_musolla_id": "MY-14-WKL-00046",
    "provision": "Kemudahan-kemudahan yang terdapat di masjid ialah:-\n1. Van jenazah\n2. Dewan seminar\n3. Court Badminton\n4. Gelanggang Futsal."
  },
  "w2863cz612": {
    "address": "Taman Perindustrian IKS Mukim Batu, Kuala Lumpur, Wilayah Persekutuan, Malaysia 56000",
    "contact": "03-62575227",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.217966,
      "longitude": 101.688484
    },
    "name": "MASJID SAIDINA HAMZAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "f7b16580-803a-49b0-b16d-ccf00ead9108",
    "geohash": "w2863cz612",
    "remarks": "Penduduk kariah Kampung Batu Muda sebelum pembinaan Masjid Saidina Hamzah bersolat Jumaat di Surau Ibrahimmiyah. Setelah berkembang pesat dan pertambahan penduduk Kampung Batu Muda, anak-anak kariah merasakan perlu mempunyai sebuah masjid sendiri bagi melaksanakn ibadat dan aktiviti kemasyarakatan. Pada 21 September 1986, Pejabat Tanah dan Galian Kuala Lumpur telah meluluskan tapak tanah seluas 2.5 ekar untuk pembinaan masjid baru.Pada 16 Ogos 1986 tanah tersebut telah diwakafkan kepada Majlis Agama Islam Wilayah Persekutuan (MAIWP) dan sejumlah RM 7.6 juta diperuntukkan untuk membina masjid ini. Pada awalnya masjid ini dinamakan Masjid Jamek Kampung Batu akan tetapi setelah setahun masjid ini beroperasi JAWI telah membuat penjenamaan semula kepada Masjid Saidina Hamzah dan diletakkan di bawah pentadbiran Pajabat Pusat Zon 1 Bahagian Pengurusan Kariah, JAWI.",
    "source_musolla_id": "MY-14-WKL-00017",
    "provision": "Kemudahan-kemudahan yang disediakan ialah Sekolah Rendah Agama ( SRA ), 4 unit kuarters, dewan serbaguna, sebuah bilik mesyuarat dan tempat meletak kereta."
  },
  "w2866dyg9q": {
    "address": "Jalan Taman Melati 1/5, Taman Melati, 53100 Setapak, Wilayah Persekutuan, Malaysia 53100",
    "contact": "03-41475133",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.223751,
      "longitude": 101.720757
    },
    "name": "MASJID SALAHUDDIN AL-AYYUBI",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "0e0af5c5-ef25-4ae2-a2f4-1e21a0237591",
    "geohash": "w2866dyg9q",
    "remarks": "Masjid Salahuddin Al-Ayubi merupakan antara masjid yang menarik yang terletak di Kuala Lumpur. Masjid yang terletak di Taman Bukit Jati ini dibina pada 17 Zulhijjah 1427 Hijri bersamaan 8 Disember 2006 Masihi. Masjid ini berkonsepkan reka bentuk Timur Tengah dan moden.\r\n\r\nHiasan dalamannya turut mengetengahkan konsep hiasan seperti yang terdapat di dalam masjid-masjid di Timur Tengah. Masjid ini telah dijadikan tempat beribadah dan menjalankan aktiviti keagamaan oleh penduduk sekitar. Pengunjung akan bertambah ramai ketika menunaikan solat Jumaat kerana ia terletak di lokasi yang mudah disinggahi oleh orang ramai.",
    "source_musolla_id": "MY-14-WKL-00013",
    "provision": "dewan serbaguna,dewan makan, tempat pakir kereta, tandas dan tempat wuduk yang selesa, laluan oku, bilik mesyuarat, perpustakaan, bilik pengajian al-quran"
  },
  "w2866s84h3": {
    "address": "Selangor, Batu Caves, Malaysia 68100",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.233077,
      "longitude": 101.711613
    },
    "name": "MASJID AL -SYARIFF",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "607adf5d-2cde-482d-ac26-65061cb72edf",
    "geohash": "w2866s84h3",
    "remarks": "Dalam tahun 1890 lebih kurang 116 tahun yang lalu telah datang beberapa orang dari Sumatera dari suku kaum Minangkabau ke Kampung Simpang Tiga, Gombak sebagai satu penghijrahan yang mana pada masa itu kampung kecil tersebut didiami oleh hanya beberapa keluarga melayu sebagai penduduk asal. Lalu dibina sebuah surau untuk dijadikan tempat ibadat, terutamanya solat jumaat. Masjid ini sering menjadi singgahan bagi pengunjung-pengunjung dari pantai timor sebelum tiba di Kuala Lumpur.",
    "source_musolla_id": "MY-10-GBK-00054",
    "provision": "Antara kemudahan yang terdapat ialah  ruang parkir, pejabat, dewan  dan  ruangan solat yang luas.,"
  },
  "w2863tj58g": {
    "address": "Batu Caves, Selangor, Malaysia 68100",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.236094,
      "longitude": 101.674388
    },
    "name": "MASJID JAMEK AL - AMANIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "fd7957b2-5026-462f-820d-8c0db56362af",
    "geohash": "w2863tj58g",
    "source_musolla_id": "MY-10-GBK-00043",
    "provision": "Antara kemudahan yang terdapat ialah ruang solat untuk lelaki dan perempuan, bilik pejabat  dan ruang parkir yang besar."
  },
  "w2861xj89u": {
    "address": "Jalan Kepong Baru, Kampung Batu, 51200 Kuala Lumpur, Wilayah Persekutuan, Malaysia 51200",
    "contact": "03-62517711",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.202627,
      "longitude": 101.675116
    },
    "name": "MASJID ABU HURAIRAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "fd491f39-6a1c-4d8a-8415-3540160cbc2a",
    "geohash": "w2861xj89u",
    "remarks": "Sebelum adanya Masjid Abu Hurairah yang terkini, Kampung Batu mempunyai sebuah Masjid yang kecil terletak di tepi jalan yang berhampiran dengan Sungai Batu. Lokasinya ialah bersebelahan dengan bangunan Masjid Abu Hurairah yang sedia ada. Ianya dapat menampung anak-anak kariah sekitar kawasan Kg Batu ini yang tidak begitu ramai pada masa itu. Untuk tujuan Solat Jumaat, Masjid ini pada waktu itu dapat menampung ahli-ahli tentera dari Kem Batu Kentonmen dan kawasan setinggan Kg Stesyen yang kini sudah tidak wujud lagi. Dalam tahun-tahun tujuh puluhan, kawasan ini mula membangun dengan begitu pesat dan wujudnya Taman-Taman Perumahan seperti Kompleks Rumah Pangsa Jalan Kuching, Taman Sri Delima, Taman Beringin dll yang menyebabkan sebuah Masjid yang lebih besar amat ketara diperlukan. Lalu ditubuhkan sebuah Jawatankuasa Penaja Pembinaan Masjid Baru yang diketuai oleh bekas Senator Haji Ibrahim Yaacob (Allahyarham) Bermulalah satu kempen kutipan derma untuk pembinaan Masjid baru secara intensif dan meluas. Sumber sumbangan yang kedua ialah daripada pihak Kerajaan Negeri Selangor dibawah pimpinan Menteri Besar pada ketika itu iaitu Allahyarham Dato’ Haji Harun Idris. Ini kerana pada peringkat perancangan Masjid baru ini Wilayah Persekutuan Kuala Lumpur masih belum lagi wujud. Sumber sumbangan yang ketiga ialah daripada Kerajaan Pusat dibawah Perdana Menteri pada ketika itu iaitu Allahyarham Tun Haji Abd Razak bin Hussein. Hasil daripada kutipan ini dan sumbangan Kerajaan Negeri Selangor dan Kerajaan Pusat bermulalah kerja-kerja pembinaan pada tahun 1973. Tidak dapat maklumat kos sebenar pembinaan Masjid baru ini. Pembinaan Masjid baru ini dibuat di atas tapak tanah Kerajaan yang terletak bersebelahan dengan bangunan Masjid yang lama. Masjid yang telah siap dirasmikan oleh bekas Perdana Menteri Kedua Allahyarham Tun Haji Abd Razak bin Hussein pada 21 Mac 1975. Masjid baru ini diberi nama Masjid Jamek Kg Batu. Oleh kerana kebelakangan ini kebanyakan Masjid-Masjid dalam Wilayah Persekutuan Kuala Lumpur diberi nama-nama yang lebih khusus, maka mulai 1 Julai 2007 Masjid Jamek Kg Batu ditukar kepada Masjid Abu Hurairah.",
    "source_musolla_id": "MY-14-WKL-00015",
    "provision": "Kemudahan yang terdapat pada masjid ini ialah Khutbah Multimedia, Tadika, Tempat Letak Kereta, Kuaters, Tanah Perkuburan, Van Jenazah dan Pakej Pengurusan Jenazah."
  },
  "w2863knznm": {
    "address": "Kuala Lumpur, Wilayah Persekutuan, Malaysia 50050",
    "contact": "03-61370607",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.231209,
      "longitude": 101.666034
    },
    "name": "MASJID ANAS BIN MALIK",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "41badcbc-fbe5-4a7a-9c82-3506b1bd7a99",
    "geohash": "w2863knznm",
    "remarks": "Kg. Selayang Lama asalnya diduduki oleh Puak Menedeling pada tahun 1888. Berdasarkan dakta sejarah Kuala Lumpur pada tahun 1868, seorang peniaga bernama Sultan Pusa dari Puak Mendeling telah membuka perniagaan di Kuala Lumpur dan melalui pengaruh yang dimiliki oleh beliau, Puak Mendeling dapat membuka tanah masjid ini. Di daerah Mukim Batu ini terbahagi kepada dua bagahian iaitu aliran Sungai Gombak dan Sungai Batu yang mana Puak Mendeling terlebih dahulu menerokai daerah Sungai Batu dan Puak Minangkabaupula  di daerah Sungai Gombak. Ketika itu, hanya terdapat 4 buah masjid sahaja di daerah Mukim Batu di mana imam Masjid Jamek Kg. Selayang Lama menjadi ketua imam di daerah Mukim Batu dan selaku Ketua Kg. Selayang Lama ketika itu ialah Ja'Parkas Bin Pakay (berasal dari Indonesia yang berhijrah ke Malaysia dan menetap di Malaysia dan menjadi ketua Kg. Selayang Lama ketika itu). Rekod sejarah pembukaan masjid pertama di bawah Kerajaan British ketika itu ialah pada tahun 1905. Kawasan masjid ini kawasan rizab melayu seperti yang diwartakan pada tahun 1905. Kawasan masjid ini ialah kawasan rizab melayu seperti yang diwartakan dalam rekod Geran Mukim (gm) 1787 di tanah masjid dan didaftarkan pada 3hb Mac 1987. Pembinaan pertama dibina pada awal tahun 1905 di atas lot 2049 yang terletak di dalam lot 2050. Masjid pertama telah dibina atas usaha orang kampung yang meneroka pembukaan tanah di sini dengan peruntukan sebanyak RM2650 dan RM 500 dari sumbangan Kerajaan British. Pembinaan demi pembinaan telah dibuat dan pembinaan kedua pula pada sekitar tahun 1922 yang telah dipantau oleh seorang pegawai British mewakili Kerajaan British. Pada 29hb April 1929 tanah bernombor lot 2050 ini telah diwakafkan oleh Kerajaan British kepada Majlis Ugama Islam Selangor (MUIS) dan Adat Istiadat Melayu Selangor (AIMS). Pembinaan terakhir iaitu pembinaan ketiga masjid ini adalah pada tahun 1961 sumbangan penuh oleh Kerajaan Persekutuan Tanah Melayu sebanyak RM50,000.00. Pentadbiran masjid ini telah ditadbir Kerajaan Selangor pada tahun 1972 sehingga tahun 1974. Apabila Kuala Lumpur diserahkan kepada Kerajaan Malaysia, masjid telah ditadbbir sepenuh ol;eh Kerajaan Wilayah Persekutuan dan kesemua masjid-masjid, surau-surau, madrasah, dan tanah wakaf adalah hak milik Majlis Agama Islam Wilayah Persekutuan (MAIWP) dan seperti yang tertulis dalam Perlembagaan Persekutuan mengikut akta 505 telah diluluskan oleh parlimen.",
    "source_musolla_id": "MY-14-WKL-00010"
  },
  "w28662efc3": {
    "address": "Kampung Sungai Mulia, Setapak, Wilayah Persekutuan, Malaysia 53000",
    "contact": "017-2018010",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.211236,
      "longitude": 101.705651
    },
    "name": "MASJID LAMA BATU 6",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "ade80fae-5853-4657-a20c-d0a23df51a55",
    "geohash": "w28662efc3",
    "remarks": "Masjid ini didirikan di atas tanah wakaf pada Julai 1931 dan ianya merupakan masjid tertua di Selangor.\r\nIanya dirasmikan oleh DYMM Sultan Selangor pada tahun 1990.",
    "source_musolla_id": "MY-10-GBK-00366",
    "provision": "Antara kemudahan yang terdapat di masjid ini ialah ruang solat yang selesa untuk lelaki dan wanita, tempat wuduk, tempat letak kereta, stor dan pejabat."
  },
  "w2865f3zc3": {
    "address": "Taman Bukit Utama, Melawati, Selangor, Malaysia 68000",
    "contact": "0341057286",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.177761,
      "longitude": 101.768822
    },
    "name": "MASJID BUKIT ANTARA BANGSA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "07fc573e-d674-4a14-a701-dbdf9d516944",
    "geohash": "w2865f3zc3",
    "source_musolla_id": "MY-10-GBK-00380",
    "provision": "Antara kemudahan yang terdapat di masjid ini ialah ruang solat yang selesa untuk lelaki dan wanita, tempat wuduk, tempat letak kereta, stor dan bilik kuliah."
  },
  "w2863zw8zm": {
    "address": "Batu Caves, Selangor, Malaysia 68100",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.249365,
      "longitude": 101.687709
    },
    "name": "MASJID ANNUR",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "1e38580c-cb4a-477c-86f7-05266be2bcb7",
    "geohash": "w2863zw8zm",
    "source_musolla_id": "MY-10-GBK-00379",
    "provision": "Antara kemudahan yang terdapat ialah  ruang parkir dan  ruangan solat yang selesa."
  },
  "w28642f6e6": {
    "address": "Hospital Kuala Lumpur, Kuala Lumpur, Wilayah Persekutuan, Malaysia 50586",
    "contact": "03-26913954",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.168626,
      "longitude": 101.703674
    },
    "name": "MASJID JAMEK KG. BARU",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "b50a884d-1efa-4929-a1a0-3b431e3b7b86",
    "geohash": "w28642f6e6",
    "remarks": "Peletakan batu asas masjid ini telah disempurnakan oleh YTM Tunku Abdul Rahman Putra Al-Haj pada 14 Zulhijjah 1379 Hijri bersamaan 12 Julai 1957 Masihi. Arkitek yang mereka bentuk bangunan ini berbangsa Cina bernama Y.T.Lee, manakala kontraktor yang terbabit ialah Chan Khiew. Masjid ini menjadi lambang perpaduan dan penyatuan pelbagai etnik Melayu sejak awal merdeka sehingga kini. Masjid ini kerap dikunjungi orang ramai dan pelancong menjadi kebanggaan masyarakat Kampung Baru.\r\n\r\nIa tidak pernah sunyi daripada aktiviti dan sering mendapat kunjungan dan perhatian para pemimpin. Masjid ini menjadi lebih meriah apabila tibanya bulan Ramadan, Syawal dan Hari Raya Korban. Pada bulan Ramadan, lazimnya solat Tarawih diimamkan oleh imam yang dijemput khas dari Mekah. Yang menarik di sini ialah keenakan bubur lambuk yang diusahakan secara bergotong-royong pada setiap tahun dan diberikan secara percuma kepada penduduk kota untuk berbuka puasa.",
    "source_musolla_id": "MY-14-WKL-00027",
    "provision": "1. RUANG SOLAT YANG LUAS, BERSIH,SELESA DAN BERHAWA DINGIN.\r\n2. MEMPUNYAI PEJABAT YANG SELESA.\r\n3. DEWAN KULIAH YANG BERHAWA DINGIN."
  },
  "w286jf0svt": {
    "address": "Kampung Kuala Perdik, Hulu Langat, Selangor, Malaysia 43100",
    "contact": "019-3870986",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.175892,
      "longitude": 101.855181
    },
    "name": "MASJID KARIAH KUALA PERDIK",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "1924951b-63ad-4ec5-9515-6190e5bf135b",
    "geohash": "w286jf0svt",
    "source_musolla_id": "MY-10-HL-00015",
    "provision": "Antara kemudahan yang terdapat ialah ruang parkir yang kecil dan ruangan solat."
  },
  "w28670rn7f": {
    "address": "Taman Wangsa Melawati, Setapak, Wilayah Persekutuan, Malaysia 53300",
    "contact": "0341497700",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.210466,
      "longitude": 101.743183
    },
    "name": "MASJID AL-MUTTAQIN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "3cef3a80-385e-458f-973d-ed087b5a4f1a",
    "geohash": "w28670rn7f",
    "remarks": "Pembinaan Masjid Al-Muttaqin telah bermula pada tahun 2000 dan siap dibina pada bulan Mei 2002. Masjid ini mula beroperasi pada 8 September 2002 bersamaan 1 Rejab 1423H. Pada awalnya, masjid ini dinamakan Masjid Wangsa Melawati, sehinggalah ia diberikan nama oleh pihak JAWI dengan nama AL-MUTTAQIN yang membawa maksud ORANG-ORANG BERTAKWA. Kariah masjid ini merangkumi beberapa buah taman perumahan sekitarnya iaitu Wangsa Perkasa, Wangsa Murni, Wangsa Ceria dan Wangsa Siaga dan lain-lain lagi. Sebelum kewujudan Masjid Usamah bin Zaid, semua urusan anak kariah Wangsa Maju dirujuk di Masjid ini.  \n\nPada awalnya, tapak masjid ini dirancang untuk dibina surau. Walaubagaimanapun, ia ditukar status untuk didirikan masjid disebabkan tapak asal Masjid Wilayah yang dirancang didirikan di Wangsa Maju telah dipindakan ke Jalan Duta.             \n\nIa juga dikenali sebagai sebuah Masjid Perlancongan. Terdapat dua buah surau yang terletak dibawah pentadbiran masjid ini iaitu Surau Wangsa Melawati dan Surau Al Kauthar, Wangsa Siaga.",
    "source_musolla_id": "MY-14-WKL-00047",
    "provision": "Kemudahan yang terdapat di masjid ini ialah:-\n1. Dewan Solat yang bersih. Dilengkapi 2 LCD dan papan layar.\n2. Sekolah Rendah Agama.\n3. 4 Unit Kuaters Kakitangan.\n4. Dewan Masjid berkapasiti 1200 orang.\n5. Bilik Pengurusan Jenazah dan Van Jenazah.\n6. Kemudahan Parkir Kereta yang luas.\n7. Ruang dapur masjid yang selesa dan lengkap.\n8. Bilik Imam/Bilal berhawa dingin."
  },
  "w28669bdyw": {
    "address": "Gombak, Setapak, Wilayah Persekutuan, Malaysia 53000",
    "contact": "0361899844",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.21813,
      "longitude": 101.7124
    },
    "name": "MASJID AL - SYAKIRIN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "cfc724f2-34ae-48fe-9a4e-7cdfa1235b11",
    "geohash": "w28669bdyw",
    "remarks": "Pada asalnya ia merupakan kebun sireh dan kemudiannya tanah ini diwakafkan dan dijadikan masjid   Masjid yang tersergam indah ini telah siap dibina pada tahun 1984 bagi menggantikan masjid batu 6 yang lama.",
    "source_musolla_id": "MY-10-GBK-00071",
    "provision": "Antara kemudahan yang terdapat di masjid ini ialah ruang solat yang selesa untuk lelaki dan wanita, tempat wuduk, tempat letak kereta, stor, CCTV, bilik kuliah berhawa dingin, tempat mandi jenazah"
  },
  "w286735888": {
    "address": "Taman Melawati, Melawati, Selangor, Malaysia 53100",
    "contact": "03- 41057593",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.213591,
      "longitude": 101.749223
    },
    "name": "MASJID AL - HIDAYAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "b3674972-279a-4119-827d-323ce51e78fa",
    "geohash": "w286735888",
    "remarks": "Sebuah surau iaitu di fasa B telah di naik tarafnya menjadi masjid tetapi tertanya masih lagi tidak mencukupi untuk menampung  jemaah disebabkan ruang  yang terhad dan hanya dapat menampung 500 jemaah sahaja..\r\n\r\nJawatankuasa masjid AlHidayah Taman Melawati telah membentuk  Jawatankuasa Pembangunan yang dipertangungjawabkan untuk merancang dan melaksanakan pembinaan sebuah Masjid di atas tapak seluas 4.5 ekar ini.",
    "source_musolla_id": "MY-10-GBK-00060",
    "provision": "Masjid ini mempunyai dewan solat utama untuk lelaki dan perempuan serta dewan solat tambahan di sebelah luarnya. Selain itu , terdapat juga bilik imam/bilal , bilik stor , pejabat , bilik mesyuarat , dapur , tempat wudhuk lelaki dan wanita .\r\n\r\nDi bahagian luar masjid terdapat gelangang futsal  yang mana ianya digunakan oleh penduduk sekitar dan juga digunakan untuk  pertandingan anjuran pihak masjid ini. Terdapat juga gerai gerai  untuk jualan pada hari- hari  tertentu"
  },
  "w286j8wf4s": {
    "address": "Kampung Jawa, Hulu Langat, Selangor, Malaysia 43100",
    "contact": "019-2768120",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.167175,
      "longitude": 101.852646
    },
    "name": "MASJID KARIAH KAMPUNG JAWA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "932e08b6-5b48-49b3-8666-7a2186fb8a03",
    "geohash": "w286j8wf4s",
    "source_musolla_id": "MY-10-HL-00355",
    "provision": "Antara kemudahan yang terdapat ialah  ruang parkir dan  ruangan solat yang luas. ,"
  },
  "w286djpttc": {
    "address": "Batu Caves, Selangor, Malaysia 68100",
    "contact": "03-40419233",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.280372,
      "longitude": 101.70001
    },
    "name": "MASJID AL-HIDAYAH (Sentul)",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "e9ba8a16-dec8-402d-8e9c-b4665b7c04c0",
    "geohash": "w286djpttc",
    "source_musolla_id": "MY-14-WKL-00024",
    "provision": "1-dewan solat utama\r\n2-tempat wuduk dan tandas SELESA\r\n3-bilik mandi\r\n4-dua pondok wakaf\r\n5-tempat meletak kereta\r\n6-bilik pengurusan jenazah\r\n7-dapur\r\n8-tandas\r\n9-van jenazah\r\n10-stor\r\n11-kuarters pegawai masjid\r\n12-pejabat pentadbiran\r\n13-bilik mesyuarat \r\n14-mesin pengeluaran wang automatik (ATM) Bank\r\nIslam."
  },
  "w2864djcsq": {
    "address": "Titiwangsa, Kuala Lumpur, Wilayah Persekutuan, Malaysia 53200",
    "contact": "03-26980133",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.175343,
      "longitude": 101.71951
    },
    "name": "MASJID SOLEHIN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "26a421a3-38e4-4740-90ee-f3305361b4b8",
    "geohash": "w2864djcsq",
    "source_musolla_id": "MY-14-WKL-00012"
  },
  "w2864vkdcr": {
    "address": "Taman Setapak Jaya, Setapak, Wilayah Persekutuan, Malaysia 53300",
    "contact": "03-40315860",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.193414,
      "longitude": 101.728648
    },
    "name": "MASJID ABU UBAIDAH AL-JARRAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "f4cbbce9-0185-4d7a-8fe7-6700f2e0a98a",
    "geohash": "w2864vkdcr",
    "remarks": "Projek pembinaan masjid ini adalah dikendalikan oleh Jabatan Kerjaraya Wilayah Persekutuan. Ia mula dibina pada 27hb Januari 1986 dan siap pada 24hb April 1987. Projek ini telah menelan belanja berjumlah  RM2,125,652.00. Masjid ini terletak di atas tapak seluas 3 ekar.",
    "source_musolla_id": "MY-14-WKL-00025",
    "provision": "Ia dapat menampung kira-kira 2500 jemaah sembahyang dan dilengkapi dengan kemudahan-kemudahan seperti Dewan Syarahan, Kelas Orang Kurang Upaya, Perpustakaan, Sekolah Agama dan Tadika, Pejabat, Bilik Jenazah dan rumah Kakitangan. Dengan adanya Masjid ini, kira-kira 50,000 oenduduk Islam di sekitar Jalan Genting Kelang telah mendapat perkhidmatan dan kemudahan yang disediakan dengan sebaik-baiknya."
  },
  "w28660ykhs": {
    "address": "Setapak, Wilayah Persekutuan, Malaysia 53000",
    "contact": "03-40223460",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.212841,
      "longitude": 101.698234
    },
    "name": "MASJID SAIDINA ALI KW",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "2069f090-258f-4735-896e-ce5387e70395",
    "geohash": "w28660ykhs",
    "remarks": "Masjid lama yang dibina pada tahun 1910. Pada tahun 1980 an, masjid lama tak dapat lagi menampung bilangan jemaah terutamanya semasa solat Jumaat dan solat Aidilfitri dan Aidiladha. Masjid Saidina Ali dibina untuk tujuan menampung jemaah. Peristiwa penting ialah tapak ditambak @ diratakan majlis dan pecah tanah dilakukan oleh bekas Perdana Menteri, Tun Abdullah bin Haji Ahmad Badawi pada 1991.",
    "source_musolla_id": "MY-14-WKL-00022",
    "provision": "Terdapat kemudahan seperti \r\n1-dewan solat utama \r\n2-Van jenazah\r\n3-bilik pentadbiran\r\n4-pejabat imam dan bilal\r\n5-BILIK MANDI JENAZAH\r\n6-DEWAN MAKAN\r\n7-BILIK MESYUARAT"
  },
  "w28644yvht": {
    "address": "Bandar Baru Sentul, Kuala Lumpur, Wilayah Persekutuan, Malaysia 51000",
    "contact": "03-40449611",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.180056,
      "longitude": 101.698925
    },
    "name": "MASJID AMRU BIN AL-ASS",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "c92ff30f-fa52-47bf-bf56-439dc6fa2be9",
    "geohash": "w28644yvht",
    "remarks": "Masjid Amru Ibni Al Ass telah mula dibina pada 03 Mei 2995, siap pada 18 Ogos 1997 dengan harga pembinaan sebanyak RM4,546,482.19 dan diguna sepenuhnya pada awal tahun 1998. Sebelum ianya didaftarkan oleh Jabatan Agama Islam Wilayah Persekutuan, masjid ini dikenal dengan nama Masjid Bandar Baru Sentul. Hanya pada 12 Julai 1999 bersamaan 27 Rabiulawal 14200H masjid ini telah didaftarkan atas nama Masjid Amru Ibni Al Ass oleh Jabatan Agama Islam Wilayah Persekutuan Kuala Lumpur dengan No. Pendaftaran JAWI/5/034.\r\n\r\nPengurusan dan pentadbiran masjid ini adalah terletak di bawah tanggungjawab jawatankuasa yang dinamakan oleh Majlis Agama Islam Wilayah Persekutuan (MAWIP) kepada Duli Yang Maha Mulia Seri Paduka Baginda Yang Dipertuan Agung. Setiap Ahli Jawatankuasa yang dilantik akan memegang jawatan tersebut selama 2 tahun. Selepas 2 tahun mereka boleh ditamatkan atau menyambung tudas mereka sebagai Ahli Jawatankuasa menurut budibicara MAWIP. Struktur organisasi Jawatankuasa Pengurusan dan Pentadbiran Masjid Amru Ibni Al Ass terdiri daripada seorang Pengerusi, seorang Timbalan Pengerusi, seorang Setiausaha, seorang Bendahari dan tujuh orang Ahli Jawatankuasa.                      \r\n\r\nPegawai-pegawai dan kakitangan masjid adalah terdiri daripada:-\r\n\r\nPerlantikan JAWI: Seorang Imam / Ketua Amil dengan jawatan tetap Gred S41, dua orang Imam Ratib dicadang oleh Jawatankuasa Pengurusan & Pentadbiran Masjid dan dimajukan kepada Pentadbiran JAWI untuk kelulusan, seorang Bilal Ratib dicadang oleh Jawatankuasa Pengurusan 7 Pentadbiran Masjid kepada dan dimajukan Pentadbiran JAWI untuk kelulusan.",
    "source_musolla_id": "MY-14-WKL-00026",
    "provision": "Kemudahan-kemudahan yang terdapat di masjid ialah:-\r\n1. Menyediakan bilik kuliah dan kaunseling\r\n2. Bilik VVIP\r\n3. Bilik Jurunikah\r\n4. Bilik mandi jenazah \r\n5. van jenazah \r\n6. dewan makan\r\n7. bilik mesyuarat\r\n8. pejabat imam / bilal\r\n9. pejabat jawatankuasa masjid \r\n10.mesen atm bimb"
  },
  "w28645bcjb": {
    "address": "Sentul Boulevard, Kuala Lumpur, Wilayah Persekutuan, Malaysia 51000",
    "contact": "03-40451149",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.184834,
      "longitude": 101.690739
    },
    "name": "MASJID JAMEK PEKAN SENTUL",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "d72dcd98-86b5-468b-9856-86b7e6c4f138",
    "geohash": "w28645bcjb",
    "remarks": "MASJID  JAMEK SENTUL TELAH DIDIRIKAN PADA 16 JUN  1932 OLEH SEORANG YANG BERKETURUNAN INDIA (EN. ADAM  SAHIB BIN MOHAMAD ALI) YANG BERMAZHAB HANAFI. BELIAU ADALAH SEORANG ALIM DAN HAFIZ QURAN DISAMPING FASIH BERBAHASA URDU. BELIAU JUGA ADALAH MERANGKAP IMAM DAN BILAL MASJID INI. PADA SATU KETIKA BELIAU TELAH MEMBELI SEBIDANG TANAH NO . 10805 LOT NO 74 DARIPADA SEORANG YANG BERBANGSA CINA  DAN TELAH MEWAKAFKAN TANAH TERSEBUT MENGIKUT SEKSEN 84 ATAS NAMA MUSLIM MOSQUE SENTUL/MASJID JAMEK PEKAN SENTUL BAGI MENDIRIKAN MASJID INI. DAN TELAH MENJADI ANTARA MASJID YANG TERTUA DI MALAYSIA",
    "source_musolla_id": "MY-14-WKL-00019",
    "provision": "MASJID INI TERDAPAT KEMUDAHAN SEPERTI KEDAI MAKAN UNTUK PARA JEMAAH, BILIK TAMU DAN TEMPAT PAKIR AWAM"
  },
  "w2861s912b": {
    "address": "Kampung Segambut Luar, Kuala Lumpur, Wilayah Persekutuan, Malaysia 51200",
    "contact": "03-62577362",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.189001,
      "longitude": 101.668893
    },
    "name": "MASJID AL-FIRDAUS",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "1e7ff084-4c00-49df-96fb-df14fc45de68",
    "geohash": "w2861s912b",
    "remarks": "Di peringkat permulaannya, tapak Masjid Al-Firdaus adalah merupakan sebuah tapak madrasah dan pusat pengajian agama yang ditubuhkan di atas inisiatif para penduduk Kampong Segambut luar. Ia adalah bertujuan menjadikan madrasah ini sebagai tempat tumpuan khusus bagi para penduduk dan masyarakat sekitarnya untuk mendirikan solat jemaah serta menjalankan aktiviti keagamaan dan kemasyarakatan.\r\n\r\nMelalui daya usaha pengasas Masjid iaitu Allahyarham Tuan Haji Syed Bin Ibrahim, beliau telah bersetuju untuk mewakafkan dua bidang tanah. Salah satu darinya, diwakafkan untuk dijadikan tanah perkuburan Islam yang baru bagi menggantikan tanah perkuburan sedia ada di Batu 3 Jalan Ipoh yang tidak dapat menampung keperluan masyarakat sekitarnya. Manakala sebidang tanah telah diwakafkan untuk dijadikan tapak asal masjid serta medan letak kereta bagi kemudahan jemaah masjid.",
    "source_musolla_id": "MY-14-WKL-00008",
    "provision": "Kemudahan-kemudahan yang terdapat di masjid ini ialah:-\r\n1. Van jenazah\r\n2. Dewan kuliah\r\n3. Dewan serbaguna\r\n4. Kuaters\r\n5. Pusat Pentadbiran"
  },
  "w28629rv5t": {
    "address": "Kuala Lumpur, Wilayah Persekutuan, Malaysia 50050",
    "contact": "03-62741336",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.21576,
      "longitude": 101.634336
    },
    "name": "MASJID AMANIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "2db98239-b9d3-42b4-b36b-08c8e7886ee2",
    "geohash": "w28629rv5t",
    "remarks": "Masjid ini pada asalnya kecil sahaja dan dibina diantara Jalan Besar Kepong dan Sungai. Bagi memenuhi keperluan umat islam disekitar ini, maka ianya diperbesarkan dan dibina masjid indah ditepi Jalan Kepong ini.",
    "source_musolla_id": "MY-14-WKL-00029",
    "provision": "Antara kemudahan yang terdapat dimasjid ini ialah bilik mesyuarat,  ruang parkir , khidmat pengurusan jenazah danKelas Pengajian Al Quran dan Fardhu Ain.        \n\nPihak masjid juga menyediakan rumah untuk kakitangan pengurusan masjid yang terletak didalam kawasan masjid ini."
  },
  "w286q0pcyd": {
    "address": "Kampung Kuala Pansoon, Hulu Langat, Selangor, Malaysia 43100",
    "contact": "012-6147615",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.20832,
      "longitude": 101.876161
    },
    "name": "MASJID KARIAH KUALA PANGSON",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "827f95c4-db90-40b6-aa38-80d0850626ab",
    "geohash": "w286q0pcyd",
    "remarks": "PEMBINAAN OLEH J.K.R. KAJANG. SEKITAR TAHUN 70-AN UNTUK MENGGANTIKAN MASJID YANG TELAH UZUR YANG DIBINA OLEH KARIAH KG. PANSON SENDIRI.",
    "source_musolla_id": "MY-10-HL-00026",
    "provision": "KEMUDAHAN TERDAPAT DIMASJID INI IALAH:\n1)\tJALAN RAYA\n2)\tBILIK IMAM (DARIPADA ZAKAT)\n3)\tBEKALAN ELEKTRIK\n4)\tBEKALAN AIR (DARIPADA AIR BUKIT)\n5)\t2 BUAH KHEMAH (SUMBANGAN DARIPADA KARIAH KG. PANSON)\n6)\tPEMBESAR SUARA (SUMBANGAN ZAKAT)\n7)\tMIMBAR BARU(DISUMBANGKAN OLEH DUN DUSUN TUA, ISMAIL SANI)"
  },
  "w2863x3xhs": {
    "address": "Batu Caves, Selangor, Malaysia 68100",
    "contact": "03-61367012",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.249057,
      "longitude": 101.669741
    },
    "name": "MASJID AT -TAQWA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "c9636bfd-44f4-4221-b879-650d4b3d3fe9",
    "geohash": "w2863x3xhs",
    "source_musolla_id": "MY-10-GBK-00056",
    "provision": "Antara kemudahan yang terdapat di masjid ini ialah ruang solat yang selesa untuk lelaki dan wanita, tempat wuduk, tempat letak kereta, stor, ruang jamuan, dewan kuliah serta seminar, van jenazah, tempat pengurusan jenazah, Sekolah Agama Rakyat Nurul Iman, tangga khas untuk orang kurang upaya dan bilik imam serta bilal."
  },
  "w28672yqnt": {
    "address": "Taman Melawati, 53100 Melawati, Selangor, Malaysia 53100",
    "contact": "0341075859",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.213189,
      "longitude": 101.753254
    },
    "name": "MASJID AS - SOBIRIN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "08f3f54b-1379-47aa-bd70-03c77e559627",
    "geohash": "w28672yqnt",
    "remarks": "PKNS telah meminjamkan sebuah rumah untuk dijadikan sebuah surau sementara pada mulanya.dan ia digantikan dengan pembinaan masjid yang telah siap dibina pada tahun 1985. Masjid ini telah dirasmikan oleh DYMM Sultan Sharafuddin Idris Shah Ibnu Sultan Salahuddin Abd Aziz Shah, Sultan Selangor pada 6 Mac 1998.",
    "source_musolla_id": "MY-10-GBK-00067",
    "provision": "Antara kemudahan yang terdapat di masjid ini ialah ruang solat yang selesa untuk lelaki dan wanita, tempat wuduk, tempat letak kereta, stor,pejabat, bilik jenazah."
  },
  "w2865ef161": {
    "address": "AU 3, Melawati, Selangor, Malaysia 54200",
    "contact": "0341053515",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.184885,
      "longitude": 101.758214
    },
    "name": "MASJID AL - KHAIRIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "330760ad-2d94-4e7c-92a6-4a913a1d9025",
    "geohash": "w2865ef161",
    "remarks": "Pada asalnya ia merupakan taman permainan dan dibina sebuah surau kecil untuk keperluan masayakat setempat. Selepas itu ia dibesarkan untuk solat jumaat dan dengan sumbangan dari kerajaan serta orang ramai, masjid ini dapat dibina pada tahun 1991.",
    "source_musolla_id": "MY-10-GBK-00072",
    "provision": "Antara kemudahan yang terdapat di masjid ini ialah ruang solat yang selesa untuk lelaki dan wanita, tempat wuduk, tempat letak kereta, stor, sekolah agama, van jenazah dan kuarters pegawai masjid."
  },
  "w28651pf2n": {
    "address": "Taman Keramat, Ampang, Selangor, Malaysia 54200",
    "contact": "03-42653847",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.169976,
      "longitude": 101.744044
    },
    "name": "MASJID AL - ANSAR",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "78ca85d7-3cbb-4f31-ba88-354268f34ace",
    "geohash": "w28651pf2n",
    "remarks": "Masjid ini dibina atas kesepakatan penduduk bagi melakukan ibadat dan solat jumaat. Masjid ini telah dirasmikan oleh DYMM Sultan Selangor pada 25 October 1991.",
    "source_musolla_id": "MY-10-GBK-00053",
    "provision": "Masjid ini mempunyai dewan solat utama untuk lelaki dan perempuan serta dewan solat tambahan di sebelah luarnya Selain itu , terdapat juga bilik imam/bilal , bilik stor , pejabat, tempat wudhuk lelaki dan wanita ,van jenazah dan juga tempat mandi jenazah.\r\n\r\nDi bahagian luar masjid terdapat tempat letak motosikal  dan basikal berbumbung . Ruang letak kereta terbuka yang luas  mampu meletakkan lebih 20 kereta dalam satu-satu masa dalam kawasan masjid sahaja."
  },
  "w2865wj0s4": {
    "address": "Ulu Kelang, Melawati, Selangor, Malaysia 68000",
    "contact": "03 -42516734",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.197121,
      "longitude": 101.762417
    },
    "name": "MASJID AL RIDHUAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "32325770-f421-4ac9-8e9c-68112923e917",
    "geohash": "w2865wj0s4",
    "remarks": "Masjid ini telah siap dibina pada tahun 1984 dan ianya masih lagi belum dirasmikan. Masjid ini sebenarnyan masih mengumpul dana untuk menaiktaraf prasarananya bagi menjadikannya sebagai sebuah masjid berkonsepkan Solat dan Rehat (S&R), iaiitu sebuah masjid yang selesa , moden dan bersih kepada pengunjung-pengunjung masjid .Projek yang akan menelan belanja melebihi RM 750 ribu ini akan dibina dalam beberapa fasa , dimulai dengan Fasa 1 dengan membina sebuah tandas awam baru yang moden dan bersih. Pembinaan tandas sekarang telah 50% siap dan dijangka siap sepenuhnya pada akhir Mei 2011. Fasa-fasa seterusnya merangkumi pembinaan ruang dan tempat seperti Ruang Rehat Umum, Ruang Menunggu dan Tempat Wudhu Muslimat, Pusat Khidmat Masjid, Kiosk Jualan , Foyer, Dewan Serbaguna dll. Dengan terbinanya prasarana di atas akan menjadikan MAR sebuah masjid yang memenuhi ciri pusat wahana transformasi ummah.",
    "source_musolla_id": "MY-10-GBK-00050",
    "provision": "Didalam masjid ini terdapat sebuah sekolah Maahad Tafizh Al-Ridhuan yang mana ianya dapat menempatkan dalam kira-kira 200 orang pelajar. Didalamnya juga terdapat sebuah kantin yang disediakan oleh pihak masjid utuk kegunaan pelajar-pelajar Maahad Tahfiz Al-ridhuan. \r\n\r\nPihak masjid juga menyediakan tempat parkir motor berbumbung dan juga parkir kereta yang boleh menempatkan lebih 20 buah kereta dalam satu masa,menyediakan gerai untuk jualan,wakaf untuk  berehat ,telefon awam dan masjid ini juga terdapat bilik perpustakaan yang boleh digunakan oleh para jemaah dan pelajar-pelajar tahfiz."
  },
  "w286777qq5": {
    "address": "Jalan Taman Melawati, Taman Melawati, 53100 Melawati, Selangor, Malaysia 53100",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.226953,
      "longitude": 101.749116
    },
    "name": "MASJID AL-MARDHIYAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "6ee367dc-fee2-496f-be26-32763bea16f8",
    "geohash": "w286777qq5",
    "remarks": "Masjid ini dibina atas kesepakatan penduduk yang mana Ianya difikirkan perlu adanya sebuah masjid di kawasan perumahan ini,  yang mana masjid ini akan digunakan sebagai tempat ibadah umat-umat islam di sekitarnya.",
    "source_musolla_id": "MY-10-GBK-00381",
    "provision": "Masjid ini mempunyai dewan solat utama untuk lelaki dan perempuan serta dewan solat tambahan di sebelah luarnya. Selain itu , terdapat juga bilik imam/bilal , bilik stor, pejabat,  tempat wuduk lelaki dan wanita .\r\n\r\nDi bahagian luar masjid terdapat beberapa ruang letak kereta serta garaj untuk motosikal dan basikal . Ruang letak kereta terbuka pula mampu meletakkan lebih 10 kereta dalam satu-satu masa dalam kawasan masjid sahaja.\r\n\r\nTerdapat juga tempat untuk mandi  jenazah dan masjid ini juga menyediakan van jenazah."
  },
  "w2866wgmsm": {
    "address": "Gombak, Setapak, Wilayah Persekutuan, Malaysia 53000",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.24606,
      "longitude": 101.716074
    },
    "name": "MASJID SUNGAI CHINCHIN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "0748126b-561f-4ead-8665-9a9cc5ab10b8",
    "geohash": "w2866wgmsm",
    "remarks": "Masjid ini dibina di atas tanah wakaf dan pada asalnya ia merupakan sebuah surau. Pada tahun 1967, binaan nya diubah kepada simen.",
    "source_musolla_id": "MY-10-GBK-00055",
    "provision": "Antara kemudahan yang terdapat di masjid ini ialah ruang solat yang selesa untuk lelaki dan wanita, tempat wuduk, tempat letak kereta, stor, van jenazah,dewan masjid dan terdapat sekolah agama rakyat"
  },
  "w28671kmmw": {
    "address": "Taman Melawati, Melawati, Selangor, Malaysia 53100",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.21581,
      "longitude": 101.739481
    },
    "name": "MASJID KG. KLANG GATE BARU",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "18e2c179-4367-413a-9c0f-baeb9b0be8d0",
    "geohash": "w28671kmmw",
    "source_musolla_id": "MY-10-GBK-00074",
    "provision": "Antara kemudahan yang terdapat ialah ruang parkir dan raung solat yang selesa."
  },
  "w28658xpsb": {
    "address": "Ampang, Selangor, Malaysia 54200",
    "contact": "03-42575061",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.168101,
      "longitude": 101.765196
    },
    "name": "MASJID DARUL EHSAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "34f1708a-44fd-4f58-92a7-04d3b95dde9a",
    "geohash": "w28658xpsb",
    "source_musolla_id": "MY-10-GBK-00051",
    "provision": "Antara kemudahan yang terdapat di masjid ini ialah ruang solat yang selesa untuk lelaki dan wanita, tempat wuduk, tempat letak kereta, stor,kuarter imam dan bilal, van jenazah dan dewan mesyuarat"
  },
  "w2862tpuqe": {
    "address": "Kepong, Selangor, Malaysia 52100",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.236224,
      "longitude": 101.634459
    },
    "name": "MASJID JAMEK FRIM",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "6093a90f-53d3-47ee-91e4-27d294de0002",
    "geohash": "w2862tpuqe",
    "remarks": "Masjid dibina pada tahun 1976 bagi menggantikan surau lama untuk kakitangan FRIM .",
    "source_musolla_id": "MY-10-GBK-00048",
    "provision": "Antara kemudahan yang terdapat di masjid ini ialah ruang solat yang selesa untuk lelaki dan wanita, tempat wuduk, tempat letak kereta, stor, dapur dan pengurusan jenazah."
  },
  "w2866r1dpf": {
    "address": "Batu Caves, Selangor, Malaysia 68100",
    "contact": "03-61855033",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.246818,
      "longitude": 101.702834
    },
    "name": "MASJID AL -KHAIRIYAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "0756b790-a5af-40e5-a0f0-1cf10c0b68b9",
    "geohash": "w2866r1dpf",
    "source_musolla_id": "MY-10-GBK-00059",
    "provision": "Antara kemudahan yang terdapat ialah  ruang parkir, pejabat, dewan dan  ruangan solat yang luas.,"
  },
  "w2866nyhhf": {
    "address": "Batu Caves, Selangor, Malaysia 68100",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.245785,
      "longitude": 101.697904
    },
    "name": "MASJID AL-ITTIFAQIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "6d15a169-0e82-45d1-99fc-34e7eb751a99",
    "geohash": "w2866nyhhf",
    "source_musolla_id": "MY-10-GBK-00364",
    "provision": "Antara kemudahan yang terdapat ialah  ruang parkir yang luas."
  },
  "w28694ndzy": {
    "address": "Persiaran Pegawai, Selayang, 68100 Batu Caves, Selangor, Malaysia 68100",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.263448,
      "longitude": 101.654774
    },
    "name": "MASJID AL - FIRDAUS BANDAR BARU SELAYANG",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "bf90fa7f-31e1-4778-ab46-20e6ccc81482",
    "geohash": "w28694ndzy",
    "source_musolla_id": "MY-10-GBK-00069",
    "provision": "Antara kemudahan yang terdapat ialah ruang solat untuk lelaki dan perempuan,bilik pejabat dan dewan.  \r\n ."
  },
  "w28698m350": {
    "address": "Batu Caves, Selangor, Malaysia 68100",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.253502,
      "longitude": 101.674819
    },
    "name": "MASJID JAMIATUS SOLAHIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "7e815b33-2179-4034-bbb4-b1991665bc17",
    "geohash": "w28698m350",
    "source_musolla_id": "MY-10-GBK-00064",
    "provision": "Antara kemudahan yang terdapat ialah ruang parkir, van jenazah dan urusan jenazah dan  ruangan solat yang luas.,"
  },
  "w2866k2ym6": {
    "address": "Batu Caves, Selangor, Malaysia 68100",
    "contact": "03-61881157",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.232441,
      "longitude": 101.701702
    },
    "name": "MASJID AR -RAHIMAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "2aa288a2-6af0-42f2-9f23-983d901ea4e3",
    "geohash": "w2866k2ym6",
    "source_musolla_id": "MY-10-GBK-00070",
    "provision": "Antara kemudahan yang terdapat ialah  ruang parkir yang luas dan  ruangan solat yang luas.,"
  },
  "w28670rnev": {
    "address": "Taman Wangsa Melawati, Setapak, Wilayah Persekutuan, Malaysia 53300",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.210527,
      "longitude": 101.743175
    },
    "name": "MASJID AL - MUTTAQIN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "63c1deae-8002-420d-9aff-01f353ebcd0d",
    "geohash": "w28670rnev",
    "source_musolla_id": "MY-10-GBK-00063",
    "provision": "Antara kemudahan yang terdapat ialah  ruang parkir dan  ruangan solat yang selesa."
  },
  "w2866zchdt": {
    "address": "Gombak, Setapak, Wilayah Persekutuan, Malaysia 53000",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.251381,
      "longitude": 101.723895
    },
    "name": "MASJID ZAKARIA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "2fa4b156-fff3-499a-86e0-56c542683e86",
    "geohash": "w2866zchdt",
    "remarks": "Pada asalnya,tanah masjid ini merupakan tanah individu yang diwakafkan. Selepas itu,sebuah surau dibangunkan dan akhirnya pada tahun 1975 masjid ini siap dibina bagi menampung keperluan jemaah penduduk kampung",
    "source_musolla_id": "MY-10-GBK-00058",
    "provision": "Antara kemudahan yang terdapat di masjid ini ialah ruang solat yang selesa untuk lelaki dan wanita, tempat wuduk, tempat letak kereta, stor,pejabat,van jenazah dan bilik jenazah."
  },
  "w2860kcnse": {
    "address": "Bandar Sri Damansara, Petaling Jaya, Selangor, Malaysia 52200",
    "contact": "0362723944",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.19129,
      "longitude": 101.61412
    },
    "name": "MASJID AL - MUKARRAMAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "2b28a0ce-51e9-4648-9450-9c2627c1957f",
    "geohash": "w2860kcnse",
    "remarks": "Pembinaan masjid ini dibiayai sepenuhnya oleh Tan Sri Wan Azmi (pemaju Bandar Sri Damansara). Nama asal masjid ini adalah Al-Muhajirin dan kemudiannya telah ditukar nama pada tahun 2000 kepada MASJID AL - MUKARRAMAH. Pembinaan masjid ini adalah inspirasi daripada masjid Sultan Ahmet, Istanbul. Masjid ini telah dirasmikan oleh DYMM Sultan Selangor pada 10/11/2000.",
    "source_musolla_id": "MY-10-PTG-00277",
    "provision": "Antara kemudahan ialah pusat sumber, pejabat, bilik mesyuarat, bilik imam dan bilal, bilik urus jenazah, kemudahan internet,computer dan skrin projector."
  },
  "w286jsjx3u": {
    "address": "Hulu Langat, Selangor, Malaysia 43100",
    "contact": "012-6819517",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.187303,
      "longitude": 101.850898
    },
    "name": "MASJID KARIAH LUBUK KELUBI",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "38d56251-d1a6-48e4-87c5-5611029e8277",
    "geohash": "w286jsjx3u",
    "source_musolla_id": "MY-10-HL-00024",
    "provision": "Antara kemudahan yang terdapat ialah  ruang parkir yang kecil dan ruangan solat."
  },
  "w28640xvgq": {
    "address": "42 Jalan Raja Muda Abdul Aziz, Chow Kit, 50300 Kuala Lumpur, Wilayah Persekutuan, Malaysia 50300",
    "contact": "03-42705240",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.167833,
      "longitude": 101.700243
    },
    "name": "MASJID JAMEK PAKISTAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "6720d062-1d88-4175-a993-d19175d7af06",
    "geohash": "w28640xvgq",
    "source_musolla_id": "MY-14-WKL-00034",
    "provision": "Antara kemudahan yang terdapat ialah  ruang parkir,  ruangan solat yang luas, kantin pakistan dan rumah pegawai masjid."
  },
  "w28646nptc": {
    "address": "Titiwangsa, Kuala Lumpur, Wilayah Persekutuan, Malaysia 53200",
    "contact": "03-40236897",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.176342,
      "longitude": 101.708936
    },
    "name": "MASJID IBNU SINA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "27185c88-8498-4573-af67-faa9263d4b0c",
    "geohash": "w28646nptc",
    "remarks": "Pada tahun 1985, penduduk sekitar Tasik Titiwangsa telah menyuarakan kepada Jabatan Agama Islam Wilayah Persekutuan (JAWI) untuk membina sebuah surau dengan persetujuan Masjid Jameul Ehsan, Setapak.    \n\nAhli Jawatankuasa Bertindak Sementara telah ditubuhkan pada tahun 1985 bagi tujuan menyelaras dan membina sebuah surau di atas tapak sedia ada. Proses untuk membina surau ini telah berlarutan sehingga tahun 1992 di mana dengan kerjasama Ahli Parlimen Titiwangsa masa itu iaitu YB. Drs. Sulaiman Mohamed yang juga Timbalan Menteri Jabatan Perdana Menteri telah mendapat peruntukan Wakil Rakyat sebanyak RM400,000.00 bagi pembinaan sebuah surau atas nama Surau Titiwangsa. Pembinaan Surau Titiwangsa telah dimulakan pada akhir tahun 1998 dan siap sepenuhnya pada tahun 2000. Ianya digunakan sepenuhnya oleh anak kariah pada 20 April 2000. Pentadbiran Surau telah dilantik di kalangan anak-anak kariah tiap-tiap sesi selama 2 tahun sekali. Dengan kerjasama yang erat dari semua anak kariah  bagi mengimarahkan surau, beberapa program dan aktiviti telah diadakan pada setiap masa. Pada 17 Ogos 2006, Mesyuarat Jawatankuasa Perundingan Hukum Syara' Wilayah Persekutuan kali ke-66 telah meluluskan permohonan Jawatankuasa Surau Titiwangsa untuk mendirikan Jumaat dan surau telah dinaik-taraf kepada Surau Jumaat pada 6 Oktober 2006 bersamaan 13 Ramadhan 1427H. Setelah surau dinaik-taraf untuk mendirikan solat Jumaat, Duli YMM Seri Paduka Baginda Yang Dipertuan Agong ke-12, iaitu DYMM Tuanku Syed Sirajuddin Ibni Al-Marhum Tuanku Syed Putra Jamalullail telah berangkat menunaikan solat sunat Jumaat Titiwangsa pada 3 November 2006. Selanjutnya, di Mesyuarat Jawatankuasa Perundingan Hukum Syara' Wilayah Persekutuan kali ke-72 pada 21 September 2008 bersamaan 21 Ramadhan 1429 H bersetuju menaik-taraf Surau Jumaat Titiwangsa kepada masjid sepenuhnya. Sempena kenaikan taraf kepada masjid, pada hari Jumaat 7 November 2008, YBhg. Dato' Sohibus Samahah Mufti Wilayah Persekutuan telah berkenan membaca Khutbah Khas dan lantas menamakan Masjid Titiwangsa kepada Masjid Ibnu Sina. Tuan    Buat masa ini, Masjid Ibnu Sina dapat memuat jemaah lebih kurang 900 orang. Justeru itu, bagi persediaan di mana anak-anak kariah bertambah dari masa ke semasa, maka pihak Ahli Jawatankuasa telah bersetuju untuk mendirikan sebuah bangunan masjid yang baru yang dilengkapi dengan segala kemudahan sebagaimana di dalam pelan bangunan yang telah disediakan oleh Arkitek ICB Sdn Bhd.",
    "source_musolla_id": "MY-14-WKL-00053",
    "provision": "Antara kemudahan yang terdapat ialah  ruang parkir yang kecil dan pejabat pentadbiran masjid.   ."
  },
  "w2863xxm5g": {
    "address": "Jalan Nakhoda Tengah, Kampung Nakhoda, 68100 Batu Caves, Selangor, Malaysia 68100",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.250083,
      "longitude": 101.6776
    },
    "name": "MASJID JAMEK KG. NAKHODA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "77010300-1ea5-4433-bf7a-4bbd228dfab0",
    "geohash": "w2863xxm5g",
    "source_musolla_id": "MY-10-GBK-00047",
    "provision": "Antara kemudahan yang terdapat ialah  ruang parkir, penghawa dingin, van jenazah dan urusan jenazah dan  ruangan solat yang luas.,"
  },
  "w2863jvpe4": {
    "address": "Batu Caves, Selangor, Malaysia 68100",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.240892,
      "longitude": 101.652513
    },
    "name": "MASJID SERI MELATI",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "5b00119e-7faa-44e8-8230-7d2b0118f007",
    "geohash": "w2863jvpe4",
    "source_musolla_id": "MY-10-GBK-00065",
    "provision": "Masjid ini mempunyai dewan solat utama untuk lelaki dan perempuan serta dewan solat tambahan di sebelah luarnya. Selain itu , terdapat juga bilik imam/bilal , bilik stor , pejabat , bilik mesyuarat , dapur ,dewan,van jenazah,mandi jenazah dan  tempat wudhuk lelaki dan wanita .\r\n\r\nDi bahagian luar masjid terdapat beberapa ruang letak kereta khas pegawai masjid berbumbung serta garaj untuk motosikal dan basikal . Ruang letak kereta terbuka pula mampu meletakkan lebih 20 kereta dalam satu-satu masa dalam kawasan masjid sahaja."
  },
  "w28629k7w1": {
    "address": "Kepong, Kuala Lumpur, Wilayah Persekutuan, Malaysia 52100",
    "contact": "03-62753305",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.215481,
      "longitude": 101.629634
    },
    "name": "MASJID AL - FAIZIN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "f1776a15-a917-4b29-bb2d-61e1b006f2e0",
    "geohash": "w28629k7w1",
    "remarks": "Masjid ini dibina apabila terbinanya taman perumahan Taman Desa jaya dan Taman Ehsan pada tahun 1984 diatas sebuah tapak yang dianugerahkan oleh pemaju taman perumahan ini. Ianya telah dirasmikan oleh  DYMM Sultan Salahuddin Abdul aziz Shah pada tahun 1987.                                    \r\n\r\nMasjid ini dibina atas kesepakatan penduduk yang mana Ianya difikirkan perlu adanya sebuah masjid di kawasan perumahan ini.,  yang mana masjid ini akan digunakan sebagai tempat ibadah umat-umat islam di sekitarnya.",
    "source_musolla_id": "MY-10-GBK-00061",
    "provision": "Masjid ini mempunyai dewan solat utama untuk lelaki dan perempuan serta dewan solat tambahan di sebelah luarnya ..\r\n\r\nSelain itu , terdapat juga rumah imam/bilal , bilik stor , pejabat , bilik mesyuarat , dapur , tempat wudhuk lelaki dan wanita ,van jenazah dan tempat memandikan jenazah.\r\n \r\nDari segi keselamatan masjid ini juga terdapat  kamera litar tertutup (CCTV). Terdapat juga taman permainan  dan lapangan riadah untuk kanak-kanak sekitar bermain.\r\n\r\nDi bahagian luar masjid terdapat ruang letak kereta terbuka mampu meletakkan lebih 20 kereta dalam satu-satu masa dalam kawasan masjid sahaja."
  }
}