{
  "w2864bmn23": {
    "address": "Kampung Datuk Keramat, Kuala Lumpur, Wilayah Persekutuan, Malaysia 54000",
    "contact": "03-42570529",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.166516,
      "longitude": 101.729292
    },
    "name": "MASJID AL-AKRAM",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "6ee506ba-13e4-4ed4-b5ed-3aa4c011e486",
    "geohash": "w2864bmn23",
    "remarks": "Masjidul Akram Kampong Dato' Keramat mula dibina lebih kurang tiga bulan selepas peristiwa berdarah 13 Mei 1969. Hampir sebulan lamanya penduduk Kg. Dato' Keramat tidak dapat keluar menunaikan sembahyang Waktu dan sembahyang Jumaat di masjid lama yang terletak di antara Lorong Keramat 16 dan 17 kerana perintah berkurung ekoran daripada peristiwa 13 Mei itu. Setelah siap pembinaanya pada 31 Mei 1971, Masjidul Akram ini dikatakan sebagai masjid tercantik dan termoden di Kuala Lumpur pada masa itu. Pada bulan Ogos 1971, masjid baru itu mula digunakan sebagai tempat ibadah sempena bulan Ramadhan 1391 dengan peralatan-peralatan yang serba kekurangan yang dipindahkan dari masjid lama. Sejak awal tahun 1972 apabila tertubuh Ahli Jawatankuasa yang mula-mula sekali mentadbir Masjidul Akram yang diketuai oleh Encik Mohd Idris bin Ibrahim (sekarang Dato' Haji Idris bin Ibrahim) dan timbalannya Allahyarham Cikgu Haji Mohd Yasin b. Haji Salleh, berbagai usaha telah dibuat untuk mengadakan segala kemudahan bagi keselesaan para jemaah. Kemuncak pembangunan dan kejayaan Masjidul Akram ini bermula dari tahun 1985 apabila usaha-usaha untuk memakmur dan mengimarahkan masjid dipergiatkan lagi dari tahun ke setahun. Kejayaan dan pencapaian cemerlang AJK masjid dari berbagai aspek, diiktiraf oleh Jabatan Agama Islam Wilayah Persekutuan (JAWI) apabila Masjidul Akram ini dipilih sebagai \"Masjid Contoh\" di antara lebih 30 buah masjid di Wilayah Persekutuan sebanyak dua kali iaitu pada tahun 1990 dan 1994 dengan hadiah wang sebanyak RM 7,000.00. Kejayaan dan kemajuan tidak akan dapat dicapai tanpa sokongan dan kerjasama daripada para jemaah dan umat islam keseluruhannya. SOkongan yang berupa wang ringgit, tenaga dan buah fikiran meningkat dari tahun ke setahun. Hal ini menambah lagi semangat dan keazaman AJK yang ada sekarang untuk terus berusaha memakmurkan lagi masjid dalam segala bidang, InsyaAllah. Usaha menulis dan mencatat sejarah ringkas pembangunan Masjid Al-Akram sempena suku abad terdirinya masjid ini dibuat dengan tujuan sebagai mengenang jasa dan perngorbanan 'Orang-Orang Lama' yang kebanyakannya telahpun kembali ke Rahmatullah yang telah bersusah payah dan bertungkus lumus berusaha mendirikan Rumah Allah yang dimuliakan ini. Mudah-mudahan jasa dan pengorbanan mereka itu diterima Allah dan diberi sebaik-baik balasan. Disamping itu diharap buku kecil yang tidak sepertinya ini akan dijadikan bahan rujukan mengingati kembali seharah satu-satunya mercu yanda di Kg.Dato' Keramat ini.",
    "source_musolla_id": "MY-14-WKL-00003",
    "provision": "Kemudahan-kemudahan yang terdapat di masjid ialah:-\n1. Rumah Pangsa empat tingkat bagi menamping perbelanjaan penyelenggaraan masjid tiap-tiap bulan.\n2. Sekolah Rendah Agama Al-Akram\n3. Tanah Perkuburan Islam Dato' Keramat\n4. Taman Rekreasi \n5. Van jenazah",
    "directions": "Berada berhampiran kawasan perumahan Dato' Keramat, Stesen LRT Rapid KL stesen Dato' Keramat."
  }
}