{
  "w2865f3zc3": {
    "address": "Taman Bukit Utama, Melawati, Selangor, Malaysia 68000",
    "contact": "0341057286",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.177761,
      "longitude": 101.768822
    },
    "name": "MASJID BUKIT ANTARA BANGSA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "07fc573e-d674-4a14-a701-dbdf9d516944",
    "geohash": "w2865f3zc3",
    "source_musolla_id": "MY-10-GBK-00380",
    "provision": "Antara kemudahan yang terdapat di masjid ini ialah ruang solat yang selesa untuk lelaki dan wanita, tempat wuduk, tempat letak kereta, stor dan bilik kuliah.",
    "directions": "Lokasi masjid ini terletak di kawasan perumahan dan 50 meter dari pasaraya Giant."
  },
  "w2865ef161": {
    "address": "AU 3, Melawati, Selangor, Malaysia 54200",
    "contact": "0341053515",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.184885,
      "longitude": 101.758214
    },
    "name": "MASJID AL - KHAIRIAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "330760ad-2d94-4e7c-92a6-4a913a1d9025",
    "geohash": "w2865ef161",
    "remarks": "Pada asalnya ia merupakan taman permainan dan dibina sebuah surau kecil untuk keperluan masayakat setempat. Selepas itu ia dibesarkan untuk solat jumaat dan dengan sumbangan dari kerajaan serta orang ramai, masjid ini dapat dibina pada tahun 1991.",
    "source_musolla_id": "MY-10-GBK-00072",
    "provision": "Antara kemudahan yang terdapat di masjid ini ialah ruang solat yang selesa untuk lelaki dan wanita, tempat wuduk, tempat letak kereta, stor, sekolah agama, van jenazah dan kuarters pegawai masjid.",
    "directions": "Masjid ini terletak 3 km dari Bandar Melawati dan pasar Keramat."
  },
  "w28651pf2n": {
    "address": "Taman Keramat, Ampang, Selangor, Malaysia 54200",
    "contact": "03-42653847",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.169976,
      "longitude": 101.744044
    },
    "name": "MASJID AL - ANSAR",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "78ca85d7-3cbb-4f31-ba88-354268f34ace",
    "geohash": "w28651pf2n",
    "remarks": "Masjid ini dibina atas kesepakatan penduduk bagi melakukan ibadat dan solat jumaat. Masjid ini telah dirasmikan oleh DYMM Sultan Selangor pada 25 October 1991.",
    "source_musolla_id": "MY-10-GBK-00053",
    "provision": "Masjid ini mempunyai dewan solat utama untuk lelaki dan perempuan serta dewan solat tambahan di sebelah luarnya Selain itu , terdapat juga bilik imam/bilal , bilik stor , pejabat, tempat wudhuk lelaki dan wanita ,van jenazah dan juga tempat mandi jenazah.\r\n\r\nDi bahagian luar masjid terdapat tempat letak motosikal  dan basikal berbumbung . Ruang letak kereta terbuka yang luas  mampu meletakkan lebih 20 kereta dalam satu-satu masa dalam kawasan masjid sahaja.",
    "directions": "Masjid ini terletak di kawasan perumahan . Dari Bandar melawati mengambil  kira dalam tiga kilometer untuk ke lokasi masjid. Masjid ini  terletak lebih kurang dalam satu kilometer sahaja dari Pasar Keramat."
  },
  "w2865wj0s4": {
    "address": "Ulu Kelang, Melawati, Selangor, Malaysia 68000",
    "contact": "03 -42516734",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.197121,
      "longitude": 101.762417
    },
    "name": "MASJID AL RIDHUAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "32325770-f421-4ac9-8e9c-68112923e917",
    "geohash": "w2865wj0s4",
    "remarks": "Masjid ini telah siap dibina pada tahun 1984 dan ianya masih lagi belum dirasmikan. Masjid ini sebenarnyan masih mengumpul dana untuk menaiktaraf prasarananya bagi menjadikannya sebagai sebuah masjid berkonsepkan Solat dan Rehat (S&R), iaiitu sebuah masjid yang selesa , moden dan bersih kepada pengunjung-pengunjung masjid .Projek yang akan menelan belanja melebihi RM 750 ribu ini akan dibina dalam beberapa fasa , dimulai dengan Fasa 1 dengan membina sebuah tandas awam baru yang moden dan bersih. Pembinaan tandas sekarang telah 50% siap dan dijangka siap sepenuhnya pada akhir Mei 2011. Fasa-fasa seterusnya merangkumi pembinaan ruang dan tempat seperti Ruang Rehat Umum, Ruang Menunggu dan Tempat Wudhu Muslimat, Pusat Khidmat Masjid, Kiosk Jualan , Foyer, Dewan Serbaguna dll. Dengan terbinanya prasarana di atas akan menjadikan MAR sebuah masjid yang memenuhi ciri pusat wahana transformasi ummah.",
    "source_musolla_id": "MY-10-GBK-00050",
    "provision": "Didalam masjid ini terdapat sebuah sekolah Maahad Tafizh Al-Ridhuan yang mana ianya dapat menempatkan dalam kira-kira 200 orang pelajar. Didalamnya juga terdapat sebuah kantin yang disediakan oleh pihak masjid utuk kegunaan pelajar-pelajar Maahad Tahfiz Al-ridhuan. \r\n\r\nPihak masjid juga menyediakan tempat parkir motor berbumbung dan juga parkir kereta yang boleh menempatkan lebih 20 buah kereta dalam satu masa,menyediakan gerai untuk jualan,wakaf untuk  berehat ,telefon awam dan masjid ini juga terdapat bilik perpustakaan yang boleh digunakan oleh para jemaah dan pelajar-pelajar tahfiz.",
    "directions": "Masjid ini terletak di tepi lebuhraya MRR2. Satu kilometer daripada Bandar Ampang dan lebih kurang 500 meter dari Bandar Melawati"
  },
  "w28658xpsb": {
    "address": "Ampang, Selangor, Malaysia 54200",
    "contact": "03-42575061",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 3.168101,
      "longitude": 101.765196
    },
    "name": "MASJID DARUL EHSAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "34f1708a-44fd-4f58-92a7-04d3b95dde9a",
    "geohash": "w28658xpsb",
    "source_musolla_id": "MY-10-GBK-00051",
    "provision": "Antara kemudahan yang terdapat di masjid ini ialah ruang solat yang selesa untuk lelaki dan wanita, tempat wuduk, tempat letak kereta, stor,kuarter imam dan bilal, van jenazah dan dewan mesyuarat",
    "directions": "Masjid ini terletak berhampiran dengan kawasan perumahan dan Kelab Golf Darul Ehsan serta terletak 2 km dari Bandar Ampang."
  }
}