{
  "w2brnbqtne": {
    "address": "Kuala Balah, Kelantan, Malaysia 17700",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.451468,
      "longitude": 101.907407
    },
    "name": "MASJID MUKIM KUALA BALAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "a8b51f70-6f94-45dc-a186-3c3f6b24a820",
    "geohash": "w2brnbqtne",
    "remarks": "Proses perletakan batu asas masjid ini telah disempurnakan oleh Tengku Abdul Rahman Putra Al-Haj iaitu Perdana Menteri pertama Malaysia pada hari jumaat 16 Syaban 1401 hijrah bersamaan 19 jun 1981.Pada masa yang sama Sultan Kelantan iaitu Sultan Ismail Petra ibni almarhum Sultan Yahya Petra pada hari selasa 6 rejab 1403 bersamaan 19 april 1983.",
    "source_musolla_id": "MY-03-JL-00356",
    "provision": "Kemudahan yang terdapat di masjid ini ialah stor yang dijadikan sebagai tempat menyimpan barang.Tandas,tempat  wuduk lelaki dan perempuan juga disediakan di masjid ini.Tempat parking berbumbung turut disediakan di masjid ini hanya untuk motosikal dan kereta.Selain itu,terdapat juga tempat parking terbuka  yang dapat memuatkan 20 buah kenderaan dalam satu masa.",
    "directions": "Masjid ini berada di tepi jalan jeli yang menuju ke Dabong.Kedudukan masjid ini juga berhadapan dengan RnR Kuala Balah.Lokasi masjid ini ialah 20km daripada bandar Jeli."
  },
  "w2brq918uh": {
    "address": "Kuala Balah, Kelantan, Malaysia 17700",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.498812,
      "longitude": 101.889441
    },
    "name": "MASJID MUKIM BUKIT BERANGAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "5b23f243-7e94-4d49-96d5-d3cb85c4cad7",
    "geohash": "w2brq918uh",
    "source_musolla_id": "MY-03-JL-00361",
    "provision": "Kemudahan yang terdapat di masjid ini ialah stor yang dijadikan sebagai tempat menyimpan barang.Tandas,tempat  wuduk lelaki dan perempuan juga disediakan di masjid ini.Tempat parking berbumbung turut disediakan di masjid ini yang hanya untuk motosikal dan kereta.Selain itu,terdapat juga tempat parking terbuka yang dapat memuatkan 10 buah kenderaan dalam satu masa.",
    "directions": "Masjid ini berada di tepi jalan yang menuju ke bandar Jeli.Kedudukan masjid ini ialah 1km dari kawasan air terjun.Lokasi masjid ini ialah 17km dari bandar Jeli."
  },
  "w2brqwcd03": {
    "address": "Kuala Balah, Kelantan, Malaysia 17700",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.530596,
      "longitude": 101.889288
    },
    "name": "MASJID MUKIM KUBUR DATU",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "a291e9f1-8e50-425f-ae91-9ca2e20959ce",
    "geohash": "w2brqwcd03",
    "source_musolla_id": "MY-03-JL-00364",
    "provision": "Kemudahan yang terdapat di masjid ini ialah stor yang dijadikan sebagai tempat menyimpan barang.Tandas,tempat  wuduk lelaki dan perempuan juga disediakan di masjid ini.Tempat parking berbumbung turut disediakan di masjid ini hanya untuk motosikal dan kereta.Selain itu,terdapat juga tempat parking terbuka yang dapat memuatkan 10 buah kenderaan dalam satu masa.",
    "directions": "Masjid ini berada di dalam kawasan kampung.Kedudukan masjid ini ialah berada di tepi sekolah kebangsaan Kubur Datu."
  },
  "w2brwkjs8z": {
    "address": "Kuala Balah, Kelantan, Malaysia 17700",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.559895,
      "longitude": 101.883806
    },
    "name": "MASJID MUKIM LUBUK BONGOR",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "1cf71262-8478-463c-8c87-b4ed08416c1f",
    "geohash": "w2brwkjs8z",
    "remarks": "Sejarah masjid ini bermula apabila kampung lubuk bonggor telah banjir dan pada masa yang sama lokasi masjid asal yang berada di tebing masjid telah berubah kedudukan menjadi semakin hampir dengan sungai disebabkan banjir tersebut.Disebabkan banjir tersebut,penduduk kampung merasa bimbang masjid asal kampung ini akan turut terhakis.Walau bagaimanapun masalah ini telah diketahui oleh pihak atasan jabatan kuala krai.Disebabkan itu,maka kerajaan negeri telah membeli sebidang tanah yang seluas 0.25 ekar untuk dijadikan tapak masjid yang baru.Pada masa yang sama juga penduduk kanpung telah memohon peruntukan untuk membina masjid tersebut melalui Tun Razali Hamzah iaitu ahli parlimen kawasan itu pada masa itu.Pada tahun 1980 Tun Razali Hamzah telah meluluskan peruntukan sebanyak 210 ribu ringgit untuk membina sebuah masjid yang baru.Pada tarikh 26.1.1981 proses pembinaan masjid mula dibina dan proses pembinaan tersebut telah siap sepenuhnya pada tahun 1983.Pada tahun tersebut juga solat jumaat yang pertama bagi masjid itu telah dilakukan kerana penduduk kampung merasa bimbang banjir akan melanda lagi di kampung mereka.Upacara perasmian masjid ini telah dirasmikan oleh Tengku Razali Hamzah sendiri pada 30 julai 1986.Masjid ini juga telah mengalami proses pengubahsuaian pada 15.10.1988 untuk memperbesarkan lagi kawasan majid dan pada masa yang sama juga dua kemudahan telah disiapkan semasa proses pengubahsuaian masjid ini iaitu tandas dan tempat wuduk.Tambahan itu juga,masjid ini juga telah mendapat wang peruntukan sebanyak RM37500 untuk menaiktarafkan pagar besi masjid ini kepada pagar batu.Proses tersebut telah disiapkan sepenuhnya pada 23.10.1994.Pada masa ini masjid ini telah menjadi salah satu masjid mukim di daerah jeli.",
    "source_musolla_id": "MY-03-JL-00514",
    "provision": "Masjid ini menyediakan pejabat bagi menguruskan urusan pentadbiran.Masjid ini turut menyediakan tempat parking berbumbung hanya istimewa untuk ajk masjid sahaja. Di samping itu terdapat tempat parking yang melebihi 10 kenderaan pada satu masa Selain itu.terdapat bilik mensyuarat yang digunakan sebagai tempat perjumpaan ahli AJK masjid.Terdapat juga wakaf yang digunakan untuk berehat yang merupakan salah satu kemudahan yang terdapat di masjid ini.",
    "directions": "Masjid ini berada di dalam kawasan kampung.Lokasi masjid ini ialah 14km dari bandar Jeli."
  }
}