{
  "w2bs1jnvmw": {
    "address": "Galas, Kelantan, Malaysia 18300",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.950278,
      "longitude": 102.006579
    },
    "name": "MASJID MUKIM PASIR TUMBUH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "ca5aca7e-f7d3-4149-aa47-737cc06174dc",
    "geohash": "w2bs1jnvmw",
    "remarks": "Masjid dibina oleh Pejabat Tanah Jajahan Gua Musang dalam anggaran kos pembinaan Rm 30 000.00 pada tahun 1992. Masjid ini dibina untuk kemudahan penduduk Pasir Tumbuh untuk  solat berjemaah. Masjid ini dibina menggantikan madrasah untuk solat jumaat setelah mendapat kelulusan Majlis Agama Kelantan.",
    "source_musolla_id": "MY-03-GM-00046",
    "provision": "Masjid menyediakan peralatan kenduri seperti kawah, pinggan, meja untuk kegunaan penduduk setempat. masjid mempunyai tempat wuduk dan ruang solat bagi lelaki dan perempuan .Masjid ini juga mempunyai tempat parking motor dan kereta berbumbung dan terbuka yang dapat memuatkan 20 buah kereta dalam satu masa."
  },
  "w2bs1cq3fe": {
    "address": "Kampung Renok Baru, Galas, Kelantan, Malaysia 18300",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.929061,
      "longitude": 102.03872
    },
    "name": "MASJID MUKIM SUNGAI ASAP 'B'",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "9388df3b-c28f-4d25-8a5f-f4229458ac92",
    "geohash": "w2bs1cq3fe",
    "remarks": "Masjid ini dibina oleh kesedar pada tahun 1980 untuk kemudahan penduduk sungai Asap ‘B’.Masjid ini didirikan bagi memudahkan penduduk untuk mendirikan solat jumaat.Masjid ini menjadi tumpuan bagi pengguna lebuhraya Gua Musang yang menuju Kuala Krai Kerana ia berdekatan dengan lebuhraya.",
    "source_musolla_id": "MY-03-GM-00018",
    "provision": "Masjid ini mempunyai ruang parking yang agak luas dan tempat wuduk dan tandas untuk kegunaan awam.Masjid ini juga menjalankan kelas fardu agama pada waktu malam."
  }
}