{
  "w2cq6gngbk": {
    "address": "Kuala Terengganu, Terengganu, Malaysia 20100",
    "contact": "09-6231771",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.334531,
      "longitude": 103.137943
    },
    "name": "MASJID ABIDIN (KERAJAAN)",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "bb20aeae-9f98-4271-a141-3fd071bbd8d7",
    "geohash": "w2cq6gngbk",
    "remarks": "Sebagai sebuah negeri Islam, maka masjid adalah suatu simbol agama yang dipandang mulia dan suci, selain daripada menjadikan tempat untuk beramal ibadat. Negeri Terengganu Darul Iman berasa bangga dengan adanya sebuah masjid bersejarah yang sekarang dikenali dengan nama Masjid Abidin yang tersergam dan terletak di tengah-tengah bandar Kuala Terengganu. Dahulunya masjid ini dikenali dengan nama Masjid Besar atau Masjid Puteh.\r\n\r\nBangunan masjid ini pada asalnya merupakan sebuah istana kayu yang didirikan oleh Al-Marhum Sultan Zainal Abidin II (Marhum Masjid 1793-1808) kemudian dalam tahun 1269H/1852M, Almarhum Baginda (Sultan Umar) telah mendirikan bangunan baru daripada batu. Bangunan masjid ini telah diperbesarkan semasa pemerintahan Almarhum Sultan Zainal Abidin III, kira-kira dalam tahun 1319H (1901M).\r\n\r\nMenurut cerita, masjid ini pada mulanya didirikan tanpa tiang di tengah-tengah bahagian dalam bangunan. Dindingnya hanya sekerat dan melengkung berlubang-lubang bagaikan pintu gerbang. Terdapat sebuah binaan kayu yang beratapkan kayu berlian. Terdapat juga enam buah kolah pada masa itu dan setiap satunya berukuran kira-kira dua depa panjang dan 1.5 depa lebar.\r\n\r\nSemasa pemerintahan Almarhum Sultan Zainal Abidin III, barulah binaan itu dibaiki dan diperbesar seperti mana yang ada sekarang (sebelum tambahan baru) dengan ditambah tiang-tiang di ruang tengah bahagian dalam, dinding tembok simen, diadakan sutuh dan tiga buah menara. Pembinaannya pada masa itu dikelolakan oleh Tengku Muda Kemaman (Tengku Panglima Besar), dan tukangnya pula terdiri daripada orang-orang Melayu dan juga Cina. Tulisan-tulisan kasar yang terdapat di pintu masuk utama telah ditulis oleh Tengku Abdul Kadir bin Salim, manakala lukisan-lukisan kecil pula dilukis oleh Tuan Haji Abdul Rahman.\r\n\r\nMimbar yang ada sekarang dibuat oleh Encik Badul Kadir. Semasa pemerintahan Duli Yang Maha Mulia Almarhum Sultan Ismail Nasiruddin Shah, perubahan besar telah dibuat dengan tambahan baru yang hampir sekali ganda luasnya dari bangunan asal dan penambahan alat-alat baru. Selain daripada tempat untuk beribadat, masjid ini juga digunakan untuk pelbagai aktiviti-aktiviti keagamaan.",
    "source_musolla_id": "MY-11-KTR-00001"
  }
}