{
  "w308v8emzt": {
    "address": "Pangkal Meleret, Kelantan, Malaysia 18500",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.760598,
      "longitude": 102.199615
    },
    "name": "MASJID MUKIM SMK WATANIAH (A)",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "909702f1-2f75-4777-8af1-4876e2428b79",
    "geohash": "w308v8emzt",
    "remarks": "Masjid ini dibina didalam kawasan sekolah Sekolah Menengah Kebangsaan Agama Wataniah. Majlis perletakan batu asas masjid ini telah dilangsungkan pada tahun 1997 dan seterusnya pembinaan masjid telah bermula dan siap pada tahun 2000. Anggaran kos pembinaan masjid ini ialah RM1juta. Imam pertama masjid ini ialah Ustaz Baderudin iaitu salah seorang tenaga pengajar di sekolah ini.",
    "source_musolla_id": "MY-03-MCG-00267",
    "provision": "Kemudahan yang terdapat di masjid ini ialah stor sebagai tempat menyimpan barang dan pejabat sebagai tempat pengurusan masjid. Tandas,tempat wuduk lelaki dan perempuan juga disediakan di masjid ini. Parking terbuka juga turut disediakan di masjid ini yang mampu memuatkan lebih daripada 5 buah kenderaan.Tempat meletakkan kenderaan berbumbung turut disediakan di masjid ini.",
    "directions": "Masjid ini berada di dalam kawasan sekolah. Kedudukan masjid ini ialah berada di tepi jalan alternative Machang ke Tanah Merah. Lokasi masjid ini ialah 2km dari bandar Machang"
  },
  "w308vw03js": {
    "address": "18500 Pangkal Meleret, Kelantan, Malaysia 18500",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.78999,
      "longitude": 102.195409
    },
    "name": "MASJID MUKIM LIMAU HANTU",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "bb78901a-5a6f-4c73-aa7e-af3f080f8e7c",
    "geohash": "w308vw03js",
    "remarks": "Terdapat masjid baru yang masih lagi dalam proses pembinaan yang dibina bersebelahan dengan masjid mukim limau hantu. Masjid ini masih lagi mengumpul dana umtuk menyiapkan proses pembinaan masjid ini.",
    "source_musolla_id": "MY-03-MCG-00193",
    "provision": "Kemudahan yang terdapat di masjid ini ialah stor sebagai tempat menyimpan barang.Tandas,tempat wudu lelaki dan perempuan juga disediakan di masjid ini. parking terbuka juga turut disediakan di masjid ini yang mampu memuatkan lebih daripada 5 buah kenderaan pada satu masa sama. Tempat meletakkan kenderaan berbumbung turut disediakan di masjid ini.Kemudahan lain yang terdapat di masjid ini ialah memandikan jenazah.",
    "directions": "Masjid ini berada di dalam kawasan kampung.Kedudukan masjid ini ialah 2km dari Sekolah Kebangsaan Pangkal Meleret.Lokasi masjid ini ialah 10km daripada bandar Machang."
  },
  "w308v0ykdu": {
    "address": "Taman Machang Indah, Pangkal Meleret, Kelantan, Malaysia 18500",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.76175,
      "longitude": 102.181561
    },
    "name": "MASJID MUKIM PANGKAL  MELERET",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "c94fa3ba-18b1-46c4-b8cf-41617e26e649",
    "geohash": "w308v0ykdu",
    "source_musolla_id": "MY-03-MCG-00194",
    "provision": "Kemudahan yang terdapat di masjid ini ialah stor yang dijadikan sebagai tempat menyimpan barang.Tandas,tempat  wuduk lelaki dan perempuan juga disediakan di masjid ini.Tempat parking berbumbung turut disediakan di masjid ini hanya untuk motosikal dan kereta.Selain itu,terdapat juga tempat parking terbuka  yang dapat memuatkan 5 buah kenderaan dalam satu masa.",
    "directions": "Masjid ini berada di dalam kawasan kampung.Lokasi masjid ini ialah 5km daripada bandar Machang."
  },
  "w308vcpvex": {
    "address": "Hulu Sat, Kelantan, Malaysia 18500",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.763314,
      "longitude": 102.216614
    },
    "name": "MASJID SULTAN YAHYA PETRA BANDAR MACHANG",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "e538a5c8-f992-4c30-9f61-a1c6c9c0d8a3",
    "geohash": "w308vcpvex",
    "remarks": "Masjid ini juga dikenali sebagai masjid Sultan Yahya Petra telah dibina pada tahun 1968.Kerja pembinaannya mengambil masa setahun untuk disiapkan.Perletakan batu asas masjid ini telah disempurnakan oleh YAB Tun Abdul Razak bin Husein iaitu Timbalan Perdana Menteri  Malaysia dan pada masa yang sama merangkap Menteri Pembangunan dan Luar Bandar pada hari ahad 26 Zulkaedah 1387 bersamaan 25/2/1968. Perasmian masjid ini juga telah disempurnakan oleh DYMM Sultan Yahya Petra ibni al-marhum Sultan Ibrahim iaitu sultan Kelantan pada hari khamis 22 Muharram 1389 bersamaan 10.4.1969",
    "source_musolla_id": "MY-03-MCG-00004",
    "provision": "Masjid ini menyediakan pejabat bagi menguruskan urusan pentadbiran. Selain itu terdapat bilik mesyuarat yang digunakan sebagai tempat perjumpaan ahli AJK masjid. Bilik imam dan bilal turut disediakan sebagai tempat berehat imam dan bilal. Disamping itu,terdapat dewan terbuka yang dijadikan tempat mengadakan aktiviti kemasyaratan dan tempat berbuka puasa semasa bulan ramadhan. \r\nRumah bilal dan siak juga disediakan bagi salah satu kemudahan kepada mereka. Terdapat juga rumah imam muda dan tua. Masjid ini turut menyediakan tempat parking berbumbung hanya istimewa untuk AJK masjid sahaja. Di samping itu terdapat tempat parking yang melebihi 20 kenderaan pada satu masa Terdapat juga pengawal keselamatan di masjid ini.Selain itu,terdapat juga dua dewan utama yang digunakan untuk solat.",
    "directions": "Masjid ini berada di dalam bandar Machang.Kedudukan masjid ini ialah terletak di kawasan strategik iaitu di pusat bandar Machang. Masjid ini juga berada di persimpangan jalan antara Kuala Krai-Pasir Putih, Tanah Merah dan Kota Bharu."
  }
}