{
  "w308k56nxf": {
    "address": "Temangan, Kelantan, Malaysia 18500",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.687925,
      "longitude": 102.131996
    },
    "name": "MASJID MUKIM KUALA KERAK",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "93153edb-49a8-4c36-a1e4-9e22d0eeccc6",
    "geohash": "w308k56nxf",
    "remarks": "Sejarah masjid ini bermula apabila emak saudara Tok Penggawa daerah ini telah mewakafkan tanah seluas satu ekar untuk dibina sebuah masjid. Masjid ini telah dirasmikan oleh YB Tengku Razaleigh Hamzah pada 6 Mac 1978.   Masjid ini telah diubahsuai untuk menampung keperluan penduduk disini dan sehingga kini ianya masih belum siap sepenuhnya. Pihak pengurusan masjid sedang berusaha  mengumpul dana untuk tujuan pengubahsuaian tersebut dan berkemungkinan besar ianya akan siap pada pertengahan tahun 2012.",
    "source_musolla_id": "MY-03-MCG-00192",
    "provision": "Kemudahan yang terdapat di masjid ini ialah stor yang dijadikan sebagai tempat menyimpan barang.Tandas,tempat  wuduk lelaki dan perempuan juga disediakan di masjid ini.Tempat parking berbumbung turut disediakan di masjid ini hanya untuk motosikal dan kereta.Selain itu,terdapat juga tempat parking terbuka  yang dapat memuatkan 5 buah kenderaan dalam satu masa. Kemudahan yang unik di masjid ini ialah `beduk’.Terdapat van jenazah yang menjadi salah satu kemudahan masjid ini."
  },
  "w308kt8p4h": {
    "address": "Temangan, Kelantan, Malaysia 18500",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.700384,
      "longitude": 102.150965
    },
    "name": "MASJID MUKIM TEMANGAN LAMA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "a848a6c8-9851-4e23-b38d-6544ec5f7e45",
    "geohash": "w308kt8p4h",
    "remarks": "Sejarahnya bermula apabila Hassan Mahmud iaitu pengasas masjid ini telah mewakafkan tanah yang seluas 0.5ekar untuk dibina sebuah masjid. Pada peringkat awalnya telah dibina sebuah surau untiuk kegunaan masyarakat tempatan untuk beribadah. Pada tahun 1992, sebuah masjid baru telah siap dibina bagi menggantikan surau tersebut. Upacara perasmiannya telah disempurnakan oleh  DYMM Sultan Ismail Petra Ibni almarhum Yahya petra pada 7 September 1992.",
    "source_musolla_id": "MY-03-MCG-00202",
    "provision": "Kemudahan yang terdapat di masjid ini ialah stor yang dijadikan sebagai tempat menyimpan barang.Tandas,tempat  wuduk lelaki dan perempuan juga disediakan di masjid ini.Tempat parking berbumbung turut disediakan di masjid ini hanya untuk motosikal dan kereta.Selain itu,terdapat juga tempat parking terbuka  yang dapat memuatkan 5 buah kenderaan dalam satu masa."
  }
}