{
  "w309qmsrhj": {
    "address": "Pulai Chondong, Kelantan, Malaysia 16600",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.876168,
      "longitude": 102.233794
    },
    "name": "MASJID MUKIM KAMPUNG GALANG",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "e31d85bc-8a6e-4a52-ac42-25376b14b35c",
    "geohash": "w309qmsrhj",
    "remarks": "Tapak tanah masjid ini yang seluas 1 ekar telah diwakafkan Haji Ghazali iaitu pengasas pondok dan merupakan ulamak termuka di Kelantan.Beliau juga merupakan ahli majlis syura di Kelantan. Masjid ini telah dirasmikan oleh DYMM  Sultan Ismail Petra ibni almarhum sultan Yahya Petra pada   24.10.1989.  Ianya telah diubahsuai dan diperbesarkan pada tahun 2004.",
    "source_musolla_id": "MY-03-MCG-00197",
    "provision": "Masjid ini menyediakan pejabat bagi menguruskan urusan pentadbiran. Selain itu, terdapat bilik mensyuarat yang digunakan sebagai tempat perjumpaan ahli AJK masjid. Bilik imam turut disediakan sebagai tempat berehat imam dan bilal. \nVan jenazah turut disediakan tatkala ada kematian. Masjid ini turut menyediakan tempat parking berbumbung hanya istimewa untuk AJK masjid sahaja. Di samping itu terdapat tempat parking yang melebihi 20 kenderaan pada satu masa Terdapat juga perpustakaan di masjid ini bagi membolehkan para jemaah menghabiskan masa mereka dengan membaca di masjid ini.Salah satu kemudahan yang menarik di masjid ini ialah projektor yang digunakan semasa aktiviti ceramah agama di masjid ini."
  },
  "w309q6f4fh": {
    "address": "Pulai Chondong, Kelantan, Malaysia 16600",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.86033,
      "longitude": 102.230626
    },
    "name": "MASJID MUKIM PAUH LIMA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "909f6ab6-3aef-4d3e-8526-ecd0fe61d2ef",
    "geohash": "w309q6f4fh",
    "remarks": "Masjid ini  dibina pada tahun 60an dengan bahan binaannya adalah menggunakan kayu sepenuhnya. Masjid ini telah diubahsuai  pada tahun 70an dan pada 20 -9-1971 masjid ini telah dirasmikan oleh YB Tun Abdul Ghafar bin Baba yang pda masa itu memegang jawatan sebagai Menteri Pembangunan Negara dan Luar Bandar.",
    "source_musolla_id": "MY-03-MCG-00174",
    "provision": "Tandas,tempat wuduk lelaki dan perempuan juga disediakan di masjid bagi menjamin kelesaan para jemaah.Stor sebagai tempat penyimpanan barang juga merupakan salah satu kemudahan masjid ini.Selain itu,bagi jemaah yang membawa kenderaan,tempat parking berbumbung juga disediakan  oleh pihak masjid ."
  },
  "w309q38s80": {
    "address": "Labok, Kelantan, Malaysia 18500",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.853742,
      "longitude": 102.22847
    },
    "name": "MASJID MUKIM PANGGUNG",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "922068d2-b13a-4145-a059-cf2340521113",
    "geohash": "w309q38s80",
    "remarks": "Dana bagi masjid ini ialah daripada kerajaan pusat sebanyak RM100,000.Pada asalnya masjid ini merupakan sebuah surau kayu.",
    "source_musolla_id": "MY-03-PP-00447",
    "provision": "Kemudahan yang terdapat di masjid ini ialah stor yang dijadikan sebagai tempat menyimpan barang.Tandas,tempat  wuduk lelaki dan perempuan juga disediakan di masjid ini.Tempat parking berbumbung turut disediakan di masjid ini hanya untuk motosikal dan kereta.Selain itu,terdapat juga tempat parking terbuka  yang dapat memuatkan 10 buah kenderaan dalam satu masa."
  },
  "w309qh7g7u": {
    "address": "Pulai Chondong, Kelantan, Malaysia 16600",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.868652,
      "longitude": 102.222118
    },
    "name": "MASJID MUKIM TOK PULAI CHONDONG",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "ffc523da-4c7b-44da-b73b-c1734d7d443b",
    "geohash": "w309qh7g7u",
    "remarks": "Tuan Guru Haji Abdul Samad bin Haji Abdullah bin Haji Hashim dilahirkan pada tahun 1207 Hijri bersamaan 1792 Masihi, yang dikenali dengan panggilan Tok Pulai Chondong ialah orang yang bertanggungjawab membuka Kampung Bilal Talib dan membina Masjid Pulai Chondong. Menurut sejarahnya, ketika membuka kampung tersebut terdapat sebuah pokok pulai yang besar dan condong di pinggir kampung itu. Dari situ, perkampungan, masjid dan Haji Abdul Samad diberi gelaran Tok Pulai Chondong sempena dengan pokok ini. \n\nMasjid tersebut dikatakan pernah terbakar dua kali pada 1820 dan 1856 sebelum Tok Pulai Chondong mengambil keputusan berpindah ke Kampung Surau tidak jauh dari penempatan awalnya itu. Pada tahun 1856 Masihi pula, dengan kerjasama penduduk beliau telah berusaha mendirikan sebuah masjid baru yang terletak di tepi Sungai Pulai Chondong dan kekal hingga kini, \nyang juga dikenali sebagai Masjid Tok Pulai Chondong yang kemudiannya dilengkapi dengan mimbar, geduk dan menara kayu.\n\nMenara kayu yang masih kukuh dan kini menjadi tempat letak pembesar suara. Binaan masjid yang ada bukanlah binaan asal kerana ia sudah dirombak dan pengubahsuaian telah dilakukan beberapa kali. Para pengunjung dan peminat sejarah masih boleh melihat geduk dan mimbar lama yang masih disimpan di dalam masjid.\n\nMenurut sejarahnya, Tuan Guru Abdul Samad dikatakan mencari dan memilih sendiri kayu balak dari kawasan hutan Bukit Cina kira-kira 10 kilometer dari lokasi masjid untuk membina menara kayu dan kayu itu ditarik menggunakan tali dari hutan secara bergotong-royong bersama penduduk kampung.\n\nMenara itu dibina menggunakan sebatang tiang tanpa sebarang sambungan daripada umbi yang ditanam 8.3 meter dalam tanah hinggalah ke puncak menara. Menurut perkiraan masyarakat tempatan, panjang tiang kayu cengal batu yang digunakan untuk pembinaan menara ini adalah 25.6 meter dan ia diangkat secara bergotong-royong oleh penduduk kampung sewaktu membina dan menegakkan menara masjid berkenaan pada masa itu",
    "source_musolla_id": "MY-03-MCG-00172",
    "provision": "Kemudahan yang terdapat di masjid ini ialah stor yang dijadikan sebagai tempat menyimpan barang.Tandas,tempat  wuduk lelaki dan perempuan juga disediakan di masjid ini.Tempat parking berbumbung turut disediakan di masjid ini hanya untuk motosikal dan kereta.Selain itu,terdapat juga tempat parking terbuka  yang dapat memuatkan 10 buah kenderaan dalam satu masa"
  },
  "w309qw3cxc": {
    "address": "Taman Gading Galoh, Pulai Chondong, Kelantan, Malaysia 18500",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.879325,
      "longitude": 102.241511
    },
    "name": "MASJID MUKIM MAAHAD TAHFIZ PULAI CHONDONG",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "90900935-2034-4d93-bd1b-565c4d41ecda",
    "geohash": "w309qw3cxc",
    "source_musolla_id": "MY-03-MCG-00623",
    "provision": "Kemudahan yang terdapat di masjid ini ialah stor yang dijadikan sebagai tempat menyimpan barang.Tandas,tempat  wuduk lelaki dan perempuan juga disediakan di masjid ini..Terdapat juga dapur yang digunakan sebagai tempat memasak bagi sebarang majlis.Tempat parking berbumbung turut disediakan di masjid ini hanya untuk motosikal dan kereta.Selain itu,terdapat juga tempat parking terbuka  yang berada di luar kawasn masjid"
  }
}