{
  "w309kfuv9n": {
    "address": "Kusial, Kelantan, Malaysia 17500",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.860813,
      "longitude": 102.168442
    },
    "name": "MASJID MUKIM KUBANG TEMESU",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "289b41c2-2119-44f2-8217-f0d28c8f73de",
    "geohash": "w309kfuv9n",
    "source_musolla_id": "MY-03-PM-00108",
    "provision": "Kemudahan yang terdapat di masjid ini ialah stor yang dijadikan sebagai tempat menyimpan barang.Tandas,tempat  wuduk lelaki dan perempuan juga disediakan di masjid ini.Tempat parking berbumbung turut disediakan di masjid ini hanya untuk motosikal dan kereta.Selain itu,terdapat juga tempat parking terbuka  yang dapat memuatkan 15 buah kenderaan dalam satu masa."
  },
  "w309kb2429": {
    "address": "Kusial, Kelantan, Malaysia 17500",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.846495,
      "longitude": 102.161896
    },
    "name": "MASJID MUKIM BELIMBING PASIR GENDAL",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "bf3db7bf-b60c-4cc7-afc5-40e8197b05e9",
    "geohash": "w309kb2429",
    "remarks": "Masjid mukim Belimbing Pasir Gendal ini masih lagi dalam proses pengubahsuaian terutamanya pada bahagian depan masjid dan juga ruang solat utama masjid ini.Proses pengubahsuaian ini dijangka akan disiapkan pada pertengahan tahun 2012 ini.Dana bagi pengubahsuaian ini dikumpul daripada sumbangan ikhlas orang ramai.",
    "source_musolla_id": "MY-03-TM-00293",
    "provision": "Masjid ini mempunyai pelbagai kemudahan seperti stor sebagai tempat menyimpan barang juga merupakan salah satu daripada kemudahan masjid ini. Tempat wuduk,tandas lelaki dan perempuan turut disediakan. Tempat meletakkan kenderaan terbuka melebihi 10 buah kenderaan pada satu masa juga merupakan salah satu kemudahan masjid ini"
  },
  "w309kxkmje": {
    "address": "Kusial, Kelantan, Malaysia 17500",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.885427,
      "longitude": 102.156957
    },
    "name": "MASJID MUKIM BUKIT PANAU",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "0ec07c85-fa25-47ed-9f90-4fe89b853d13",
    "geohash": "w309kxkmje",
    "remarks": "1979          Tengku Razali Hamzah 1982  Sejarah masjid ini bermula apabila arwah Tuan Haji Nor bin Haji Hassan telah mewakafkan tanah untuk dijadikan tapak masjid.Pengasas masjid ini ialah Tuan Haji Mohd Ibrahim. Masjid ini dibina pada tahun 1979 yang menelan belanja permulaan bernilai lebih kurang 250 ribu ringgit hasil daripada kutipan orang ramai.Dalam masa beberapa tahun masjid ini telah siap dibina sepenuhnya dan telah dirasmikan oleh YM Tengku Razali Hamzah iaitu Menteri Kewangan Malaysia pada 21 April 1982.",
    "source_musolla_id": "MY-03-TM-00294",
    "provision": "Masjid ini terdapat pelbagai kemudahan dan salah satunya ialah dapur yang digunakan sebagai tempat memasak bagi sebarang majlis.Stor sebagai tempat penyimpanan barang juga disediakan di masjid ini.Memandikan jenazah juga merupakan salah satu kemudahan masjid ini.Terdapat juga dewan yang digunakan untuk kelas fardhu ain.Selain itu,tempat parking berbumbung juga disediakan khususnya untuk motosikal.Terdapat juga tempat parking terbuka yang mampu menampung lebih daripada 10 buah kenderaan dalam satu masa."
  },
  "w309kgh3s5": {
    "address": "Kusial, Kelantan, Malaysia 17500",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.861485,
      "longitude": 102.167884
    },
    "name": "MASJID MUKIM KAMPUNG SALAK",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "57d86cbb-b315-4c51-b417-eff20d0a0444",
    "geohash": "w309kgh3s5",
    "source_musolla_id": "MY-03-TM-00762",
    "provision": "Masjid ini mempunyai kemudahan asas bagi kegunaan para jemaah. Terdapat stor yang agak besar yang berfungsi sebagai tempat penyimpanan dan peralatan masjid. Bagi jemaah yang membawa kenderaan, kemudahan tempat meletak kenderaan berbumbung ada disediakan selain tempat melatak kenderaan terbuka yang dapat memuatkan lebih daripada 15 buah kenderaan pada satu-satu masa."
  }
}