{
  "w309qh7g7u": {
    "address": "Pulai Chondong, Kelantan, Malaysia 16600",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.868652,
      "longitude": 102.222118
    },
    "name": "MASJID MUKIM TOK PULAI CHONDONG",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "ffc523da-4c7b-44da-b73b-c1734d7d443b",
    "geohash": "w309qh7g7u",
    "remarks": "Tuan Guru Haji Abdul Samad bin Haji Abdullah bin Haji Hashim dilahirkan pada tahun 1207 Hijri bersamaan 1792 Masihi, yang dikenali dengan panggilan Tok Pulai Chondong ialah orang yang bertanggungjawab membuka Kampung Bilal Talib dan membina Masjid Pulai Chondong. Menurut sejarahnya, ketika membuka kampung tersebut terdapat sebuah pokok pulai yang besar dan condong di pinggir kampung itu. Dari situ, perkampungan, masjid dan Haji Abdul Samad diberi gelaran Tok Pulai Chondong sempena dengan pokok ini. \n\nMasjid tersebut dikatakan pernah terbakar dua kali pada 1820 dan 1856 sebelum Tok Pulai Chondong mengambil keputusan berpindah ke Kampung Surau tidak jauh dari penempatan awalnya itu. Pada tahun 1856 Masihi pula, dengan kerjasama penduduk beliau telah berusaha mendirikan sebuah masjid baru yang terletak di tepi Sungai Pulai Chondong dan kekal hingga kini, \nyang juga dikenali sebagai Masjid Tok Pulai Chondong yang kemudiannya dilengkapi dengan mimbar, geduk dan menara kayu.\n\nMenara kayu yang masih kukuh dan kini menjadi tempat letak pembesar suara. Binaan masjid yang ada bukanlah binaan asal kerana ia sudah dirombak dan pengubahsuaian telah dilakukan beberapa kali. Para pengunjung dan peminat sejarah masih boleh melihat geduk dan mimbar lama yang masih disimpan di dalam masjid.\n\nMenurut sejarahnya, Tuan Guru Abdul Samad dikatakan mencari dan memilih sendiri kayu balak dari kawasan hutan Bukit Cina kira-kira 10 kilometer dari lokasi masjid untuk membina menara kayu dan kayu itu ditarik menggunakan tali dari hutan secara bergotong-royong bersama penduduk kampung.\n\nMenara itu dibina menggunakan sebatang tiang tanpa sebarang sambungan daripada umbi yang ditanam 8.3 meter dalam tanah hinggalah ke puncak menara. Menurut perkiraan masyarakat tempatan, panjang tiang kayu cengal batu yang digunakan untuk pembinaan menara ini adalah 25.6 meter dan ia diangkat secara bergotong-royong oleh penduduk kampung sewaktu membina dan menegakkan menara masjid berkenaan pada masa itu",
    "source_musolla_id": "MY-03-MCG-00172",
    "provision": "Kemudahan yang terdapat di masjid ini ialah stor yang dijadikan sebagai tempat menyimpan barang.Tandas,tempat  wuduk lelaki dan perempuan juga disediakan di masjid ini.Tempat parking berbumbung turut disediakan di masjid ini hanya untuk motosikal dan kereta.Selain itu,terdapat juga tempat parking terbuka  yang dapat memuatkan 10 buah kenderaan dalam satu masa"
  }
}