{
  "w30dkkuktj": {
    "address": "Kampung Banggol Kemian, Pasir Mas, Kelantan, Malaysia 17000",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 6.047405,
      "longitude": 102.145949
    },
    "name": "MASJID MUKIM KUBANG GATAL",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "e5c41d6e-deeb-4e41-9f18-8a5fdce0933b",
    "geohash": "w30dkkuktj",
    "remarks": "Tanah tapak masjid ini merupakan tanah wakaf daripada penduduk kampung.Dana bagi kos pembinaan masjid ini ialah berjumlah sebanyak 280ribu ringgit yang diperolehi daripada sumbangan kerajaan persekutuan pada tahun 2006.Masjid ini telah dirasmikan oleh Dato’ Seri Najib bin Tun Abdul Razak iaitu timbalan perdana pada masa itu pada 1.2.2006.",
    "source_musolla_id": "MY-03-PM-00127",
    "provision": "Kemudahan yang terdapat di masjid ini ialah stor yang dijadikan sebagai tempat menyimpan barang.Tandas,tempat  wuduk lelaki dan perempuan juga disediakan di masjid ini.Tempat parking berbumbung turut disediakan di masjid ini hanya untuk motosikal dan kereta.Selain itu,terdapat juga tempat parking terbuka  yang dapat memuatkan 10 buah kenderaan dalam satu masa.Masjid ini juga menyediakan pejabat bagi menguruskan urusan pentadbiran.Van jenazah turut disediakan tatkala ada kematian.\n\n\n\n\n."
  },
  "w30dkkcrht": {
    "address": "Kampung Banggol Kemian, Pasir Mas, Kelantan, Malaysia 17000",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 6.047829,
      "longitude": 102.141813
    },
    "name": "MASJID SULTAN MUHAMMAD III",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "57c150e9-c649-4e84-9e5d-e0d4fafa7aaf",
    "geohash": "w30dkkcrht",
    "remarks": "Masjid Bandar Pasir Mas adalah masjid kepala jajahan yang terletak di jajahan Pasir Mas. Masjid ini telah di bina pada tahun 1937 masehi dengan insiatif dan prihatin penduduk setempat tentang pentingnya diwujudkan sebuah masjid bagi kegunaan umat Islam di kawasan sekitar khususnya dan untuk umat Islam yang bermusafir yang bermusafir yang ingin berhenti rehat dan menunaikan kewajipan kepada Allah amnya .Walau bagaimanapun pembinaannya terhenti akibat tercetusnya perang dunia kedua .Selepas tamatnya perang dunia kedua pembinaan masjid ini diteruskan dengan usahagotong-royong masyarakat setempat .Akhirnya masjid ini siap di bina dan digunakan dalam tahun 1952 dengan kos lebih kurang RM 31 ribu.\n \nMasjid Bandar Pasir Mas telah mengalami beberapa kali pertambahan dan pengubahsuaian dan yang terakhirnya pada tahun 1984.Masjid Bandar Pasir Mas kini berada di bawah pengawasan dari sudut pentadbiran dan pengurusannya oleh Majlis Agama Islam Dan Adat Istiadat Melayu Kelantan (MAIK).Namun begitu pihak MAIK telah mengamanahkan kepada Ahli Jawatankuasa Kemajuan Masjid Kepala Jajahan yang dipengerusikan oleh Yang Amat Berusaha Ketua Jajahan bagi menguruskan masjid dari sudut pentadbiran dan pengurusan agar masjid berfungsi dengan baik sebagaimana yang dikhendaki oleh pihak MAIK berdasarkan syariat Islam.\n\nStruktur bangunan Masjid Bandar Pasir Mas yang mempunyai ruangan yang luas telah dimanfaatkan dengan menyediakan sebuah mini perpustakaan (Khutub Khanah)untuk kemudahan ahli jemaah dan juga para pelajar sekolah di sekitar masjid bagi mengisi masa lapang di samping duduk beri tikaf di masjid untuk menambah ilmu pengetahuan.Pelbagai bahan bacaan ilmiah dan kitab-kitab rujukan yang terdapat perpustakaan tersebut .Di samping itu juga, sebuah pejabat imam telah diadakan untuk memudahkan pengurusan dengan ahli jemaah dan anak mukim dan setiap hal yang berkaitan dengan hal ehwal masjid dan lain-lain perkara.\n \nBagi setiap program yang melibatkan pengurusan makanan,pihak masjid telah membina satu tempat khusus bagi penyediaan makanan .Contohnya program Ihya Ramadhan .Majlis berbuka puasa akan diadakan di tempat tersebut .\n \nPada awal tahun 2005 satu mesyuarat Jawatankuasa kemajuan masjid telah diadakan untuk membincangkan masalah- masalah yang perlu diatasi di masjid Bandar Pasir Mas. Dia antar perkara yang telah diperbincangkan ialah tentang kebocoran atap masjid yang sekian lama bocor, tentang struktur masjid yang terbuka yang menyebabkan kekotoran di tempat sembahyang seperti najis-najis binatang dan lain-lain faktor lagi serta membincangkan juga tentang penurapan tar di dalam kawasan masjid. Oleh itu mesyuarat telah mengambil satu inisiatif untuk menyelesaikan masalah tersebut dengan melancarkan kutipan derma melalui kebenaran daripada Majlis Agama Islam Kelantan (MAIK).\n \nPada 10 jun 3005 bersamman 3 Jamadil Awwal 1426 hijrah, Uli yang Maha Mulia As- Sultan Kelantan Tengku Ismail Putera dan Yang Teramat Mulia Tengku Mahkota Kelantan Tengku Faris Putera telah mencemar duli berangkat ke masjid Bandar Pasir Mas untuk bersolat jumaat bersama dengan rakyat jelata. Dengan keberangkatan Duli Tuanku, masjid Bandar Pasir Mas telah berubah wajah, yang mana telah diberikan peruntukan untuk mengecat kembali bangunan dan telah diturap 2/3 bahagain kawasan masjid dengan tar.\n \nAhli jawatankuasa pengurusan Masjid Bandar Pasir Mas telah sama-sama berusha sekali lagi untuk mengatasi masalah kebocoran masjid dan pada bulan Disember 2005 permohonan yang telah di buat kepada Jabatan Pembangunan Persekutuan (JPP) Kelantan dengan dibentangkan kertas kerja dan pelan-pelan cadangan yang telah dibuat oleh ahli jawatankuasa masjid. Alhamdulillah dengan berkat usha daripada semua pihak-pihak . akhirnya Masjid Bandar Pasir Mas telah mendapatkan perhatian daripada Timbalan Perdana Menteri Dato’ Seri Najib Tun Razak yang telah datang bersolat di masjid ini. Timbalan Perdana Menteri telah meluluskan peruntukan segera kepada Masjid Bandar Pasir Mas sebanyak RM 530 ribu bagi mengatasi kebocoran dan berapa perkara lain lagi.\n \nPembaikian dan pengubahsuai telah dimulakan pada bulan April 2006 dan Alhamdulillah telah selesai pembaikian dan pengubahsuai sepenuhnya pada bulan Disember 2006. Kini Masjid Bandar Pasir Mas telah berubah wajah sekali lagi dari sudut prasan fizikalnya. Bagi merealisaikan matlamat MAIK untuk menjadikan masjid bukan sebagai tempat ibadat sembahyang sahaja, beberapa program telah dirancang untuk menghidupkan fungsi masjid dari sudut pandangan masyrakat khususnya. Semoga masyarakat islam pada hari ini megetahui betapa pentignya masjid untuk memeainkan peranan seruan institusi engembangan modal insan yang modal berqualiti.",
    "source_musolla_id": "MY-03-PM-00003",
    "provision": "Masjid ini menyediakan pejabat bagi menguruskan urusan pentadbiran. Selain itu.terdapat bilik mensyuarat yang digunakan sebagai tempat perjumpaan ahli AJK masjid. Bilik imam dan bilal turut disediakan untuk sebagai tempat penginapan imam dan bilal. Disamping itu,terdapat dewan terbuka yang dijadikan tempat mengadakan aktiviti kemasyaratan dan tempat berbuka puasa semasa bulan ramadhan. \nRumah bilal dan siak juga disediakan bagi salah satu kemudahan kepda mereka. Terdapat juga rumah imam muda dan tua.\nVan jenazah turut disediakan tatkala ada kematian.Masjid ini turut menyediakan tempat parking berbumbung hanya istimewa untuk AJK masjid sahaja. Di samping itu terdapat tempat parking yang melebihi 20 kenderaan pada satu masa ."
  }
}