{
  "w30dykqdb9": {
    "address": "Jalan Sultanah Zainab, 15000 Kota Bharu, Kelantan, Malaysia 15000",
    "contact": "097446495",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 6.132222,
      "longitude": 102.236733
    },
    "name": "MASJID MUHAMMADI",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "4c8d3e5d-a819-408c-9acd-b35947abc291",
    "geohash": "w30dykqdb9",
    "remarks": "Masjid Muhammadi merupakan masjid yang terkenal di Malaysia secara amnya, dan secara khususnya di Kelantan. Ia merupakan Masjid Negeri dan terletak di Kota Bharu. Nama Masjid Muhammadi diambil sempena nama Sultan Muhammad ke IV yang sangat berjasa kepada Negeri Kelantan. Ia juga dipanggil sebagai \"Masjid Besar\" di kalangan sesetengah rakyat Kelantan.\r\n\r\nPada asalnya masjid ini diberi nama sebagai Masjid Besar Kota Bharu. Masjid ini telah dibina pada tahun 1867 pada zaman pemerintahanSultan Muhammad II (1830 - 1886) dengan menggunakan kayu-kayu yang terpilih. Pengubahsuaian bangunan masjid daripada kayu kepada struktur konkrit telah dilakukan pada tahun 1922 dan telah dirasmikan oleh KDYMM Baginda Sultan Ismail Ibni Al-Marhum Sultan Muhammad IV pada 31 Julai 1931, dan dinamakan sebagai Masjid Muhammadi.\r\n\r\nMasjid ini mengalami kerja-kerja pengubahsuaian dan pembesaran pada tahun 1959, 1968, 1976 dan 1987. Luas keseluruhan masjid kini adalah 10,600 kaki persegi dan boleh memuatkan seramai 2,400 orang ahli jemaah.\r\n\r\nPeranan Masjid Muhammadi di dalam penyebaran dan pendidikan Islam di Kelantan amatlah istimewa. Di sinilah beberapa ulama besar Negeri Kelantan telah mengajar pelbagai ilmu agama. Di antaranya ialah Tuan Taba (1840-1891), Haji Wan Ali Kutan (1837-1912) dan Tok Kenali (1868-1933). Sistem pengajaran di masjid ini mempunyai persamaan dengan pengajaran di Masjidil Haram, Makkah di mana pelajar akan ke Makkah untuk menyambung pelajaran mereka setelah tamat pengajian di masjid ini.\r\n\r\nMasjid ini menjadi pusat penyebaran ilmu agama yang masyhur di Nusantara sehingga Kelantan dikenali sebagai \"Serambi Mekah\".",
    "source_musolla_id": "MY-03-KB-00001",
    "provision": "Masjid ini mempunyai kemudahan asas seperti stor penyimpanan, tempat wuduk bagi lelaki dan perempuan serta tempat meletak kenderaan berbumbung dan terbuka yang boleh memuatkan sebanyak 10 kenderaan dalam satu-satu masa."
  }
}