{
  "w30ekbjute": {
    "address": "Tumpat, Kelantan, Malaysia 16200",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 6.19708,
      "longitude": 102.169998
    },
    "name": "MASJID MUKIM SELEHOR",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "e84d8cb8-5e2a-4e86-bb50-c97538494da9",
    "geohash": "w30ekbjute",
    "remarks": "Masjid ini masih lagi dalam proses pengubahsuaian bagi ruang solat utama yang masih lagi berjalan.Dana bagi proses pengubahsuaian tersebut ialah hasil daripada sumbangan penduduk kampung dan sumbangan ikhlas orang ramai.",
    "source_musolla_id": "MY-03-TPT-00497",
    "provision": "Kemudahan yang terdapat di masjid ini ialah stor yang dijadikan sebagai tempat menyimpan barang.Tandas,tempat  wuduk lelaki dan perempuan juga disediakan di masjid ini.Tempat parking berbumbung turut disediakan di masjid ini hanya untuk motosikal dan kereta.Selain itu,terdapat juga tempat parking terbuka  yang dapat memuatkan 5 buah kenderaan dalam satu masa.",
    "directions": "Masjid ini berada di dalam kawasan kampung.Kedudukan masjid ini ialah berhampiran dengan kawasan perkuburan.Lokasi masjid ini ialah 500meter dari pondok Tok Selehor."
  },
  "w30ekbpmwu": {
    "address": "Tumpat, Kelantan, Malaysia 16200",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 6.197256,
      "longitude": 102.172114
    },
    "name": "MASJID MUKIM KAJANG SEBIDANG",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "d596e31e-5273-4e46-a0c7-a028db72c0ff",
    "geohash": "w30ekbpmwu",
    "source_musolla_id": "MY-03-TPT-00230",
    "provision": "Kemudahan yang terdapat di masjid ini ialah stor yang dijadikan sebagai tempat menyimpan barang.Tandas,tempat  wuduk lelaki dan perempuan juga disediakan di masjid ini.Tempat parking berbumbung turut disediakan di masjid ini hanya untuk motosikal dan kereta.Selain itu,terdapat juga tempat parking terbuka  yang dapat memuatkan 5 buah kenderaan dalam satu masa.Terdapat juga pejabat dan bilik imam di masjid ini.",
    "directions": "Masjid ini berada di dalam kawasan kampung.Kedudukan masjid ini ialah 100meter dari sekolah menengah arab Muhammadi.Lokasi masjid ini ialah 15km dari bandar Tumpat."
  },
  "w30ekb7041": {
    "address": "Tumpat, Kelantan, Malaysia 16200",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 6.19767,
      "longitude": 102.166081
    },
    "name": "MASJID MUKIM SG. PINANG",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "f332e723-020d-4173-970f-57a0f19c3389",
    "geohash": "w30ekb7041",
    "remarks": "Pada asalnya masjid ini merupakan sebuah masjid yang berasaskan kayu.Tetapi pada tahun 1967 masjid ini telah diubahsuai dan pada yang sama telah dirasmikan oleh Tengku Razali Hamzah pada tahun yang sama.Tanah tapak masjid ini telah diwakafkan oleh penduduk kampung sungai pinang.Pengasas asal masjid ini ialah Tuan guru Haji Abdul Malik.Masjid ini juga mempunyai dua buah meriam yang menjadikan masjid ini merupakan masjid yang istimewa.Meriam tersebut telah dipindahkan ke masjid ini oleh Dato Wan Muhamad Jusoh. .",
    "source_musolla_id": "MY-03-TPT-00206",
    "provision": "Kemudahan yang terdapat di masjid ini ialah stor yang dijadikan sebagai tempat menyimpan barang.Tandas,tempat  wuduk lelaki dan perempuan juga disediakan di masjid ini.Tempat parking berbumbung turut disediakan di masjid ini hanya untuk motosikal dan kereta.Selain itu,terdapat juga tempat parking terbuka  yang dapat memuatkan 5 buah kenderaan dalam satu masa.",
    "directions": "Masjid ini berada di dalam kawasan kampung.Lokasi masjid ini ialah 12km dari bandar Kota Bharu."
  },
  "w30ekbpmwv": {
    "address": "Tumpat, Kelantan, Malaysia 16200",
    "contact": "097254317",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 6.197264,
      "longitude": 102.172116
    },
    "name": "MASJID ISMAILI BANDAR TUMPAT",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "6d3a4b91-b377-4986-9402-83e07f666c7e",
    "geohash": "w30ekbpmwv",
    "remarks": "Masjid yang dibina seawal tahun 1900 masehi masih megah berdiri setelah mengalami beberapa kali perubahan. Masjid yang dibina atas niat yang suci dan ikhlas oleh penduduk setempat tetap bersemarak walau pun lebih seabad usianya. Masjid yang dibina bagi memudahkan orang Islam menjalani segala aktiviti mereka, kerana sewaktu itu belum lagi wujud dewan orang ramai atau kemudahan-kemudahan lain. Pelbagai cerita tentang sejarah penubuhannya. Namun rata-rata tidak dapat memberi satu tarikh yang tepat bilakah masjid ini dibina. Walau bagaimana pun dari beberapa sumber yang boleh dipercayai keesahannya masjid ini dibina lebih awal dari Masjid Kampung Laut.Nama asal masjid ini ialah Masjid Tumpat. Setelah beberapa dekad pembinaannya ia mengalami beberapa perubahan. Perubahan-perubahan yang berlaku dengan mengambil kira struktur, pembesaran tapak, dan paling utama adalah untuk menampung populasi penduduk. Masjid ini dirasmikan oleh Kebawah Duli Yang Maha Mulia Al Sultan Kelantan dan diberi nama sempena nama baginda Sultan Ismail.Tapak asal yang berpaya dan mengalami pasang surut air laut mempengaruhi asas binaannya. Bentuk asal bertiang tinggi, mempunyai 5 anak tangga. Tangga asal di sebelah hulu dan hilir masjid selain di belakang. Bangunan masjid ini dapat memuatkan 100 orang jemaah. Peluasan tapak dan ruang ibadat telah melalui beberapa peringkat. Perubahan pertama pada tahun 1923, merangkumi merendahkan tiangnya dan bilang anak tangga daripada 5 kepada 3 bilah anak tangga. Kemajuan ini dibuat setelah tapaknya ditimbus dengan menggunakan sampah dan pasir bagi menutupi paya dan alur sungai yang merentangi dari Kampung Tanjung Che Mas ke Padang Keretapi Tumpat. Kesan peninggalan ini masih dapat dilihat berhampiran rumah tangki keretapi Tumpat. Kemudian dalam sekitar tahun 1968. Perubahan daripada kayu kepada bangunan batu. Bahan binaan asal (kayu)selain digunakan sebagai bahan sokong pembinaan, ia diguna juga bagi mendirikan sebuah sekolah PASTI dalam kawasan masjid. Seawal tahun 1970 masjid baru dapat diguna sepenuhnya.Perubahan terakhir masjid ini ialah dalam tahun 1980 an seolah-olah mencantumkan dua buah masjid seperti yang ada sekarang. Masjid Ismaili Bandar Tumpat setelah melalui beberapa renuvasi dapat menampung 1500 jemaah. Kampung-kampung yang berada di bawah Permukiman Masjid Ismaili adalah; Bandar Tumpat, Tanjung Kuala, Kampung Kelong, Kampung Besut, Kampung Pak Jah, Kampung Kepala Batas, dan Kampung Dalam Rhu. Tanah Perkuburan ialah Kubur Dato' Dalam Rhu",
    "source_musolla_id": "MY-03-TPT-00005",
    "provision": "Kemudahan yang terdapat di masjid ini ialah stor yang dijadikan sebagai tempat menyimpan barang.Tandas,tempat  wuduk lelaki dan perempuan juga disediakan di masjid ini.Tempat parking berbumbung turut disediakan di masjid ini hanya untuk motosikal dan kereta.Selain itu,terdapat juga tempat parking terbuka  yang dapat memuatkan 10 buah kenderaan dalam satu masa.Masjid ini menyediakan pejabat bagi menguruskan urusan pentadbiran. Selain itu.terdapat bilik mensyuarat yang digunakan sebagai tempat perjumpaan ahli AJK masjid. Bilik imam dan bilal turut disediakan untuk sebagai tempat penginapan imam dan bilal",
    "directions": "Masjid ini berada di dalam kawasan bandar tumpat.Lokasi masjid ini juga ialah 500 meter dari balai polis Tumpat yang berada berhadapan dengan pejabat tanah jajahan Tumpat."
  },
  "w30ekbjutk": {
    "address": "Tumpat, Kelantan, Malaysia 16200",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 6.197086,
      "longitude": 102.169995
    },
    "name": "MASJID KARIAH MUKIM CABANG EMPAT TOK MEK NGAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "be3fe399-be4f-41d7-8fae-81fbcb09e3cc",
    "geohash": "w30ekbjutk",
    "source_musolla_id": "MY-03-TPT-00519",
    "provision": "Kemudahan yang terdapat di masjid ini ialah stor yang dijadikan sebagai tempat menyimpan barang.Tandas,tempat  wuduk lelaki dan perempuan juga disediakan di masjid ini.Tempat parking berbumbung turut disediakan di masjid ini hanya untuk motosikal dan kereta.Selain itu,terdapat juga tempat parking terbuka  yang dapat memuatkan 10 buah kenderaan dalam satu masa. \nMasjid ini juga menyediakan pejabat bagi menguruskan urusan pentadbiran. Selain itu.terdapat bilik mensyuarat yang digunakan sebagai tempat perjumpaan ahli AJK masjid. Bilik imam dan bilal turut disediakan untuk sebagai tempat penginapan imam dan bilal.Terdapat juga tandas OKU dan dapur di masjid ini.",
    "directions": "Masjid ini berada di dalam kawasan kampung.Lokasi masjid ini ialah berada di tepi jalan utama Pasir Mas menuju ke Tumpat."
  }
}