{
  "w30f6hgx0h": {
    "address": "16300 Perupok, Kelantan, Malaysia 16300",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 6.047827,
      "longitude": 102.397385
    },
    "name": "MASJID MUKIM NIPAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "b08e3c57-c53c-4140-8cbe-cb34a2990fac",
    "geohash": "w30f6hgx0h",
    "source_musolla_id": "MY-03-BCK-00244",
    "provision": "-Masjid menyediakan kemudahan tandas serta tempat berwuduk lelaki dan perempuan yang berasingan untuk kemudahan pengunjung masjid. Masjid juga mempunyai parkir yang berbumbung untuk meletakkan kenderaan. Masjid ini juga mempunyai kolah di belakang dan mempunyai ruang kolah tambahan untuk menampung jemaah solat yang berlebihan.",
    "directions": "Masjid ini berada di kawasan tepi jalan.Lokasi masjid terletak berhadapan dengan Maahad Tahfiz Sains Al- Muhammadi Kampung Nipah. Masjid ini juga hanya 5km dari Bandar Bachok."
  },
  "w30f64jtks": {
    "address": "16300 Melawi, Kelantan, Malaysia 16300",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 6.03242,
      "longitude": 102.400335
    },
    "name": "MASJID MUKIM REPEK",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "cef9b0d9-260b-49e2-a7ad-abaae98e9e63",
    "geohash": "w30f64jtks",
    "source_musolla_id": "MY-03-BCK-00237",
    "provision": "Masjid menyediakan kemudahan tandas serta tempat berwuduk lelaki dan perempuan yang berasingan untuk kemudahan pengunjung masjid. Masjid juga mempunyai ruang solat tambahan dan tempat parking motosikal yang. Masjid juga dilengkapi keranda dan mempunyai tempat untuk memandikan mayat",
    "directions": "Masjid ini terletak di tepi jalan yang menghubungkan dari Melawi dan Bachok dan lokasinya adalah lebih kurang 15km dari Bandar Bachok."
  },
  "w30f6jr72w": {
    "address": "Perupok, Kelantan, Malaysia 16300",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 6.049939,
      "longitude": 102.402556
    },
    "name": "MASJID MUKIM TOK BELIAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "9f41fd2b-5e73-42da-b9e2-e1aa33bc7968",
    "geohash": "w30f6jr72w",
    "source_musolla_id": "MY-03-BCK-00475",
    "provision": "Masjid ini menyediakan kemudahan tandas serta tempat berwuduk lelaki dan perempuan yang berasingan untuk kemudahan pengunjung masjid. Masjid ini juga mempunyai parking yang berbumbung untuk meletakkan kenderaan. Masjid juga dilengkapi dengan ruang solat tambahan dan mempunyai bangku simen. Di belakang masjid ini juga terdapat stor yang menyimpan perkakasan hak milik masjid dan di kawasan masjid terdapat bangku simen sebagai tempat rehat masjid.",
    "directions": "Masjd ini berada dalam kawasan kampung. Lokasi masjid terletak di tepi jalan yang menghubungkan Kampung Pauha dengan Tawang dan terletak hanya 15km dari Bandar Bachok."
  },
  "w30f6py5zx": {
    "address": "Bandar Bachok, 16300 Perupok, Kelantan, Malaysia 16300",
    "contact": "097783260",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 6.063766,
      "longitude": 102.40114
    },
    "name": "MASJID  MAHMOODI",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "93626cb3-ef0c-4d08-b9a2-b37bdb4b200a",
    "geohash": "w30f6py5zx",
    "remarks": "Masjid ini telah dirasmikan oleh DYMM Tengku Ismail Petra Ibni Almarhum Sultan Yahya Petra pada tanggal 14 Mei 1983.",
    "source_musolla_id": "MY-03-BCK-00006",
    "provision": "Masjid ini menyediakan kemudahan tandas serta tempat berwuduk lelaki dan perempuan yang berasingan untuk kemudahan pengunjung masjid. Masjid juga mempunyai parkir motosikal yang berbumbung. Masjid juga dilengkapi keranda, van jenazah dan tempat mandi mayat. Di sini juga terdapat beduk dan dewan.",
    "directions": "Lokasi masjid ini terletak Bandar Bachok. Masjid ini berada berhadapan dengan Pantai Irama Bachok."
  },
  "w30f64wm8t": {
    "address": "Melawi, Kelantan, Malaysia 16300",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 6.035216,
      "longitude": 102.401183
    },
    "name": "MASJID MUKIM NIMAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "b9c91c57-d62e-425d-800a-4e9531a62456",
    "geohash": "w30f64wm8t",
    "source_musolla_id": "MY-03-BCK-00495",
    "provision": "Masjid menyediakan kemudahan tandas serta tempat berwuduk lelaki dan perempuan yang berasingan untuk kemudahan pengunjung masjid. Masjid juga mempunyai parking yang berbumbung untuk meletakkan kenderaan. Masjid ini juga menyediakan wakaf sebagai tempat rehat masyarakat dan terdapat juga telaga yang agak lama di kawasan masjid.",
    "directions": "Lokasi masjid terletak dalam kawasan kampung.Masjid ini hanya terletak  50km dari Universiti Malaysia Kelantan dan IKBN Tangok.."
  }
}