{
  "w30f14wc44": {
    "address": "Gunong, Kelantan, Malaysia 16390",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.990483,
      "longitude": 102.357999
    },
    "name": "MASJID MUKIM TEMU RANGGAS",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "77137c66-e835-495d-ad30-ebffe40f75bb",
    "geohash": "w30f14wc44",
    "source_musolla_id": "MY-03-BCK-00241",
    "provision": "Masjid menyediakan kemudahan tandas serta tempat wuduk lelaki dan perempuan yang berasingan untuk kemudahan pengunjung masjid. Masjid mempunyai ruang parkir yang berbumbung untuk meletakkan kenderaan. Terdapat kolah di kawasan masjid untuk mengambil wuduk masjid. Masjid juga memiliki tempat memandikan mayat dan mempunyai keranda. Masjid ini juga dengan  dilengkapi bangunan stor untuk menyimpan barang-barang kepunyaan masjid."
  },
  "w30f1me90q": {
    "address": "Gunong, Kelantan, Malaysia 16390",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 6.006984,
      "longitude": 102.364442
    },
    "name": "MASJID MUKIM MUJUR",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "aa9e556d-acec-4d50-b46d-ee2dab54b0e5",
    "geohash": "w30f1me90q",
    "source_musolla_id": "MY-03-BCK-00240",
    "provision": "Masjid menyediakan kemudahan tandas serta tempat berwuduk lelaki dan perempuan yang berasingan untuk kemudahan pengunjung masjid. Masjid mempunyai ruang parking yang berbumbung untuk meletakkan motor yang. Terdapat kolah di kawasan masjid untuk mengambil wuduk masjid mempunyai van jenazah, keranda dan tempat memandikan mayat untuk kemudahan menguruskan jenazah. Masjid ini juga memiliki ruang solat tambahan yang dapat memuatkan jemaah yang berlebihan."
  },
  "w30f1nsmmw": {
    "address": "16070 Beklam, Kelantan, Malaysia 16070",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 6.013204,
      "longitude": 102.354716
    },
    "name": "MASJID MUKIM PAYA MENGKUANG",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "fc5ff30e-4d9f-4592-a30f-04e955c4b1d0",
    "geohash": "w30f1nsmmw",
    "source_musolla_id": "MY-03-BCK-00243",
    "provision": "Masjid ini menyediakan kemudahan tandas serta tempat berwuduk lelaki dan perempuan yang berasingan untuk kemudahan pengunjung masjid. Masjid juga mempunyai parkir yang berbumbung untuk meletakkan kenderaan. Masjid juga dilengkapi dengan ruang solat tambahan dan mempunyai bangku simen. Di masjid juga terdapat tempat mandi mayat dan masjid menyediakan keranda untuk menguruskan jenazah dan di kawasan masjid terdapat bangku simen sebagai tempat rehat masjid."
  },
  "w30f1kz028": {
    "address": "Gunong, Kelantan, Malaysia 16390",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 6.0027,
      "longitude": 102.369254
    },
    "name": "MASJID MUKIM RUSA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "47d1ed8b-ceb9-4a56-94f2-cc7f04bc09c8",
    "geohash": "w30f1kz028",
    "remarks": "Masjid ini dibina telah pada tahun 1960an. Pada asalnya masjid ini adalah dibina daripada bahan kayu kemudian ia diubahsuai menggunakan batu sepenuhnya pada 1987. Masjid ini dibina diatas tanah yang telah diwakafkan. Pengasas masjid ini ialah Hj. Osman Abd Majid.",
    "source_musolla_id": "MY-03-BCK-00239",
    "provision": "Masjid menyediakan kemudahan tandas serta tempat berwuduk lelaki dan perempuan yang berasingan untuk kemudahan pengunjung masjid. Masjid ini juga mempunyai tempat parking motosikal yang berbumbung. Masjid juga dilengkapi ruang solat yang berlebihan dan juga mempunyai sistem penapis air Bio-aura."
  },
  "w30f1bkqq7": {
    "address": "Gunong, Kelantan, Malaysia 16390",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.979028,
      "longitude": 102.387707
    },
    "name": "MASJID MUKIM PINTU GERBANG",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "32599668-8ff5-4edf-a6ec-ca24ab5a544a",
    "geohash": "w30f1bkqq7",
    "source_musolla_id": "MY-03-BCK-00555",
    "provision": "Masjid menyediakan kemudahan tandas serta tempat berwuduk lelaki dan perempuan untuk kemudahan pengunjung masjid. Masjid ini juga mempunyai parking untuk meletakkan kenderaan."
  },
  "w30f1dceq6": {
    "address": "Gunong, Kelantan, Malaysia 16390",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.992238,
      "longitude": 102.372934
    },
    "name": "MASJID MUKIM ALOR BAKAT",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "34bb82c4-cfc6-4663-bda3-d965fefd8ab5",
    "geohash": "w30f1dceq6",
    "remarks": "Masjid ini pada asalnya adalah sebuah surau yang dibina pada tahun 1957. Kemudian masjid telah dinaiktarafkan menjadi sebuah masjid dan siap pada tahun 1967. Masjid dibina diatas tanah yang telah diwakafkan. Pengasas masjid ini ialah Allahyarham Hj. Abdullah.",
    "source_musolla_id": "MY-03-BCK-00508",
    "provision": "Masjid menyediakan kemudahan tandas serta tempat berwuduk lelaki dan perempuan yang berasingan untuk kemudahan pengunjung masjid. Masjid ini juga mempunyai tempat parking motosikal yang berbumbung. Masjid juga dilengkapi keranda dan mempunyai beduk. Di belakang masjid terdapat kolah yang diguna oleh penduduk untuk mengambil wuduk."
  },
  "w30f1whhgv": {
    "address": "Gunong, Kelantan, Malaysia 16390",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 6.010366,
      "longitude": 102.37627
    },
    "name": "MASJID MUKIM JELAWAT",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "63159996-aadc-4735-98c8-5f990b10a5a1",
    "geohash": "w30f1whhgv",
    "source_musolla_id": "MY-03-BCK-00504",
    "provision": "Masjid ini menyediakan kemudahan tandas serta tempat berwuduk lelaki dan perempuan yang berasingan untuk kemudahan pengunjung masjid. Masjid mempunyai ruang parking yang berbumbung untuk meletakkan motor yang boleh memuatkan 8 buah kereta. Terdapat kolah di kawasan masjid untuk mengambil wuduk masjid mempunyai van jenazah untuk kemudahan menguruskan jenazah."
  },
  "w30f1w260k": {
    "address": "Gunong, Kelantan, Malaysia 16390",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 6.011262,
      "longitude": 102.37097
    },
    "name": "MASJID MUKIM TERATAK PULAI",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "cd2ba9bc-7f3a-4cf6-a60b-9b29aef255a9",
    "geohash": "w30f1w260k",
    "source_musolla_id": "MY-03-BCK-00471",
    "provision": "Masjid menyediakan kemudahan tandas serta tempat wuduk lelaki dan perempuan yang berasingan untuk kemudahan pengunjung masjid. Masjid mempunyai ruang parkir yang berbumbung untuk meletakkan motor yang. Terdapat kolah di kawasan masjid untuk mengambil wuduk masjid.Masjid juga memiliki tempat memandikan mayat dan mempunyai keranda. Masjid dilengkapi dengan penghawa dingin dalam ruang solat."
  }
}