{
  "w30f0cztyz": {
    "address": "Gunong, Kelantan, Malaysia 16390",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.987204,
      "longitude": 102.348239
    },
    "name": "MASJID MUKIM BUKIT KECIL",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "944a4d73-c899-49d4-8c83-8ff00b6bfb7b",
    "geohash": "w30f0cztyz",
    "source_musolla_id": "MY-03-BCK-00506",
    "provision": "Masjid ini menyediakan kemudahan tandas serta tempat berwuduk lelaki dan perempuan yang berasingan untuk kemudahan pengunjung masjid. Masjid juga mempunyai parking yang berbumbung untuk meletakkan kenderaan dan ruang solat tambahan di luar. Masjid ini juga mempunyai tempat mandi jenazah dan keranda bagi menguruskan jenazah dengan lebih mudah.",
    "directions": "Masjid ini berada di kawasan kampung. Masjid ini juga hanya 14km dari Bandar Bachok dan berada di tepi jalan raya yang menghubungkan Gunung Stong dan Pasir Puteh."
  },
  "w30f0c4et4": {
    "address": "Gunong, Kelantan, Malaysia 16390",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.982672,
      "longitude": 102.3413
    },
    "name": "MASJID MUKIM MAHLIGAI",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "705cfa19-d86b-4d4d-9400-aea171e3015c",
    "geohash": "w30f0c4et4",
    "source_musolla_id": "MY-03-BCK-00498",
    "provision": "Masjid ini menyediakan kemudahan tandas serta tempat berwuduk lelaki dan perempuan yang berasingan untuk kemudahan pengunjung masjid. Masjid juga mempunyai parkir motosikal yang berbumbung yang boleh memuatkan 12 buah kenderaan pada satu masa. Masjid juga dilengkapi keranda dan mempunyai tempat untuk memandikan jenazah. Di kawasan masjid ini juga dilengkapi wakaf sebagai tempat untuk berehat dan beriadah.",
    "directions": "Masjid ini berada dalam kawasan kampung. Lokasi masjid terletak dari jalan  Pak Badol menghala ke Melor dan hanya terletak 30km dari Bandar Bachok. Masjid berhampiran dengan Kedai Runut."
  }
}