{
  "w30f3yrx5e": {
    "address": "Bandar Bachok, Perupok, Kelantan, Malaysia 16300",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 6.056063,
      "longitude": 102.392042
    },
    "name": "MASJID MUKIM BADAK MELAWI",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "f563b117-fdaa-448c-97fe-623ace7cce1d",
    "geohash": "w30f3yrx5e",
    "remarks": "Masjid ini pada asalnya adalah sebuah surau yang dibina diatas tanah yang telah diwakafkan dan kemudian ia dinaiktaraf menjadi sebuah masjid pada tahun 1977. Penambahan tapak masjid diwakafkan oleh Datin Hjh. Siti Wardiah bt. Hj. Ishak. Pada tanggal 18 April 1982 masjid ini telah sempurna dirasmikan oleh YAB Tun Dr. Mahathir Mohamed, Perdana Menteri Malaysia pada ketika itu.",
    "source_musolla_id": "MY-03-BCK-00020",
    "provision": "Masjid ini menyediakan kemudahan tandas serta tempat berwuduk lelaki dan perempuan yang berasingan untuk kemudahan pengunjung masjid. Masjid juga mempunyai parkir motosikal yang berbumbung. Masjid juga dilengkapi dapur untuk memasak ketika adanya juadah atau makan-makan di masjid. Di sini juga terdapat beduk dan wakaf yang dilengkapi dengan bangku simen.",
    "directions": "Lokasi masjid terletak di tepi jalan. Masjid berada 10km dari Bandar Bachok dan terletak di jalan yang menghubungkan Bachok dan Melawi."
  },
  "w30f3y276q": {
    "address": "Tanjong Pauh, Kelantan, Malaysia 16030",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 6.055434,
      "longitude": 102.382042
    },
    "name": "MASJID MUKIM TELAGA ARA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "232b5fb3-87c0-4f0b-be36-295fdaaae441",
    "geohash": "w30f3y276q",
    "source_musolla_id": "MY-03-BCK-00493",
    "provision": "Masjid ini menyediakan kemudahan tandas serta tempat wuduk lelaki dan perempuan yang berasingan untuk kemudahan pengunjung masjid. Masjid mempunyai ruang parking yang berbumbung untuk meletakkan kenderaan dan 2 kolah di kawasan masjid.",
    "directions": "Masjid terletak di sebuah kawasan kampung. Lokasi masjid hanya 20km dari Bandar Bachok dan terletak dari jalan Beoh ke Gunung. Lokasi masjid juga hanya 50meter dari Sekolah Telaga Ara dan bersebelahan dengan Kedai Runcit."
  }
}