{
  "w8c14q0109": {
    "address": "Miri, Sarawak, Malaysia 98000",
    "contact": "0168700707",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.427672,
      "longitude": 114.005154
    },
    "name": "MASJID DARUL EHSAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "3740b83e-55fb-48f9-8283-4d94d22baf16",
    "geohash": "w8c14q0109",
    "remarks": "MASJID DARUL EHSAN PIASAU JAYA YANG TERLETAK DI PIASAU JAYA TELAH DIRASMIKAN PADA 1 JANUARI 1997 BERSAMAAN 4 JAMADILAKHIR 1418H OLEH YANG AMAT BERHORMAT PEHIN SRI HAJI ABDUL TAIB MAHMUD, KETUA MENTERI SARAWAK.PENTADBIRAN MASJID INI DI BAWAH SELIAN LEMBAGA AMANAH KEBAJIKAN MELAYU MIRI (LAKMM) DAN DIURUS TADBIR OLEH JAWATANKUASA MASJID DARUL EHSAN. MASJID INI MEMPU MENAMPUNG SERAMAI 2500 ORANG JEMAAH DALAM SATU-SATU MASA.",
    "source_musolla_id": "MY-13-MRI-00043",
    "provision": "DI ANTARA KEMUDAHAN PENTADBIRAN YANG TERDAPAT DI BANGUNAN MASJID INI IALAH BILIK-BILIK KELAS, BILIK TETAMU, BILIK MESYUARAT, PEJABAT PENTADBIRAN, ASTAKA, PERPUSTAKAAN, BILIK PENGURUSAN JENAZAH, KERETA JENAZAH YANG MENJADIKAN MASJID INI MERUPAKAN SALAH SATU PUSAT PENGURUSAN FARDHU KIFAYAH YANG UTAMA DI BANDARAYA INI. MASJID INI AMAT POPULAR DENGAN KUMPULAN ZIKIR DAN KUMPULAN NSYID YANG KERAP MEMBUAT PERSEMBAHAN DI SEKITAR BANDARAYA MIRI.",
    "directions": "KEDUDUKAN MASJID INI TERLETAK DI LOT 593, JALAN PIASAU JAYA 1F, PIASAU JAYA, 98000 MIRI, SARAWAK. KEDUDUKAN BANGUNAN MASJID YANG TERLETAK DI KAWASAN PENEMPATAN PIASAU MENAJDI FAKTOR MASJID INI MELAKSANAKAN BANYAK AKTIVITI DAN KEGIATAN AGAMA UNTUK MASYARAKAT ISLAM DI SEKITARNYA."
  },
  "w8c16yqu50": {
    "address": "Taman Permai, Miri, Sarawak, Malaysia 98000",
    "contact": "019-8554909",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.4735,
      "longitude": 114.0365
    },
    "name": "MASJID AR-RAYYAN PERMYJAYA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "5d2738dd-08fb-42dd-aa7b-eb435b24399c",
    "geohash": "w8c16yqu50",
    "remarks": "BANGUNAN MASJID AR'RAYYAN PADA ASALNYA MERUPAKAN SEBUAH SURAU KECIL YANG DISUMBANGKAN OLEH PIHAK NAIM CENDERA SDN. BHD. SELAKU PEMAJU KEPADA SALAH SATU PENEMPATAN PERUMAHAN YANG TERBESAR DI PERMYJAYA, MIRI. PENDUDUK DI SINI MEMPUNYAI KEPELBAGAIAN LATAR BELAKANG. FASA DEMI FASA PEMBESARAN YANG TELAH DILAKSANAKAN CUKUP UNTUK MENCERITAKAN PENINGKATAN KEPERLUAN PEMBANGUNAN KEROHANIAN YANG DIPERLUKAN OLEH MASYARAKAT ISLAM SETEMPAT. BANGUNAN YANG BARU DIBINA PADA TAHUN 2001 DAN DIRASMIKAN OLEH TUAN ABDUL HAMID BIN MOHAMMAD YUSOFF SELAKU KETUA EKSEKUTIF SURUHANJAYA PERUMAHAN DAN PEMBANGUNAN SARAWAK PADA 21 MAC 2001. KELUASAN TANAH UNTUK PEMBINAAN MASJID INI IALAH SELUAS 3900 METER PERSEGI. KEMUDIAN MASJID INI TELAH DIBESARKAN DAN SIAP SEPENUHNYA MENJELANG TAHUN 2013.",
    "source_musolla_id": "MY-13-MRI-00048",
    "provision": "ANTARA KEMUDAHAN YANG TERDAPAT DIMASJID INI IALAH KOPERASI MASJID AR'RAYYAN, GELANGGANG FUTSAL, DEWAN SERBAGUNA, BILIK MESYUARAT, PENGURUSAN JENAZAH, VAN JENAZAH DAN BANYAK LAGI. MASJID INI JUGA MEPUNYAI KUMPULAN DIKIRAMA YANG TERKENAL DI KALANGAN MASYARAKAT BAHAGIAN MIRI.",
    "directions": "KEDUDUKAN BANGUNAN MASJID INI TERLETAK DI LOT 5144, BANDAR BARU PERMYJAYA, TUDAN, 98107 MIRI. MASJID INI MAMPU MENAMPUNG SERAMAI 500 ORANG JEMAAH."
  },
  "w8c00kv2cq": {
    "address": "Miri, Sarawak, Malaysia 98000",
    "contact": "0198552144",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.245008,
      "longitude": 113.92451
    },
    "name": "MASJID DARUL KHAIRAT",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "f15db1d9-2abe-4167-a552-4169d23707a2",
    "geohash": "w8c00kv2cq",
    "source_musolla_id": "MY-13-MRI-00042",
    "provision": "DI ANTARA KEMUDAHAN YANG TERDAPAT DI BANGUNAN MASJID INI IALAH PEJABAT, DAPUR DAN BILIK PENGURUSAN JENAZAH SERTA KERETA JENAZAH",
    "directions": "MASJID DARUL KHAIRAT, KAMPUNG BAKAM TERLETAK DI KAWASAN PERSISIRAN PANTAI MIRI. MASJID INI MENJADI TUMPUAN BEBERAPA KAMPUNG BERDEKATAN KAMPUNG RAAN, KAMPUNG PUSIL, DAN KAMPUNG SIWAK JAYA SEBAGAI PUSAT IBADAH DI KAWASAN INI."
  },
  "w8c09xc3wx": {
    "address": "Miri, Sarawak, Malaysia 98000",
    "contact": "0128781305",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.349513,
      "longitude": 113.974168
    },
    "name": "MASJID DARUL ISTIQAMAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "22462759-ff87-43c2-95c8-bc2f89eafe75",
    "geohash": "w8c09xc3wx",
    "remarks": "MASJID DARUL ISTIQAMAH TELAH DIBINA PADA TAHUN 2001 DAN BOLEH MEMUATKAN SERAMAI 1000 ORANG JEMAAH PADA SATU-SATU MASA. MASJID INI TELAH DIBINA PADA 20 OKTOBER 2001 DENGAN KELUASAN TANAH SELUAS 8093.7 METER PERSEGI.",
    "source_musolla_id": "MY-13-MRI-00050",
    "provision": "MASJID INI DILENGKAPI DENGAN KEMUDAHAN YANG MEMENUHI KEPERLUAN IBADAH SEMASA PENDUDUK SETEMPAT. ANTARA KEMUDAHAN YANG TERDAPAT DI MASJID INI IALAH, BILIK PEJABAT, BILIK MESYUARAT, RUANG ASTAKA, RUANG DAPUR DISAMPING ITU RUANG SOLAT MASJID JUGA DILENGKAPI DENGAN ALAT PENGHAWA DINGIN YANG MEMBERI KESELESAAN KEPADA PARA JEMAAH UNTUK MENUNAIKAN SOLAT. MASJID INI TURUT MEMPUNYAI RUMAH PENGURUSAN JENAZAH YANG TURUT DILENGKAPKAN DENGAN SEBUAH VAN JENAZAH BAGI MEMUDAHKAN PENGURUSAN JENAZAH MASYARAKAT ISLAM DI SEKITAR MIRI.",
    "directions": "MASJID INI TERLETAK DI LOT 4483 KAMPUNG LUAK JALAN BAKAM MIRI, SARAWAK."
  },
  "w8c14db1w8": {
    "address": "Jalan Tanjung Batu 2, 98000 Miri, Sarawak, Malaysia 98000",
    "contact": "0178076988",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.4099,
      "longitude": 114.0164
    },
    "name": "MASJID AN-NUR",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "da2c30ba-0627-40be-93bc-522afb74d1a4",
    "geohash": "w8c14db1w8",
    "remarks": "MASJID AN-NUR MERUPAKAN SEBUAH MASJID YANG TERLETAK DI KAMPUNG PUJUT TANJUNG BATU, MIRI. MASJID YANG TELAH DIBINA SEMENJAK TAHUN 1997 INI MERUPAKAN PUSAT KEGIATAN MASYARAKAT SETEMPAT. MASJID INI DIKENDALIKAN SEPENUHNYA OLEH JAWATANKUASA PENGURUSAN MASJID",
    "source_musolla_id": "MY-13-MRI-00049",
    "provision": "DI ANTARA KEMUDAHAN YANG TERDAPAT DI MASJID INI IALAH BILIK PEJABAT, DEWAN TERBUKA, DAPUR DAN BILIK PENGURUSAN JENAZAH.",
    "directions": "KEDUDUKAN MASJID INI TERLETAK DI LOT 182, JALAN PUJUT TANJUNG BATU MIRI. MASJID INI YANG MEMPUNYAI KELUASAN SELUAS 2023.43 METER PERSEGI INI MAMPU MENAMPUNG SERAMAI 500 ORANG JEMAAH PADA SATU-SATU MASA."
  },
  "w8c16me4yj": {
    "address": "Lutong Lama, Miri, Sarawak, Malaysia 98100",
    "contact": "019-8732958",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.46919,
      "longitude": 114.009508
    },
    "name": "MASJID AN NAIM",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "9f94dd0a-aed7-4b67-9c25-700cf33a795c",
    "geohash": "w8c16me4yj",
    "remarks": "MASJID AN-NAIM, LUTONG MERUPAKAN  SEBUAH MASJID YANG BERADA DI BAWAH PENTADBIRAN LEMBAGA AMANAH KEBAJIKAN ISLAM LUTONG (LAKIL). MANAKALA PENGURUSAN MASJID INI DITADBIR OLEH JAWATANKAUSA PENGURUSAN MASJID AN-NAIM YANG MEMPUNYAI BANGUNAN PEJABATNYA SENDIRI DI DALAM MASJID TERSEBUT.",
    "source_musolla_id": "MY-13-MRI-00040",
    "provision": "DI ANTARA KEMUDAHAN PENTADBIRAN YANG TERDAPAT DI BANGUNAN MASJID INI IALAH BILIK-BILIK KELAS, ASRAMA, BILIK TETAMU, KOMPUTER, FAKSIMILI DAN BILIK PENGURUSAN JENAZAH YANG MENAJDIKAN MASJID INI MERUPAKAN SALAH SATU PUSAT PENGURUSAN FARDHU KIFAYAH YANG UTAMA DI BANDARAYA MIRI.",
    "directions": "KEDUDUKAN STRATEGIK MASJID INI TERLETAK DI KAMPUNG PENGKALAN LUTONG DAN BERSEBELAHAN DENGAN GEREJA DAN BERHADAPAN DENGAN SHOPING KOMPLEKS MYY MALL."
  },
  "w8c41ftx6m": {
    "address": "Miri, Sarawak, Malaysia 98000",
    "contact": "0138137133",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.58532,
      "longitude": 113.990811
    },
    "name": "MASJID NURUL IMAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "78ba35f1-c29e-4e54-b742-3ea7f30548c9",
    "geohash": "w8c41ftx6m",
    "remarks": "BANGUNAN MASJID INI TELAH DIBINA PADA TAHUN 1986 DENGAN PERUNTUKAN RM 50,000.00 DAN DILETAKKAN DI DALAM GRED IV IAITU GRED KAMPUNG.",
    "source_musolla_id": "MY-13-MRI-00041",
    "provision": "ANTARA KEMUDAHAN ASAS SEMASA YANG TELAH DISEDIAKAN SEPERTI RUANG SOLAT, DAPUR DAN BILIK PENGURUSAN JENAZAH.",
    "directions": "MASJID INI TERLETAK DI KAMPUNG MASJID KUALA BARAM IAITU BERHAMPIRAN DENGAN SEMPADAN MIRI-BRUNEI DAN DIPISAHKAN DENGAN BANDARAYA MIRI OLEH SUNGAI BARAM."
  },
  "w8c0d50wcw": {
    "address": "Miri, Sarawak, Malaysia 98000",
    "contact": "013-8111127",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.324314,
      "longitude": 113.994899
    },
    "name": "MASJID AL-FIRDAUS",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "2949e991-caef-491f-9b80-97976770b95b",
    "geohash": "w8c0d50wcw",
    "remarks": "PADA ASALNYA MASJID INI MERUPAKAN SEBUAH SURAU DAN TELAH DINAIK TARAF KEPADA STATUS MASJID PADA TAHUN 2004. MASJID INI MEMPUNYAI KEPELBAGAIAN LATAR BELAKANG YANG BERSESUAIAN DENGAN KEDUDUKANNYA SEBAGAI NADI AKTIVITI KEAGAMAAN KEPADA KAWASAN PERUMAHAN YANG TERDAPAT BERHA,PIRAN DENGAN LAPANGAN TERBANG MIRI.",
    "source_musolla_id": "MY-13-MRI-00047",
    "provision": "TERDAPAT BANYAK KEMUDAHAN YANG TELAH DISEDIAKAN DI MASJID INI. DI ANTARA KEMUDAHAN YANG PENTADBIRAN YANG TERDAPT DI MASJID INI IALAH BILIK TETAMU, PEJABAT, STOR, DAPUR DAN BILIK PENGURUSAN JENAZAH YANG MENJADIKAN MASJID INI JUGA MERUPAKAN SALAH SATU PUSAT PENGURUSAN FARDHU KIFAYAH YANG UTAMA DI BANDARAYA MIRI.",
    "directions": "MASJID INI TERLETAK DI TENGAH-TENGAH KAWASAN PERUMAHAN DAN BERHAMPIRAN DENGAN LAPANGAN TERBANG MIRI"
  },
  "w8cu2yhrn5": {
    "address": "Mentiri, Brunei Darussalam BU1229",
    "contact": "0109508456",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5,
      "longitude": 115
    },
    "name": "MASJID KG. MAGUMAS SIAK",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "c27d1626-b289-474a-aaf9-b2191447131f",
    "geohash": "w8cu2yhrn5",
    "source_musolla_id": "MY-12-BFT-00533"
  },
  "w8cyn9bg4c": {
    "address": "Bandar Labuan, Labuan, Wilayah Persekutuan, Malaysia 87000",
    "contact": "087-414212",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.283575,
      "longitude": 115.247739
    },
    "name": "MASJID JAMEK AN- NUR",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "f94137be-07c3-4bf0-98f5-091024d070da",
    "geohash": "w8cyn9bg4c",
    "remarks": "Masjid yang dinamakan An-Nur ini terletak di tapak seluas 4.5 ekar di pusat bandar Labuan dan ia sangat mudah dikunjungi oleh sesiapa sahaja. Pada peringkat awalnya pembinaan masjid ini dikendalikan oleh kerajaan Negeri Sabah melalui Majlis Agama Islam Sabah (MUIS). Masjid ini didirikan bagi mengganti masjid lama Labuan yang tidak lagi dapat menampung bilangan jemaah yang semakin meningkat.\r\n\r\nKerja-kerja projek pembinaan telah dimulakan pada 9 Jun 1980 Masihi tetapi atas beberapa sebab teknikal, projek ini telah ditangguhkan. Namun pada 16 April 1984 Masihi setelah Pulau Labuan dijadikan Wilayah Persekutuan yang kedua selepas Kuala Lumpur, projek ini diambil alih dan dilaksanakan di bawah pentadbiran kerajaan Persekutuan. Tawaran melaksanakan projek ini telah dibuat semula dan akhirnya pembinaan masjid ini siap pada 15 Mei 1987 Masihi. Masjid ini telah dirasmikan pada 13 Jamadilakhir 1408 Hijri bersamaan 1 Februari 1988 Masihi oleh Duli Yang Maha Mulia Sultan Iskandar Alaudin Shah ketika Baginda menjadi Yang di-Pertuan Agong Malaysia.",
    "source_musolla_id": "MY-15-WLB-00001",
    "directions": "Masjid ini terletak di tengah pusat bandar wilayah persekutuan labuan dikelilingi oleh beberapa buah sekolah, bangunan pejabat kerajaan, kawasan perumahan dan jalan raya utama. kedudukan ini menambahkan lagi kepentingan, keindahan dan daya tarikan umum."
  },
  "w8cym66z5m": {
    "address": "Kampung Layang-Layangan, Labuan, Wilayah Persekutuan, Malaysia 87000",
    "contact": "013-8562102",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.330974,
      "longitude": 115.195575
    },
    "name": "MASJID JAMEK LAYANG-LAYANGAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "154e3874-2022-4720-9b77-b99822cc07d1",
    "geohash": "w8cym66z5m",
    "source_musolla_id": "MY-15-WLB-00011"
  },
  "w8c11vz670": {
    "address": "Miri, Sarawak, Malaysia 98000",
    "contact": "019-4878770",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.426507,
      "longitude": 113.993245
    },
    "name": "MASJID NUR HIJRAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "546f47d7-007d-4151-8ffc-bd329e446148",
    "geohash": "w8c11vz670",
    "source_musolla_id": "MY-13-MRI-00273"
  },
  "w8c0d8j9c5": {
    "address": "Miri, Sarawak, Malaysia 98000",
    "contact": "0168697652",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.30696,
      "longitude": 114.023716
    },
    "name": "MASJID DARUL HANA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "f014ec9a-b6fb-4376-b249-33a438776fe6",
    "geohash": "w8c0d8j9c5",
    "source_musolla_id": "MY-13-MRI-00274"
  },
  "w8c11be3gv": {
    "address": "Miri, Sarawak, Malaysia 98000",
    "contact": "0198383740",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.397607,
      "longitude": 113.987786
    },
    "name": "MASJID JAMEK",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "08cf4c35-b3d5-4536-969f-178e7f766968",
    "geohash": "w8c11be3gv",
    "remarks": "BANGUNAN MASJID INI TELAH DIBINA PADA TAHUN 1954 YANG MANA MERUPAKAN ANTARA BANGUNAN BERSEJARAH DI BANDARAYA MIRI DAN LAMBANG KEPADA PENINGKATAN SYIAR ISLAM DI MIRI. MASJID INI MEMPUNYAI NILAI WARISAN YANG SANGAT BERHARGA BAGI MASYARAKAT ISLAM DI BAHAGIAN MIRI.",
    "source_musolla_id": "MY-13-MRI-00275",
    "provision": "DI ANTARA KEMUDAHAN YANG TERDAPAT DI MASJID INI IALAH RUANG SOLAT YANG BERHAWA DINGIN DAN SELESA DAN DEWAN SERBAGUNA YANG BOLEH MEMUATKAN SERAMAI 150 ORANG.",
    "directions": "KEDUDUKAN MASJID INI TERLETAK DI LOT 481, JALAN MERBAU, 98000 MIRI, SARAWAK. MASJID INI TERLETAK BERSEBELAHAN DENGAN MEGA HOTEL MIRI DAN SEKOLAH AGAMA RAKYAT MIRI."
  },
  "w8cyq4z4k2": {
    "address": "Kampung Lajau, 87000 Labuan, Wilayah Persekutuan, Malaysia 87000",
    "contact": "019-9319616",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.332876,
      "longitude": 115.234412
    },
    "name": "MASJID SULTAN MUHAMMAD V",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "1586df01-0ce7-47e3-a23a-13e6f6d0a7df",
    "geohash": "w8cyq4z4k2",
    "remarks": "Mula dibina pada tahun 2009 menggunakan peruntukan kewangan Jakim dan Perbadanan Labuan sebanyak RM 5.1 juta dan telah siap sepenuhnya pada tahun 2013. Masjid ini telah diserahkan oleh Perbadanan Labuan kepada Jakim pada 19 Februari 2013 dan didaftarkan di Jawi Labuan pada 17 Julai 2013. Masjid ini telah dibuka kepada orang awam pada 8 Julai 2013 dan solat jumaat pertama yang ditunaikan pada 12 Julai 2013 bersamaan 3 Ramadhan 1434H.",
    "source_musolla_id": "MY-15-WLB-00014",
    "provision": "Kemudahan yang disediakan dimasjid ini antaranya:\r\no\tRuang solat utama\r\no\tBilik PA sistem/bilal.\r\no\tBilik imam\r\no\tBilik jenazah\r\no\tBilik kuliah/serbaguna (5 bilik)\r\no\tBilik wuduk lelaki\r\no\tBilik wuduk wanita\r\no\tPantri\r\no\tBilik mesyuarat.\r\no\tTandas OKU\r\no\tTandas lelaki\r\no\tTandas wanita",
    "directions": "Masjid ini terletak di Kampung Lajau iaitu 7KM dari bandar Labuan. Masjid-masjid yang berdekatan  adalah Masjid Jamek Adam, Kg Lajau sejauh 3.8 KM; Masjid Sirajul Islam, Kg Tg Aru, 2.5 KM;\r\ndan Surau Baitul Makmur, Kg Durian Tunjong sejauh 1 KM."
  },
  "w8c419wbsj": {
    "address": "Kampung Muhibbah, Miri, Sarawak, Malaysia 98000",
    "contact": "013-8137044",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.578668,
      "longitude": 113.981612
    },
    "name": "MASJID NURUL IBADAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "856aad3e-c4d6-4b1f-9121-ca5de2359755",
    "geohash": "w8c419wbsj",
    "source_musolla_id": "MY-13-MRI-00287"
  },
  "w8c11cq5nq": {
    "address": "Miri, Sarawak, Malaysia 98000",
    "contact": "012-8728758",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.401947,
      "longitude": 113.99167
    },
    "name": "MASJID AT-TAQWA MIRI",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "fbe6afff-b6cc-42f5-a0ee-ddf585538a65",
    "geohash": "w8c11cq5nq",
    "source_musolla_id": "MY-13-MRI-00419"
  },
  "w8c11cmfvv": {
    "address": "Miri, Sarawak, Malaysia 98000",
    "contact": "0128728758",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.401898,
      "longitude": 113.991307
    },
    "name": "MASJID AT-TAQWA MIRI",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "f0d25019-9988-4245-9b75-a7aabfbad5ed",
    "geohash": "w8c11cmfvv",
    "remarks": "MASJID AT TAQWA MIRI TERLETAK DI TENGAH-TENGAH PUSAT BANDARAYA MIRI. MASJID INI TELAH DIRASMIKAN PADA 30 OGOS 1983 BERSAMAAN 14 ZULHIJJAH 1405H OLEH MANTAN YUAN YANG TERUTAMA YANG DI-PERTUA NEGERI SARAWAK ALLAHYARHAM TUN AHMAD ZAIDI ADRUCE.",
    "source_musolla_id": "MY-13--00414",
    "provision": "DI ANTARA KEMUDAHAN YANG  TERDAPAT DI BANGUNAN INI IALAH BILIK-BILIK TETAMU KHAS ()VIP), BILIK MUSAFIR, BILIK TETAMU, DEWAN SEBAGUNA, KANTIN, BILIK KELAS,BILIK MESYUARAT DAN KEDAI GUNTING RAMBUT (LELAKI)",
    "directions": "KEDUDUKAN STRATEGIK MASJID INI TERLETAK DIATAS LOT 398 JALAN MERPATI MIRI.KEDUDUKAN DI TENGAH PUSAT BANDAR."
  }
}