{
  "w8c00kv2cq": {
    "address": "Miri, Sarawak, Malaysia 98000",
    "contact": "0198552144",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.245008,
      "longitude": 113.92451
    },
    "name": "MASJID DARUL KHAIRAT",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "f15db1d9-2abe-4167-a552-4169d23707a2",
    "geohash": "w8c00kv2cq",
    "source_musolla_id": "MY-13-MRI-00042",
    "provision": "DI ANTARA KEMUDAHAN YANG TERDAPAT DI BANGUNAN MASJID INI IALAH PEJABAT, DAPUR DAN BILIK PENGURUSAN JENAZAH SERTA KERETA JENAZAH",
    "directions": "MASJID DARUL KHAIRAT, KAMPUNG BAKAM TERLETAK DI KAWASAN PERSISIRAN PANTAI MIRI. MASJID INI MENJADI TUMPUAN BEBERAPA KAMPUNG BERDEKATAN KAMPUNG RAAN, KAMPUNG PUSIL, DAN KAMPUNG SIWAK JAYA SEBAGAI PUSAT IBADAH DI KAWASAN INI."
  },
  "w8c09xc3wx": {
    "address": "Miri, Sarawak, Malaysia 98000",
    "contact": "0128781305",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.349513,
      "longitude": 113.974168
    },
    "name": "MASJID DARUL ISTIQAMAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "22462759-ff87-43c2-95c8-bc2f89eafe75",
    "geohash": "w8c09xc3wx",
    "remarks": "MASJID DARUL ISTIQAMAH TELAH DIBINA PADA TAHUN 2001 DAN BOLEH MEMUATKAN SERAMAI 1000 ORANG JEMAAH PADA SATU-SATU MASA. MASJID INI TELAH DIBINA PADA 20 OKTOBER 2001 DENGAN KELUASAN TANAH SELUAS 8093.7 METER PERSEGI.",
    "source_musolla_id": "MY-13-MRI-00050",
    "provision": "MASJID INI DILENGKAPI DENGAN KEMUDAHAN YANG MEMENUHI KEPERLUAN IBADAH SEMASA PENDUDUK SETEMPAT. ANTARA KEMUDAHAN YANG TERDAPAT DI MASJID INI IALAH, BILIK PEJABAT, BILIK MESYUARAT, RUANG ASTAKA, RUANG DAPUR DISAMPING ITU RUANG SOLAT MASJID JUGA DILENGKAPI DENGAN ALAT PENGHAWA DINGIN YANG MEMBERI KESELESAAN KEPADA PARA JEMAAH UNTUK MENUNAIKAN SOLAT. MASJID INI TURUT MEMPUNYAI RUMAH PENGURUSAN JENAZAH YANG TURUT DILENGKAPKAN DENGAN SEBUAH VAN JENAZAH BAGI MEMUDAHKAN PENGURUSAN JENAZAH MASYARAKAT ISLAM DI SEKITAR MIRI.",
    "directions": "MASJID INI TERLETAK DI LOT 4483 KAMPUNG LUAK JALAN BAKAM MIRI, SARAWAK."
  },
  "w8c0d50wcw": {
    "address": "Miri, Sarawak, Malaysia 98000",
    "contact": "013-8111127",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.324314,
      "longitude": 113.994899
    },
    "name": "MASJID AL-FIRDAUS",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "2949e991-caef-491f-9b80-97976770b95b",
    "geohash": "w8c0d50wcw",
    "remarks": "PADA ASALNYA MASJID INI MERUPAKAN SEBUAH SURAU DAN TELAH DINAIK TARAF KEPADA STATUS MASJID PADA TAHUN 2004. MASJID INI MEMPUNYAI KEPELBAGAIAN LATAR BELAKANG YANG BERSESUAIAN DENGAN KEDUDUKANNYA SEBAGAI NADI AKTIVITI KEAGAMAAN KEPADA KAWASAN PERUMAHAN YANG TERDAPAT BERHA,PIRAN DENGAN LAPANGAN TERBANG MIRI.",
    "source_musolla_id": "MY-13-MRI-00047",
    "provision": "TERDAPAT BANYAK KEMUDAHAN YANG TELAH DISEDIAKAN DI MASJID INI. DI ANTARA KEMUDAHAN YANG PENTADBIRAN YANG TERDAPT DI MASJID INI IALAH BILIK TETAMU, PEJABAT, STOR, DAPUR DAN BILIK PENGURUSAN JENAZAH YANG MENJADIKAN MASJID INI JUGA MERUPAKAN SALAH SATU PUSAT PENGURUSAN FARDHU KIFAYAH YANG UTAMA DI BANDARAYA MIRI.",
    "directions": "MASJID INI TERLETAK DI TENGAH-TENGAH KAWASAN PERUMAHAN DAN BERHAMPIRAN DENGAN LAPANGAN TERBANG MIRI"
  },
  "w8c0d8j9c5": {
    "address": "Miri, Sarawak, Malaysia 98000",
    "contact": "0168697652",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.30696,
      "longitude": 114.023716
    },
    "name": "MASJID DARUL HANA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "f014ec9a-b6fb-4376-b249-33a438776fe6",
    "geohash": "w8c0d8j9c5",
    "source_musolla_id": "MY-13-MRI-00274"
  }
}