{
  "w8c14q0109": {
    "address": "Miri, Sarawak, Malaysia 98000",
    "contact": "0168700707",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.427672,
      "longitude": 114.005154
    },
    "name": "MASJID DARUL EHSAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "3740b83e-55fb-48f9-8283-4d94d22baf16",
    "geohash": "w8c14q0109",
    "remarks": "MASJID DARUL EHSAN PIASAU JAYA YANG TERLETAK DI PIASAU JAYA TELAH DIRASMIKAN PADA 1 JANUARI 1997 BERSAMAAN 4 JAMADILAKHIR 1418H OLEH YANG AMAT BERHORMAT PEHIN SRI HAJI ABDUL TAIB MAHMUD, KETUA MENTERI SARAWAK.PENTADBIRAN MASJID INI DI BAWAH SELIAN LEMBAGA AMANAH KEBAJIKAN MELAYU MIRI (LAKMM) DAN DIURUS TADBIR OLEH JAWATANKUASA MASJID DARUL EHSAN. MASJID INI MEMPU MENAMPUNG SERAMAI 2500 ORANG JEMAAH DALAM SATU-SATU MASA.",
    "source_musolla_id": "MY-13-MRI-00043",
    "provision": "DI ANTARA KEMUDAHAN PENTADBIRAN YANG TERDAPAT DI BANGUNAN MASJID INI IALAH BILIK-BILIK KELAS, BILIK TETAMU, BILIK MESYUARAT, PEJABAT PENTADBIRAN, ASTAKA, PERPUSTAKAAN, BILIK PENGURUSAN JENAZAH, KERETA JENAZAH YANG MENJADIKAN MASJID INI MERUPAKAN SALAH SATU PUSAT PENGURUSAN FARDHU KIFAYAH YANG UTAMA DI BANDARAYA INI. MASJID INI AMAT POPULAR DENGAN KUMPULAN ZIKIR DAN KUMPULAN NSYID YANG KERAP MEMBUAT PERSEMBAHAN DI SEKITAR BANDARAYA MIRI."
  },
  "w8c14db1w8": {
    "address": "Jalan Tanjung Batu 2, 98000 Miri, Sarawak, Malaysia 98000",
    "contact": "0178076988",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.4099,
      "longitude": 114.0164
    },
    "name": "MASJID AN-NUR",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "da2c30ba-0627-40be-93bc-522afb74d1a4",
    "geohash": "w8c14db1w8",
    "remarks": "MASJID AN-NUR MERUPAKAN SEBUAH MASJID YANG TERLETAK DI KAMPUNG PUJUT TANJUNG BATU, MIRI. MASJID YANG TELAH DIBINA SEMENJAK TAHUN 1997 INI MERUPAKAN PUSAT KEGIATAN MASYARAKAT SETEMPAT. MASJID INI DIKENDALIKAN SEPENUHNYA OLEH JAWATANKUASA PENGURUSAN MASJID",
    "source_musolla_id": "MY-13-MRI-00049",
    "provision": "DI ANTARA KEMUDAHAN YANG TERDAPAT DI MASJID INI IALAH BILIK PEJABAT, DEWAN TERBUKA, DAPUR DAN BILIK PENGURUSAN JENAZAH."
  }
}