{
  "w8uhsfb88f": {
    "address": "Bandar Lahad Datu, Lahad Datu, Sabah, Malaysia 91100",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.024969,
      "longitude": 118.334466
    },
    "name": "MASJID AR-RAUDHAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "9221f52e-36f3-45d3-8226-5c42eecb2e97",
    "geohash": "w8uhsfb88f",
    "source_musolla_id": "MY-12-LD-00542"
  },
  "w8u37p9t4t": {
    "address": "Semporna, Sabah, Malaysia 91300",
    "contact": "089-784051",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.480561,
      "longitude": 118.610571
    },
    "name": "MASJIDUR RAHMAN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "f59fbb67-5c90-4d88-a865-81b80fb813f6",
    "geohash": "w8u37p9t4t",
    "remarks": "SEJARAH MASJID DAERAH SEMPORNA\n(MASJIDUR RAHMAN)\n\n           Masjidur Rahman merupakan masjid yang terawal dibina di Daerah semporna iaitu sekitar sekitar tahun 1937, Pembinaan Masjid ini menjadi simbolik kepada masyarakat yang beragama Islam di daerah yang mana kos bagi menampung setiap perbelanjaan untuk pembinaan Masjid ini adalah hasil kutipan derma daripada Masyarakat Semporna. Pada ketika itu agama Islam sedang berkembang pesat ke seluruh kampung di daerah semporna. \n           Pada tahun 1965, Persatuan Islam Cawangan Daerah Semporna telah bercadang untuk membina Sebuah Masjid baru bagi penduduk di Daerah Semporna menggantikan Masjid lama yang telah usang, iaitu sebelum Sabah mendapat Kemerdekaan menerusi Malaysia. Dengan adanya Masjid baru nanti, bukan hanya selesa digunakan untuk beribadah iaitu fardhu ain atau fardhu kifayah sahaja tetapi dapat melakukan aktiviti-aktiviti yang berkaitan dengan dakwah dan aktiviti ekonomi dan sosial. Sebelum itu, cadangan untuk membina sebuah masjid baru bagi Daerah Semporna telah ada namun tidak ada pihak dan badan-badan tertentu tampil ke depan untuk melaksanakan rancangan tersebut. \n            Sehinggalah tertubuhnya Persatuan Islam Cawangan Semporna dan maka itu, sekitar bulan Jun tahun yang sama, Persatuan Islam Cawangan Semporna telah mengadakan satu persidangan yang dipengerusikan oleh OKK Sakaran Bin Dandai yang bertempat di bangunan Madrasatul-Salamah. Tujuan persidangan tersebut adalah untuk membincangkan pelaksanaan pembinaan masjid baru Daerah Semporna yang ketika itu turut dihadiri oleh Yang Amat Berbahagia, Dato Abdullah Bin Pg. Uddang, Tuan NC Haji Panglima Jakarullah Bin Badaluddin, Tuan NC Penghulu Jaji Bin Hajibuddin dan Yang Amat Berhormat Encik Mohd Dara Bin Langpad. Namun persidangan tersebut gagal dalam usaha mencari sumber kewangan yang akan di peruntukkan dalam pelaksanaan pembinaan masjid baru Semporna.\n              Intipati dalam persidangan tersebut lebih merujuk kepada sumber kewangan yang akan diperuntukkan dalam pelaksanaan pembinaan masjid baru itu. Dalam persidangan tersebut, peruntukan kewangan yang diprolehi adalah sebanyak RM 160 ribu melalui kerajaan pusat (Encik Rozhan Haji Kuntom) dan Syarikat Kerjasama Kayu Balak Anak Negeri Daerah Semporna yang bersetuju memberi bantuan kewangan masing-masing sebanyak RM 80 ribu. Dan dalam perbincangan tersebut juga, semua pihak bersetuju memperuntukkan sebahagian daripada wang peruntukan tersebut iaitu RM 30,000.00 akan dibahagikan untuk membina sebuah Balai Masyarakat Islam yang bertapak di masjid lama. Intipati lain dalam persidangan tersebut juga menyentuh kepada masalah tapak pembinaan masjid baru yang tidak mencukupi memandangkan Balai Masyarakat Islam turut dibina ditapak yang sama. Dalam pada itu, Kerajaan melalui YAB Tun Dato Mustapah Bin Datu Harun telah bersetuju untuk memberikan setengah ekar begi menambah kelusan tapak tersebut. \n                Pada 16hb Ogos 1966 setahun kemudian selepas persidangan tersebut, acara meletakkan batu asas bagi bangunan masjid baru itu telah dilakukan. Dan sekitar 19hb April tahun yang sama, ketika pembinaan masjid baru hampir siap, satu Jawatankuasa telah ditubuhkan bagi mengendalikan upacara Istiadat Pembukaan rasmi yang akan dirasmikan oleh Yang Teramat Mulia, Tunku Abdul Rahman Putra Al-Haj. Dan pada bulan September, jawatankuasa tersebut telah bersidang bagi membincangkan nama yang sesuai bagi masjid baru itu namun gagal mencari nama yang sesuai.\n                 Di dalam persidangan akhir pada 23hb September 1967, tiga badan Jawatankuasa yang terdiri daripada Persatuan Islam Cawangan Semporna, Jawatankuasa Pembinaan Masjid dan Jawatankuasa Pembukaan Masjid telah bersetuju untuk menamakan Masjid Baru Daerah Semporna dengan nama MASJID AR-RAHMAN. Kata sepakat yang dipersetujui menamakan Masjid baru Semporna dengan nama MASJID AR-RAHMAN diambil daripada salah satu nama sifat Allah SWT. Nama RAHMAN juga mengingatkan Jawatankuasa dalam persidangan tersebut bersempena dengan lawatan pertama Yang Teramat Mulia, Tunku Abdul Rahman Putra Al-Haj ke Daerah Semporna suatu ketika dahulu dan juga sebagai penghormatan kepada Yang Teramat Mulia Tunku diatas kesudian Yang Teramat Mulia Tunku yang akan merasmikan majid baru Daerah Semporna pada 20hb Oktober 1967 iaitu hari Jumaat bersamaan 16hb Rejab 1387H.",
    "source_musolla_id": "MY-12-SNA-00005"
  },
  "w8uhs4cx2h": {
    "address": "91100 Lahad Datu, Sabah, Malaysia 91100",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.026141,
      "longitude": 118.30285
    },
    "name": "MASJID JAMEK DARUSSALAM",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "b3c48fc7-8798-4cf2-a186-d3259afdc0fd",
    "geohash": "w8uhs4cx2h",
    "source_musolla_id": "MY-12-LD-00018"
  },
  "w8uh17xhxc": {
    "address": "Lahad Datu, Sabah, Malaysia 91100",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.941882,
      "longitude": 118.189887
    },
    "name": "MASJID AINUL YAQIN",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "c27d8f86-6b9a-43ae-b04d-cadc40846cf3",
    "geohash": "w8uh17xhxc",
    "source_musolla_id": "MY-12-LD-00570"
  },
  "w8uh1xxvr2": {
    "address": "Lahad Datu, Sabah, Malaysia 91100",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.963979,
      "longitude": 118.201882
    },
    "name": "MASJID NUR SALAM",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "97144d10-1990-4c95-b997-28774ebc1a34",
    "geohash": "w8uh1xxvr2",
    "source_musolla_id": "MY-12-LD-00017"
  },
  "w8uhegxcd1": {
    "address": "Lahad Datu, Sabah, Malaysia 91100",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 5.029257,
      "longitude": 118.300534
    },
    "name": "MASJID NURUL ITTIHAD",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "89e20146-8764-4f9d-a9f5-3d2318bcac35",
    "geohash": "w8uhegxcd1",
    "source_musolla_id": "MY-12-LD-00315",
    "provision": "1. Terdapat kelas al-Quran dan Kuliah setiap Subuh, Manghrib."
  },
  "w8uhkutrrm": {
    "address": "Lahad Datu, Sabah, Malaysia 91100",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.991814,
      "longitude": 118.341263
    },
    "name": "MASJID JAMEK AL-HUDA",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "415f6a39-47f3-4963-8478-a0d0a3126e59",
    "geohash": "w8uhkutrrm",
    "source_musolla_id": "MY-12-LD-00544",
    "directions": "1. Berdekatan dengan pusat peranginan.\n2. berhadapan dengan pantai Bandar Lahad Datu"
  },
  "w8uh66jztz": {
    "address": "Lahad Datu, Sabah, Malaysia 91100",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.978137,
      "longitude": 118.232023
    },
    "name": "MASJID NUR HIDAYAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "0e155cbb-e126-451a-8131-8894506a1b09",
    "geohash": "w8uh66jztz",
    "source_musolla_id": "MY-12-LD-00567"
  },
  "w8uh1t2u7x": {
    "address": "Lahad Datu, Sabah, Malaysia 91100",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.951482,
      "longitude": 118.192104
    },
    "name": "MASJID NURUL NAIM",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "b603f641-e200-4137-88be-3b91f7c4199c",
    "geohash": "w8uh1t2u7x",
    "source_musolla_id": "MY-12-LD-00568"
  },
  "w8uh15qr4g": {
    "address": "Lahad Datu, Sabah, Malaysia 91100",
    "createdAt": "2018-09-09T15:44:09+08:00",
    "location": {
      "latitude": 4.94095,
      "longitude": 118.177654
    },
    "name": "MASJID NURUL HIKMAH",
    "type": "Mosque",
    "updatedAt": "2018-09-09T15:44:09+08:00",
    "uuid": "7cda396b-5fcc-440a-8e8b-5f8e9274b166",
    "geohash": "w8uh15qr4g",
    "source_musolla_id": "MY-12-LD-00573"
  }
}